100 '(プログラムを)終了するを選択
110 cls 3
120 'AC.2019
130 '数秘術占い 2019.08.16
140 '改変履歴
150 'AC.2021
160 '"2021.03.31 α版 画面背景アップデート"
170 '"2021.04.02 β版 更にアップデート音声追加"
180 '"2021.04.03 β2版 画面表示拡張"
190 'AC.2023
200 '"2023.05.20 β3版　入力方式拡張"
210 'Version 更新履歴
220 '2023.06.04:Ver100_20230604
230 '2023.06.11:Ver101_20230611
240 '2023.06.18:Ver102_20230618
250 '2023.06.25:Ver103_20230625
260 '2023.07.02:Ver104_20230702
270 '2023.07.09:Ver105_20230709
280 '2023.07.16:Ver106_20230716
290 '2023.07.23:Ver107_20230723
300 '2023.07.30:Ver108_20230730
310 '2023.08.06:Ver109_20230806
320 '2023.08.13:Ver110_20230813
330 '2023.08.20:Ver111_20230820
340 '2023.08.27:Ver112_20230827
350 '2023.09.03:Ver113_20230903
360 '2023.09.10:Ver114_20230910
370 '2023.09.17:Ver115_20230917
380 '2023.09.24:Ver116_20230924
390 '2023.10.01:Ver117_20231001
400 '2023.10.08:Ver118_20231008
410 '2023.10.15:Ver119_20231015
420 '2023.10.22:Ver120_20231022
430 '2023.10.29:Ver121_20231029
440 '2023.11.05:Ver122_20231105
450 '2023.11.12:Ver123_20231112
460 '2023.11.19:Ver124_20231119
470 '2023.11.26:Ver125_20231126
480 '2023.12.03:Ver126_20231203
490 '2023.12.10:Ver127_20231210
500 '2023.12.17:Ver128_20231217
510 '2023.12.24:Ver129_20231224
520 '2023.12.31:Ver130_20231231
530 'AC.2024.01(Jan)
540 '2024.01.07:Ver131_20240107
550 '2024.01.14:Ver132_20240114
560 '2024.01.21:Ver133_20240121
570 '2024.01.28:Ver134_20240128
580 'AC.2024.02(Feb)
590 '2024.02.04:Ver135_20240204
600 '2024.02.11:Ver136_20240211
610 '2024.02.18:Ver137_20240218
620 '2024.02.25:Ver138_20240225
630 'AC.2024.03 (March)
640 '2024.03.03:Ver139_20240303
650 '2024.03.11:Ver140_20240311
660 '2024.03.18:Ver141_20240317
670 '2024.03.24:Ver142_20240324
680 Version$ = "Ver:1.4.2_20240324b"
690 'Gazo Folder Japan
700 Gazo$ = "./data/Picture/"
710 'Gazo Size folder
720 Gazo_1920x1200$ = "./1920x1200/"
730 Gazo_WXGA$ = "./907x680/"
740 'Gazo Folder English
750 Gazo_Eng$ = "./data/Picture/English/"
760 'Voice Folder 2023
770 Voice$ = "./data/Voice/Voice/"
780 'BirtheyeChart Data:20230626
790 Birth_eye_chart$ = "./data/chart_data/"
800 'Data Folder
810 Data$ = "./data/data/"
820 'Business Aisyou 結果説明保存フォルダ
830 Business_Aisyou_Explain$ = "./data/data/Business_Aisyou/"
840 'Save BirdsEyeGrit List Folder
850 Save_data_Birdseye$ = "./data/Parsonal_data/"
860 '変数定義 パート
870 b=0:c=0:n=0:count=0
880 '***********************************************************
890 '1.WXGAの時
900 '(1200 x 800)
910 '***********************************************************
920 if (((size(1) <= 1200) and (size(1) <= 800))) then
930 X=5:Y=200
940 FONT=32
950 '***********************************************************
960 '1.WXGAの時
970 '(1200 x 800)
980 '***********************************************************
990 else
1000 '***********************************************************
1010 '2.WUXGAの時(WXGA以外の時)
1020 '(1920 gload Gazo$ + "Selection.png",1,60,240
1030 '***********************************************************
1040 X=5:Y=300
1050 FONT=48
1060 '***********************************************************
1070 '2.WUXGAの時(WXGA以外の時)
1080 '(1920 x 1200)
1090 '***********************************************************
1100 endif
1110 'dim buffer_List$(11,1)
1120 dim buf_name1$(10),buf_name2$(10)
1130 dim buffer(9),buf_chart$(26,2)
1140 'ビジネスの相性　データー
1150 dim Buffer_Business_Aisyou$(12,12)
1160 '男女の相性
1170 dim Buffer_Bitween_sexes_Aisyou$(12,12)
1180 '生れた年代
1190 dim buf_year(4):buf_year$ = ""
1200 dim buf_month(2)
1210 dim buf_day(2)
1220 'フォーカスライン　配列
1230 dim Forcus1_buffer$(3)
1240 dim Forcus2_buffer$(3)
1250 dim Forcus3_buffer$(2)
1260 '生れた月
1270 buf_Month$ = ""
1280 '生れた日
1290 buf_Day$ = ""
1300 'buffer_name$(3):Name Data x 2 & 上司の名前 (文字データー)
1310 dim buffer_name$(3)
1320 '1-1.上司の誕生日(数値データー)
1330 dim buf_Jyoushi_Born_Day(3)
1340 '1-2.上司の数秘ナンバー(数値データー)
1350 buf_Jyoushi_Kabara_Num = 0
1360 '2-1.部下の誕生日(数値データー)
1370 dim buf_Buka_Born_Day(3)
1380 '2-2.部下の数秘ナンバー(数秘データー)
1390 buf_Buka_Kabara_Num = 0
1400 dim buf_male_year(4)
1410 dim buf_male_month(2)
1420 dim buf_male_Born_Day(2)
1430 dim buf_feMale_Born_Day(2)
1440 dim buf_female_day(2)
1450 count=0
1460 'Birds Eye List 配列
1470 dim List$(6)
1480 '部下の数秘ナンバー
1490 'File 読み込み
1500 '1.ビジネスの相性占い
1510 open Data$ + "Kabara_Business_Aisyou.csv" for input as #1
1520 for i=0 to 11
1530 for j=0 to 11
1540 input #1,a$
1550 Buffer_Business_Aisyou$(j,i) = a$
1560 next j
1570 next i
1580 close #1
1590 '2.男女の相性占い
1600 open Data$ + "Kabara_bitween_sexes_Aisyou.csv" for input as #1
1610 for i=0 to 11
1620 for j=0 to 11
1630 input #1,a$
1640 Buffer_Bitween_sexes_Aisyou$(j,i) = a$
1650 next j
1660 next i
1670 close #1
1680 '2.Birth Eye chart$
1690 '2.バーズアイグリッドを読み込む
1700 open Birth_eye_chart$ + "Birtheyechart.dat" for input as #1
1710 for j=0 to 25
1720 for i=0 to 1
1730 input #1,a$
1740 buf_chart$(j,i) = a$
1750 next i
1760 next j
1770 close #1
1780 'File 読み込み　ここまで
1790 'Main画面
1800 screen 1,1,1,1
1810 Main_Screen:
1820 cls 3:
1830 No=0
1840 '***********************************************************
1850 '1.WXGAの時
1860 '(1200 x 800)
1870 '***********************************************************
1880 if ((size(0) <= 1280) and (size(1) <= 800)) then
1890 gload Gazo$ + "Selection.png",1,5,220
1900 gload Gazo$ + "Selection.png",1,5,320
1910 gload Gazo$ + "Selection.png",1,5,420
1920 gload Gazo$ + "Selection.png",1,5,520
1930 '***********************************************************
1940 '1(4)
1950 gload Gazo$ + "Selection.png",1,130,420
1960 '2(5)
1970 gload Gazo$ + "Selection.png",1,280,420
1980 '3(6)
1990 gload Gazo$ + "Selection.png",1,430,420
2000 '4(7)
2010 gload Gazo$ + "Selection.png",1,130,330
2020 '5(8)
2030 gload Gazo$ + "Selection.png",1,280,330
2040 '6(9)
2050 'gload Gazo$ + "Selection.png",1,70,500
2060 gload Gazo$ + "Selection.png",1,430,330
2070 '7(10)
2080 gload Gazo$ + "Selection.png",1,130,250
2090 '8(11)
2100 gload Gazo$ + "Selection.png",1,280,250
2110 '9(12)
2120 gload Gazo$ + "Selection.png",1,430,250
2130 '0(13)
2140 gload Gazo$ + "Selection.png",1,280,495
2150 '14:(-1)OK ボタン
2160 gload Gazo$ + "Selection.png",1,430,495
2170 '***********************************************************
2180 '1.WXGAの時
2190 '(1200 x 800)
2200 '***********************************************************
2210 else
2220 '***********************************************************
2230 '2.WXGA(1200 x 800)以外の時
2240 '(1920 x 1200)のサイズ
2250 '***********************************************************
2260 gload Gazo$ + "Selection.png",1,5,200
2270 gload Gazo$ + "Selection.png",1,5,300
2280 gload Gazo$ + "Selection.png",1,5,400
2290 gload Gazo$ + "Selection.png",1,5,500
2300 '4:1
2310 gload Gazo$ + "Selection.png",1,35,300
2320 '5:2
2330 gload Gazo$ + "Selection.png",1,35,400
2340 '6:3
2350 gload Gazo$ + "Selection.png",1,35,500
2360 '7:4
2370 gload Gazo$ + "Selection.png",1,70,300
2380 '8:5
2390 gload Gazo$ + "Selection.png",1,70,400
2400 '9:6
2410 gload Gazo$ + "Selection.png",1,70,500
2420 '10:7
2430 gload Gazo$ + "Selection.png",1,540,300
2440 '11:8
2450 gload Gazo$ + "Selection.png",1,540,400
2460 '12:9
2470 gload Gazo$ + "Selection.png",1,540,500
2480 '13:0
2490 gload Gazo$ + "Selection.png",1,150,400
2500 '-1:Ok
2510 gload Gazo$ + "Selection.png",1,200,400
2520 '***********************************************************
2530 '2.WXGA(1200 x 800)以外の時
2540 '(1920 x 1200)のサイズ
2550 '***********************************************************
2560 endif
2570 if ex_info$(1) <> "JP" then
2580 '英語　トップ画面
2590 gload Gazo_Eng$ + "Kabara_TopScreen_Eng_20240110.png",0,0,0
2600 'put@(0,0),1280,800,(1080,800)
2610 else
2620 '**********************************************************
2630 '［機能］　グラフィックバッファ（2番目の座標）からグラフィック画面（1番目の座標）へ画像データを引き出します。
2640 '
2650 '　［書式］　PUT@(x1,y1),w1,h1,(x2,y2)[,[w2],[h2][,描画モード]]
2660 '　［説明］
2670 '　　w1,w2=横サイズ h1,h2= 縦サイズ
2680 '　　転写元と転写先のサイズが異なる場合、拡大縮小描画されます。
2690 '　　各種重ね合わせの方式は pen命令で設定することができます。
2700 '　　<描画モード>の指定で次の選択ができます。
2710 '　　 0. グラフィックバッファからグラフィック画面への描画。
2720 '　　 1. グラフィック画面からグラフィック画面への描画。
2730 '　　 2. グラフィックバッファからグラフィックバッファへの描画。
2740 '***********************************************************'
2750 '*************************************************************************************************
2760 'if (((size(0) >= 1280) and (size(0) <= 1920)) and ((size(1) <= 1200) and (size(1) > 800))) then
2770 '日本語トップスクリーン
2780 'gload Gazo$ + "TopScreen_20230310.png",0,0,0
2790 'else
2800 '1.WXGAの時
2810 '************************************************************************************************
2820 if ((size(0) <= 1280) and (size(1) <= 800)) then
2830 gload Gazo$ + Gazo_WXGA$ + "Screen1_907x680_20240214.png",0,0,0
2840 else
2850 '************************************************************************************************
2860 '2.WXGA以外の時
2870 '************************************************************************************************
2880 gload Gazo$ + "TopScreen_20230310.png",0,0,0
2890 endif
2900 'put@(0,0),1280,800,(1080,800),,,0
2910 endif
2920 '***********************************************************************************************
2930 'if (((size(0) >= 1280) and (size(0) <= 1920)) and ((size(1) <= 1200) and (size(1) > 800))) then
2940 '***********************************************************************************************
2950 if ((size(0) <= 1280) and (size(1) <= 800)) then
2960 '************************************************************************************************
2970 'WXGAの場合　ここから (1280 x 800)
2980 '************************************************************************************************
2990 sp_def 0,(5,220),32,32
3000 sp_def 1,(5,320),32,32
3010 sp_def 2,(5,420),32,32
3020 sp_def 3,(5,520),32,32
3030 '1(4)
3040 sp_def 4,(130,420),32,32
3050 '2(5)
3060 sp_def 5,(280,420),32,32
3070 '3(6)
3080 sp_def 6,(430,420),32,32
3090 '4(7)
3100 sp_def 7,(130,330),32,32
3110 '5(8)
3120 sp_def 8,(280,330),32,32
3130 '6(9)
3140 sp_def 9,(430,330),32,32
3150 '9(10):9
3160 sp_def 10,(130,250),32,32
3170 '6(11):6
3180 sp_def 11,(280,250),32,32
3190 '9(12):3
3200 sp_def 12,(430,250),32,32
3210 sp_def 13,(280,495),32,32
3220 '14:OK ボタン (-1)
3230 sp_def 14,(430,495),32,32
3240 'Sprite OFF
3250 sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_on 4,0:sp_on 5,0:sp_on 6,0
3260 sp_on 7,0:sp_on 8,0:sp_on 9,0:sp_on 10,0:sp_on 11,0:sp_on 12,0:sp_on 13,0:sp_on 14,0
3270 sp_put 0,(5,220),0,0
3280 sp_put 1,(5,320),1,0
3290 sp_put 2,(4,420),2,0
3300 sp_put 3,(5,520),3,0
3310 '1
3320 sp_put 4,(130,420),4,0
3330 '2
3340 sp_put 5,(280,420),5,0
3350 '3
3360 sp_put 6,(430,420),6,0
3370 '4
3380 sp_put 7,(130,330),7,0
3390 '5
3400 sp_put 8,(280,330),8,0
3410 '6
3420 sp_put 9,(430,330),9,0
3430 '7
3440 sp_put 10,(130,250),10,0
3450 '8
3460 sp_put 11,(280,250),11,0
3470 '9
3480 sp_put 12,(430,250),12,0
3490 '0
3500 sp_put 13,(280,495),13,0
3510 '14:OK ボタン
3520 sp_put 14,(430,495),14,0
3530 '************************************************************************************************
3540 'WXGAの場合　ここまで (1280 x 800)
3550 '************************************************************************************************
3560 else
3570 '選択肢の丸
3580 '************************************************************************************************
3590 'WUXGAの場合　ここから (1920 x 1280)
3600 '************************************************************************************************
3610 gload Gazo$ + "downscreen.png",0,0,800
3620 sp_def 0,(5,300),32,32
3630 sp_def 1,(5,400),32,32
3640 sp_def 2,(5,500),32,32
3650 sp_def 3,(5,600),32,32
3660 '************************************************************************************************
3670 'sp_def  1920x1260 ここから
3680 '************************************************************************************************
3690 '1
3700 sp_def 4,(35,300),32,32
3710 '2
3720 sp_def 5,(35,400),32,32
3730 '3
3740 sp_def 6,(35,500),32,32
3750 '4:9
3760 sp_def 7,(70,300),32,32
3770 '5:6
3780 sp_def 8,(70,400),32,32
3790 '6:3
3800 sp_def 9,(70,500),32,32
3810 '**********************************************************************************************
3820 '10:7
3830 'gload Gazo$ + "Selection.png",1,430,300
3840 '11:8
3850 'gload Gazo$ + "Selection.png",1,430,420
3860 '12:9
3870 'gload Gazo$ + "Selection.png",1,430,500
3880 '**********************************************************************************************
3890 '7:3
3900 sp_def 10,(540,300),32,32
3910 '8:6
3920 sp_def 11,(540,400),32,32
3930 '9:9
3940 sp_def 12,(540,500),32,32
3950 '************************************************************************************************
3960 '0
3970 sp_def 13,(150,400),32,32
3980 '-1:ok Button
3990 sp_def 14,(200,400),32,32
4000 '************************************************************************************************
4010 'sp_def 1920x1260 ここまで
4020 '************************************************************************************************
4030 '1
4040 'sp_def 4,(35,300),32,32
4050 '2
4060 'sp_def 5,(35,400),32,32
4070 '3
4080 'sp_def 6,(35,500),32,32
4090 '4
4100 'sp_def 7,(70,300),32,32
4110 '5
4120 'sp_def 8,(70,400),32,32
4130 '6
4140 'sp_def 9,(70,500),32,32
4150 '7
4160 'sp_def 10,(110,300),32,32
4170 '8
4180 'sp_def 11,(110,400),32,32
4190 '9
4200 'sp_def 12,(110,400),32,32
4210 'sp_def 13,(150,400),32,32
4220 'sp_def 14,(200,400),32,32
4230 'Sprite OFF
4240 sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_on 4,0:sp_on 5,0:sp_on 6,0
4250 sp_on 7,0:sp_on 8,0:sp_on 9,0:sp_on 10,0:sp_on 11,0:sp_on 12,0:sp_on 13,0:sp_on 14,0
4260 '***********************************************************************************************************
4270 '選択肢の●　ここから  1920x1260  ここから
4280 '***********************************************************************************************************
4290 sp_put 0,(5,300),0,0
4300 sp_put 1,(5,400),1,0
4310 sp_put 2,(5,500),2,0
4320 sp_put 3,(5,600),3,0
4330 '***********************************************************************************************************
4340 '選択肢の● ここまで 1920x1260    ここまで
4350 '**********************************************************************************************************
4360 '********************************************************************************************************
4370 'sp_put 1920x1260 ここから
4380 '*********************************************************************************************************
4390 '1. 左
4400 '1
4410 sp_put 4,(130,300),4,0
4420 '2
4430 sp_put 5,(130,400),5,0
4440 '3
4450 sp_put 6,(130,500),6,0
4460 '2.中央
4470 '4
4480 sp_put 7,(340,300),7,0
4490 '5
4500 sp_put 8,(340,400),8,0
4510 '6
4520 sp_put 9,(340,500),9,0
4530 '右
4540 '7 (3)
4550 sp_put 10,(540,300),10,0
4560 '8 (6)
4570 sp_put 11,(540,400),11,0
4580 '9 (9)
4590 sp_put 12,(540,500),12,0
4600 '0
4610 sp_put 13,(340,600),13,0
4620 'ok Button
4630 sp_put 14,(540,600),14,0
4640 '*********************************************************************************************************
4650 'sp_put 1920x1260 ここまで
4660 '**********************************************************************************************************
4670 '1
4680 'sp_put 4,(130,300),4,0
4690 '2
4700 'sp_put 5,(130,400),5,0
4710 '3
4720 'sp_put 6,(130,500),6,0
4730 '4
4740 'sp_put 7,(340,300),7,0
4750 '5
4760 'sp_put 8,(340,400),8,0
4770 '6
4780 'sp_put 9,(340,500),9,0
4790 '7
4800 'sp_put 10,(540,300),10,0
4810 '8
4820 'sp_put 11,(540,400),11,0
4830 '9
4840 'sp_put 12,(540,500),12,0
4850 '0
4860 'sp_put 13,(340,600),13,0
4870 'sp_put 14,(540,600),14,0
4880 '************************************************************************************************
4890 'WUXGAの場合　ここまで  (1920 x 1200)
4900 '************************************************************************************************
4910 endif
4920 Main_Top:
4930 'Main Message 2023.06.07
4940 '再生を止める
4950 play ""
4960 init "kb:4"
4970 'font 32:
4980 font 40
4990 if ex_info$(1) <> "JP" then
5000 '1.英語表示ターム
5010 print chr$(13) + chr$(13) + chr$(13)
5020 color rgb(217,255,212)
5030 print "Please Select Number?" + chr$(13)+chr$(13)
5040 '0
5050 print " :1.Kabara Fortune..." + chr$(13)+chr$(13)
5060 '1
5070 print " :2.Setting" + chr$(13)+chr$(13)
5080 '2
5090 print " :3.Help" + chr$(13)
5100 '3
5110 print " :4.(Finishing)Program" + chr$(13)
5120 COLOR rgb(0,0,0):No=0
5130 locate 1,15
5140 print "                                        "
5150 locate 1,15
5160 print "1.It has Selected Kabara Fortune Telling"
5170 '1.英語表示ターム
5180 '---------音声 日本語　英語に変える----------------
5190 'play Voice$ + "Voice_Main_Message_20230607.mp3"
5200 '---------音声 日本語　英語に変える----------------
5210 else
5220 '2.日本語表示ターム
5230 'Main_Screen_Select:
5240 '************************************************************************************************
5250 '1.WXGAの場合　ここから (1280 x 800)
5260 '************************************************************************************************
5270 if ((size(0) <= 1280) and (size(1) <= 800)) then
5280 '************************************************************************************************
5290 '1.WXGAの場合　ここから (1280 x 800)
5300 '************************************************************************************************
5310 font FONT
5320 color rgb(217,255,212)
5330 locate 1,5
5340 print "番号を選んでください"
5350 '0
5360 locate 1,7
5370 print " :1.数秘術占い"
5380 '1
5390 locate 1,10
5400 print " :2.設 定"
5410 '2
5420 locate 1,13
5430 print " :3.ヘルプ"
5440 '3
5450 locate 1,16
5460 print " :4.(プログラムを)終了する"
5470 COLOR rgb(0,0,0):No=0
5480 'locate 1,15
5490 '3行下げる
5500 if (count = 0) then
5510 locate 1,19
5520 print "           "
5530 locate 1,19:color rgb(0,0,0):print "1.数秘術占いを選択"
5540 play Voice$ + "Voice_Main_Message_20230607.mp3"
5550 endif
5560 '************************************************************************************************
5570 '1.WXGAの場合　ここまで (1280 x 800)
5580 '************************************************************************************************
5590 '2.日本語表示ターム
5600 else
5610 '************************************************************************************************
5620 '2.WXGA以外の場合（WUXGAの場合）　ここから (1920 x 1280)
5630 '************************************************************************************************
5640 font FONT
5650 print chr$(13) + chr$(13) + chr$(13)
5660 color rgb(217,255,212)
5670 print "番号を選んでください" + chr$(13)
5680 '0
5690 print " :1.数秘術占い" + chr$(13)
5700 '1
5710 print " :2.設 定" + chr$(13)
5720 '2
5730 print " :3.ヘルプ" + chr$(13)
5740 '3
5750 print " :4.(プログラムを)終了する" + chr$(13)
5760 COLOR rgb(0,0,0):No=0
5770 'locate 1,15
5780 '3行下げる
5790 if count=0 then
5800 locate 1,15
5810 print "           "
5820 locate 1,15:color rgb(0,0,0):print "1.数秘術占いを選択"
5830 play Voice$ + "Voice_Main_Message_20230607.mp3"
5840 endif
5850 '************************************************************************************************
5860 '2.WXGA以外の場合（WUXGAの場合）　ここまで (1920 x 1280)
5870 '************************************************************************************************
5880 endif
5890 '************************************************************************************************
5900 '2.WXGA以外の場合（WUXGAの場合）　ここまで (1920 x 1280)
5910 '************************************************************************************************
5920 endif
5930 Main_Screen_Select:
5940 y = 0:key$ = "":bg = 0:bg2=0
5950 while ((key$ <> chr$(31)) and (key$ <> chr$(13)) and (key$ <> chr$(30)) and (y <> 1) and (y <> -1) and (bg <> 2) and (bg2 <> 2))
5960 y = stick(1)
5970 '"May (2023)"
5980 key$ = inkey$
5990 bg = strig(1)
6000 bg2 = strig(0)
6010 pause 200
6020 wend
6030 '*******************************************************************************************************************************
6040 '  WUXGA(1920 x 1200)
6050 '  X=5:Y=300
6060 '  WXGA (1280 x 800)
6070 '  X=5:Y=200
6080 '*******************************************************************************************************************************
6090 '1.
6100 'ジョイパッドのソース ソート　ここから
6110 'カーソル　下 or 十字キー下
6120 '************************************************************************************************
6130 '1.WXGAの場合　ここから (1280 x 800)
6140 '************************************************************************************************
6150 if ((size(0) <= 1280) and (size(1) <= 800)) then
6160 '************************************************************************************************
6170 '1.WXGAの場合　ここから (1280 x 800)
6180 '************************************************************************************************
6190 if ((y = 1) or (key$ = chr$(31))) then
6200 select case No
6210 case 0:
6220 '1
6230 No = 1:sp_on 0,0:sp_on 1,1:sp_on 2,0:sp_on 3,0:sp_put 1,(X,Y+120),0,0:count = count + 1:beep:pause 200:gosub TopScreenRecheck:locate 1,19:print "                          ":locate 1,19:color rgb(0,0,0):print "2.設 定を選択":count=cunt+1:goto Main_Screen_Select:
6240 case 1:
6250 '2
6260 No = 2:sp_on 1,0:sp_on 2,1:sp_on 3,0:sp_put 2,(X,Y+220),0,0:beep:count = count + 1:pause 200:gosub TopScreenRecheck:locate 1,19:print "                                 ":locate 1,19:color rgb(0,0,0):print "3.ヘルプを選択":count=count+1:goto Main_Screen_Select:
6270 case 2:
6280 '3
6290 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(X,Y+320),0,0:beep:count = count + 1:pause 200:gosub TopScreenRecheck:locate 1,19:print "                            ":locate 1,19:color rgb(0,0,0):print "4.(プログラムを)終了するを選択":count=count+1:goto Main_Screen_Select:
6300 case 3:
6310 '0
6320 No=0:sp_on 0,1:sp_on 3,0:sp_on 1,0:sp_on 2,0:sp_put 0,(X,Y+20),0,0:beep:pause 200:count = count + 1:gosub TopScreenRecheck:locate 1,19:print "                              ":locate 1,19:color rgb(0,0,0):print "1.数秘術占いを選択":count=count+1:goto Main_Screen_Select:
6330 end select
6340 endif
6350 '2.
6360 'カーソル　上　or 十字キー  上
6370 if ((y = -1) or (key$ = chr$(30))) then
6380 select case No
6390 case 0:
6400 '3
6410 No=3:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,1:sp_put 3,(X,Y+320),0,0:beep:count = count + 1:pause 200:gosub TopScreenRecheck:locate 1,19:print "                              ":locate 1,19:COLOR rgb(0,0,0):print "4.(プログラムを)終了するを選択":goto Main_Screen_Select:
6420 case 1:
6430 '0
6440 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(X,Y+20),0,0:beep:count = count + 1:pause 200:gosub TopScreenRecheck:locate 1,19:print "                            ":locate 1,19:COLOR rgb(0,0,0):print  "1.数秘術占いを選択":goto Main_Screen_Select:
6450 case 2:
6460 '1
6470 No=1:sp_on 0,0:sp_on 1,1:sp_on 2,0:sp_on 3,0:sp_put 1,(X,Y+120),0,0:beep:count = count + 1:pause 200:gosub TopScreenRecheck:locate 1,19:print "                          ":locate 1,19:color rgb(0,0,0):print "2.設 定を選択":goto Main_Screen_Select:
6480 case 3:
6490 '2
6500 No=2:sp_on 0,0:sp_on 1,0:sp_on 2,1:sp_on 3,0:sp_put 2,(X,Y+220),0,0:beep:count = count + 1:pause 200:gosub TopScreenRecheck:locate 1,19:print "                   ":locate 1,19:color rgb(0,0,0):print "3.ヘルプを選択":goto Main_Screen_Select:
6510 end select
6520 endif
6530 'ジョイパッド　ソース 部分　ここまで
6540 'ジョイパッド右　　or Enter key 決定
6550 if ((bg = 2) OR (key$ = chr$(13))) then
6560 select case No
6570 case 0:
6580 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:count=0:goto Kabara_TopScreen: 'Kabara_First_Top:
6590 case 1:
6600 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:count=0:goto Setting:
6610 case 2:
6620 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:count=0:goto Help:
6630 case 3:
6640 play "":pause 200
6650 play Voice$ + "Voice_Finish_Program_20230607.mp3":ui_msg "プログラムを終了します":Gosub Data_erase:pause 200:color rgb(255,255,255):cls 3:cls 4:font 16:end
6660 end select
6670 endif
6680 if (bg2 = 2) then
6690 play "":pause 200
6700 play Voice$ + "Voice_Main_Message_20230607.mp3"
6710 goto Main_Screen_Select:
6720 endif
6730 '************************************************************************************************
6740 '1.WXGAの場合　ここまで (1280 x 800)
6750 '************************************************************************************************
6760 else
6770 '************************************************************************************************
6780 '2.WXGA以外の場合（WUXGAの場合）　ここから (1920 x 1280)
6790 '************************************************************************************************
6800 if ((y = 1) or (key$ = chr$(31))) then
6810 select case No
6820 case 0:
6830 '1
6840 No = 1:sp_on 0,0:sp_on 1,1:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.設 定を選択":goto Main_Screen_Select:
6850 case 1:
6860 '2
6870 No = 2:sp_on 1,0:sp_on 2,1:sp_on 3,0:sp_put 2,(5,500),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "3.ヘルプを選択":goto Main_Screen_Select:
6880 case 2:
6890 '3
6900 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "4.(プログラムを)終了するを選択":goto Main_Screen_Select:
6910 case 3:
6920 '0
6930 No=0:sp_on 0,1:sp_on 3,0:sp_on 1,0:sp_on 2,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                                ":locate 1,15:print "1.数秘術占いを選択":goto Main_Screen_Select:
6940 end select
6950 endif
6960 '2.
6970 'カーソル　上　or 十字キー  上
6980 '************************************************************************************************
6990 '2.WXGA以外の場合（WUXGAの場合）　ここから (1920 x 1280)
7000 'カーソル　上　or 十字キー  上
7010 '************************************************************************************************
7020 if ((y = -1) or (key$ = chr$(30))) then
7030 select case No
7040 case 0:
7050 '3
7060 No=3:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,1:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                                          ":locate 1,15:print "4.(プログラムを)終了するを選択":goto Main_Screen_Select:
7070 case 1:
7080 '0
7090 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                                          ":locate 1,15:print  "1.数秘術占いを選択":goto Main_Screen_Select:
7100 case 2:
7110 '1
7120 No=1:sp_on 0,0:sp_on 1,1:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),0,0:beep:pause 200:locate 1,15:print "                                                                                ":locate 1,15:print "2.設 定を選択":goto Main_Screen_Select:
7130 case 3:
7140 '2
7150 No=2:sp_on 0,0:sp_on 1,0:sp_on 2,1:sp_on 3,0:sp_put 2,(5,500),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "3.ヘルプを選択":goto Main_Screen_Select:
7160 end select
7170 endif
7180 'ジョイパッド　ソース 部分　ここまで
7190 '***************************************************************************************************************
7200 'ジョイパッド右　　or Enter key 決定
7210 '***************************************************************************************************************
7220 if ((bg = 2) OR (key$ = chr$(13))) then
7230 select case No
7240 case 0:
7250 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:count=0:goto Kabara_TopScreen:  'Kabara_First_Top:
7260 case 1:
7270 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:count=0:goto Setting:
7280 case 2:
7290 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:count=0:goto Help:
7300 case 3:
7310 play "":pause 200
7320 play Voice$ + "Voice_Finish_Program_20230607.mp3":ui_msg "プログラムを終了します":Gosub Data_erase:pause 200:color rgb(255,255,255):cls 3:cls 4:end
7330 end select
7340 endif
7350 '*****************************************************************************************
7360 'ジョイパッド 左ボタン：トップ画面
7370 '*****************************************************************************************
7380 if (bg2 = 2) then
7390 play "":pause 200
7400 play Voice$ + "Voice_Main_Message_20230607.mp3"
7410 goto Main_Screen_Select:
7420 endif
7430 '************************************************************************************************
7440 '2.WXGA以外の場合（WUXGAの場合）　ここまで (1920 x 1280)
7450 '************************************************************************************************
7460 endif
7470 'Version
7480 Version:
7490 cls 3:PLAY ""
7500 if ((size(0) <= 1280) and (size(1) <= 800)) then
7510 '************************************************************************************************
7520 '1.WXGA ここから (1280 x 800)
7530 '************************************************************************************************
7540 gload Gazo$   + Gazo_WXGA$ + "VersionScreen_918x680_20240219.png",0,0,0
7550 '************************************************************************************************
7560 '1.WXGA ここまで (1280 x 800)
7570 '************************************************************************************************
7580 else
7590 '************************************************************************************************
7600 '2.WXGA以外の場合（WUXGAの場合）　ここから (1920 x 1280)
7610 '************************************************************************************************
7620 gload Gazo$  + "VersionScreen_20230601.png",0,0,0
7630 gload Gazo$ + "downscreen.png",0,0,800
7640 '************************************************************************************************
7650 '2.WXGA以外の場合（WUXGAの場合）　ここまで (1920 x 1280)
7660 '************************************************************************************************
7670 endif
7680 init"kb:4":font FONT
7690 'talk"バージョン情報です"
7700 'Message :Version
7710 play Voice$ +  "Voice_Version_Message_20230607.mp3"
7720 if ((size(0) <= 1280) and (size(1) <= 800)) then
7730 color rgb(0,0,255)
7740 locate 1,5
7750 print "・Title:数秘術占い";chr$(13)
7760 locate 1,8
7770 print "・" + Version$ + chr$(13)
7780 locate 1,10
7790 print "・Author:licksjp"+chr$(13)
7800 locate 1,13
7810 print "・E-mail:licksjp@gmail.com" + chr$(13)
7820 locate 0,15
7830 print "(C)licksjp All rights " + chr$(13)
7840 locate 7,16
7850 print "reserved since 2009"+chr$(13)
7860 locate 0,19
7870 color rgb(255,255,255)
7880 print "ジョイパッドの右を押してください"
7890 else
7900 locate 0,3
7910 color rgb(0,0,255)
7920 print "・Title:数秘術占い";chr$(13)
7930 print "・" + Version$ + chr$(13)
7940 print "・Author:licksjp"+chr$(13)
7950 print "・E-mail:licksjp@gmail.com" + chr$(13)
7960 locate 0,12
7970 print "(C)licksjp All rights " + chr$(13)
7980 locate 7,13
7990 print "reserved since 2009"+chr$(13)
8000 locate 0,18
8010 color rgb(255,255,255)
8020 print "ジョイパッドの右を押してください"
8030 endif
8040 Versionn_Selection:
8050 bg = 0:key$ = "":bg2 = 0
8060 while ((bg <> 2) and (key$ <> chr$(13)) and (bg2 <> 2))
8070 bg = strig(1)
8080 key$ = inkey$
8090 bg2 = strig(0)
8100 pause 200
8110 wend
8120 if ((bg = 2) or (key$ = chr$(13))) then
8130 cls 4:goto Main_Screen:
8140 endif
8150 if (bg2=2) then
8160 play "":pause 200
8170 play Voice$ + "Voice_Version_Message_20230607.mp3"
8180 goto Versionn_Selection:
8190 endif
8200 '1.数秘ナンバーを求める
8210 '誕生日入力(生れた年代)
8220 Input_Seireki:
8230 '************************************************************************************************
8240 '1.WXGAの時1200x800の時
8250 '************************************************************************************************
8260 '************************************************************************************************
8270 '2.WUXGAの時1920x1200の時
8280 '************************************************************************************************
8290 cls 3:play "":count=0:count2=0
8300 'No = -1:Okのとき
8310 init"kb:4":key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_year$ = "****"
8320 '************************************************************************************************
8330 '配列buf_year(4)を0で埋める。:データー初期化 ここから
8340 '************************************************************************************************
8350 for i=0 to 3
8360 buf_year(i)=0
8370 next i
8380 '************************************************************************************************
8390 '配列buf_year(4)を0で埋める。 :データー初期化　ここまで
8400 '************************************************************************************************
8410 '************************************************************************************************
8420 '1.WXGAの時1200x800の時
8430 '************************************************************************************************
8440 if ((size(0) <= 1280) and (size(1) <= 800)) then
8450 gload Gazo$ + Gazo_WXGA$ + "Screen2_907x680_20240216.png",0,0,0
8460 else
8470 '************************************************************************************************
8480 '2.WUXGAの時1920x1200の時
8490 '************************************************************************************************
8500 gload Gazo$ + "Screen2.png",0,0,0
8510 gload Gazo$ + "downscreen.png",0,0,800
8520 '************************************************************************************************
8530 '2.WUXGAの時1920x1200の時
8540 '************************************************************************************************
8550 endif
8560 'Init"kb:2"
8570 '音声ファイル再生 2023.06.07
8580 play Voice$ + "Voice_Input_Born_Year_20230607.mp3"
8590 font FONT
8600 locate 0,1
8610 if ex_info$(1) <> "JP" then
8620 color rgb(255,255,255)
8630 color rgb(255,255,255)
8640 print "Input Born Year?" + chr$(13)
8650 color rgb(255,255,255)
8660 locate 2,4
8670 print "Your Born Year(4 dedgit for AC):" + buf_year$
8680 else
8690 '文字色：黒　 color rgb(0,0,0)
8700 color rgb(255,255,255)
8710 print "生まれた年代を入れて下さい" + chr$(13)
8720 color rgb(255,255,255)
8730 locate 2,4
8740 print "生まれた年代(西暦4桁):" + buf_year$
8750 endif
8760 '=============================
8770 'テンキーの色(1~９)　白 ,決定ボタン　青
8780 '=============================
8790 color rgb(255,255,255)
8800 sp_on 4,0: sp_on 5,0:sp_on 6,0
8810 sp_on 7,0:sp_on 8,0:sp_on 9,0
8820 sp_on 10,0:sp_on 11,0:sp_on 12,0
8830 sp_on 13,0:sp_on 14,1
8840 Input_Seireki2:
8850 key$="":bg=0:y=0:y2=0:bg2=0:
8860 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
8870 key$ = inkey$
8880 bg = strig(1)
8890 y = stick(1)
8900 y2 = stick(0)
8910 bg2 = strig(0)
8920 pause 200
8930 wend
8940 if ((size(0) <= 1280) and (size(1) <= 800)) then
8950 '*************************************************************************************************************************
8960 'WXGA　1280 x 800 ここから
8970 '*************************************************************************************************************************
8980 '十字キー　ここから
8990 '上の矢印　または、十字キー上
9000 if ((y = -1) or (key$ = chr$(30))) then
9010 select case No
9020 'No=-1:okのとき:初期の状態
9030 '0kボタンから３に移動
9040 '上に行く 処理
9050 case -1:
9060 No=3:sp_on 6,1:sp_on 14,0:beep
9070 pause 200:goto Input_Seireki2:
9080 '選択肢:3
9090 '3ボタンから 6に移動
9100 case 3:
9110 No=6:sp_on 9,1:sp_on 6,0:beep
9120 pause 200:goto Input_Seireki2:
9130 '6ボタンから ９に移動
9140 case 6:
9150 No=9:sp_on 12,1:sp_on 9,0:beep
9160 pause 200:goto Input_Seireki2:
9170 '6ボタンから ９に移動　ここまで
9180 '9で上を押して何もしない
9190 case 9:
9200 '何もしない
9210 No=9
9220 beep:pause 200:goto Input_Seireki2:
9230 '9で上を押しても何もしない　ここまで
9240 '上　 0ボタンから2ボタン
9250 'sp_on 6,1:1
9260 'sp_on 8,1:5
9270 'sp_on 7,1:7
9280 case 0:
9290 No=2:sp_on 13,0:sp_on 5,1:beep
9300 pause 200:goto Input_Seireki2:
9310 '上  0ボタンから2ボタン　ここまで
9320 '2から５になる 上
9330 case 2:
9340 No=5:sp_on 8,1:sp_on 5,0:beep
9350 pause 200:goto Input_Seireki2:
9360 case 5:
9370 No=8:sp_on 11,1:sp_on 8,0:beep
9380 pause 200:goto Input_Seireki2:
9390 case 8:
9400 beep:pause 200:goto Input_Seireki2:
9410 case 1:
9420 No=4:sp_on 7,1:sp_on 4,0:beep
9430 pause 200:goto Input_Seireki2:
9440 case 4:
9450 No=7:sp_on 10,1:sp_on 7,0:beep
9460 pause 200:goto Input_Seireki2:
9470 case 7:
9480 beep:pause 200:goto Input_Seireki2:
9490 end select
9500 endif
9510 '左３　ここまで
9520 '下の矢印
9530 '中央 2
9540 if ((y=1) or (key$ = chr$(31))) then
9550 select case No
9560 '9から６に下げる
9570 case 9:
9580 No=6:sp_on 12,0:sp_on 9,1:beep
9590 pause 200:goto Input_Seireki2:
9600 '6から３に下げる
9610 case 6:
9620 No=3:sp_on 9,0:sp_on 6,1:beep
9630 pause 200:goto Input_Seireki2:
9640 '3から０ｋに変える
9650 case 3:
9660 No=-1:sp_on 14,1:sp_on 6,0:beep
9670 pause 200:goto Input_Seireki2:
9680 'Okから下のボタンを押しても何もしない
9690 case -1:
9700 beep:pause 200:goto Input_Seireki2:
9710 case 8:
9720 No=5:sp_on 8,1:sp_on 11,0:beep
9730 pause 200:goto Input_Seireki2:
9740 case 5:
9750 No=2:sp_on 5,1:sp_on 8,0:beep
9760 pause 200:goto Input_Seireki2:
9770 case 2:
9780 No=0:sp_on 13,1:sp_on 5,0:beep
9790 pause 200:goto Input_Seireki2:
9800 case 0:
9810 beep:pause 200:goto Input_Seireki2:
9820 case 7:
9830 No=4:sp_on 7,1:sp_on 10,0:beep
9840 pause 200:goto Input_Seireki2:
9850 case 4:
9860 No=1:sp_on 4,1:sp_on 7,0:beep
9870 pause 200:goto Input_Seireki2:
9880 case 1:
9890 beep:pause 200:goto Input_Seireki2:
9900 end select
9910 endif
9920 '左へボタン 十字キー　左　or 　カーソル左
9930 if ((y2 = -1) or (key$ = chr$(29))) then
9940 select case No
9950 'Ok ボタン  Okから　左　０に行く
9960 case -1:
9970 No=0:sp_on 13,1:sp_on 14,0:beep
9980 pause 200:goto Input_Seireki2:
9990 '0 ボタン  左　何もしない
10000 case 0:
10010 beep:pause 200:goto Input_Seireki2:
10020 case 3:
10030 No=2:sp_on 5,1:sp_on 6,0:beep
10040 pause 200:goto Input_Seireki2:
10050 case 2:
10060 No=1:sp_on 5,0:sp_on 4,1:beep
10070 pause 200:goto Input_Seireki2:
10080 case 1:
10090 beep:pause 200:goto Input_Seireki2:
10100 case 6:
10110 No=5:sp_on 8,1:sp_on 9,0:beep
10120 pause 200:goto Input_Seireki2:
10130 case 5:
10140 No=4:sp_on 7,1:sp_on 8,0:beep
10150 pause 200:goto Input_Seireki2:
10160 case 4:
10170 beep:pause 200:goto Input_Seireki2:
10180 case 9:
10190 No=8:sp_on 11,1:sp_on 12,0:beep
10200 pause 200:goto Input_Seireki2:
10210 case 8:
10220 No=7:sp_on 10,1:sp_on 11,0:beep
10230 pause 200:goto Input_Seireki2:
10240 case 7:
10250 beep:pause 200:goto Input_Seireki2:
10260 end select
10270 endif
10280 '右  十字キー　右　or カーソル　右
10290 if ((y2 = 1) or (key$ = chr$(28))) then
10300 select case No
10310 '0ボタンからokボタン右に移動
10320 case 0:
10330 No=-1:sp_on 14,1:sp_on 13,0:beep
10340 pause 200:goto Input_Seireki2:
10350 '0ボタンからokボタン 右に移動　ここまで
10360 'OKボタンで右を押して何もしない
10370 case -1:
10380 pause 200:goto Input_Seireki2:
10390 case 1:
10400 No=2:sp_on 5,1:sp_on 4,0:beep
10410 pause 200:goto Input_Seireki2:
10420 case 2:
10430 No=3:sp_on 6,1:sp_on 5,0
10440 beep:pause 200:goto Input_Seireki2:
10450 case 3:
10460 beep:pause 200:goto Input_Seireki2:
10470 case 4:
10480 No=5:sp_on 8,1:sp_on 7,0:beep
10490 pause 200:goto Input_Seireki2:
10500 case 5:
10510 No=6:sp_on 9,1:sp_on 8,0:beep
10520 pause 200:goto Input_Seireki2:
10530 case 7:
10540 No=8:sp_on 11,1:sp_on 10,0:beep
10550 pause 200:goto Input_Seireki2:
10560 case 8:
10570 No=9:sp_on 12,1:sp_on 11,0:beep
10580 pause 200:goto Input_Seireki2:
10590 case 9:
10600 beep:pause 200:goto Input_Seireki2:
10610 case 6:
10620 beep:pause 200:goto Input_Seireki2:
10630 end select
10640 'Okから右ボタンを押して何もしない ここまで
10650 endif
10660 '十字キー　ここまで
10670 '*************************************************************************************************************************
10680 'WXGA　1280 x 800 ここまで
10690 '*************************************************************************************************************************
10700 else
10710 '************************************************************************************************
10720 '2.WUXGAの時1920x1280の時 ここから
10730 '************************************************************************************************
10740 '************************************************************************************************
10750 '1.十字キー上ここから
10760 '************************************************************************************************
10770 if ((y = -1) or (key$ = chr$(30))) then
10780 select case No
10790 'No=-1:okのとき:初期の状態
10800 '0kボタンから３に移動
10810 '上に行く 処理
10820 case -1:
10830 No=3:sp_on 12,1:sp_on 14,0:beep
10840 pause 200:goto Input_Seireki2:
10850 '選択肢:3
10860 '3ボタンから 6に移動
10870 case 3:
10880 No=6:sp_on 12,0:sp_on 11,1:beep
10890 pause 200:goto Input_Seireki2:
10900 '6ボタンから ９に移動
10910 case 6:
10920 No=9:sp_on 10,1:sp_on 11,0:beep
10930 pause 200:goto Input_Seireki2:
10940 '6ボタンから ９に移動　ここまで
10950 '9で上を押して何もしない
10960 case 9:
10970 '何もしない
10980 No=9
10990 beep:pause 200:goto Input_Seireki2:
11000 '9で上を押しても何もしない　ここまで
11010 '上　 0ボタンから2ボタン
11020 'sp_on 6,1:1
11030 'sp_on 8,1:5
11040 'sp_on 7,1:7
11050 case 0:
11060 No=2:sp_on 13,0:sp_on 9,1:beep
11070 pause 200:goto Input_Seireki2:
11080 '上  0ボタンから2ボタン　ここまで
11090 '2から５になる 上
11100 case 2:
11110 No=5:sp_on 8,1:sp_on 9,0:beep
11120 pause 200:goto Input_Seireki2:
11130 case 5:
11140 No=8:sp_on 7,1:sp_on 8,0:beep
11150 pause 200:goto Input_Seireki2:
11160 case 8:
11170 beep:pause 200:goto Input_Seireki2:
11180 case 1:
11190 No=4:sp_on 5,1:sp_on 6,0:beep
11200 pause 200:goto Input_Seireki2:
11210 case 4:
11220 No=7:sp_on 4,1:sp_on 5,0:beep
11230 pause 200:goto Input_Seireki2:
11240 case 7:
11250 beep:pause 200:goto Input_Seireki2:
11260 end select
11270 endif
11280 '************************************************************************************************
11290 '1. 十字キー　上　ここまで
11300 '************************************************************************************************
11310 '左３　ここまで
11320 '************************************************************************************************
11330 '1. 十字キー　下　矢印　下　ここから
11340 '************************************************************************************************
11350 '下の矢印
11360 '中央 2
11370 if ((y=1) or (key$ = chr$(31))) then
11380 select case No
11390 '9から６に下げる
11400 case 9:
11410 No=6:sp_on 11,1:sp_on 10,0:beep
11420 pause 200:goto Input_Seireki2:
11430 '6から３に下げる
11440 case 6:
11450 No=3:sp_on 12,1:sp_on 11,0:beep
11460 pause 200:goto Input_Seireki2:
11470 '3から０ｋに変える
11480 case 3:
11490 No=-1:sp_on 14,1:sp_on 12,0:beep
11500 pause 200:goto Input_Seireki2:
11510 'Okから下のボタンを押しても何もしない
11520 case -1:
11530 beep:pause 200:goto Input_Seireki2:
11540 case 8:
11550 No=5:sp_on 8,1:sp_on 7,0:beep
11560 pause 200:goto Input_Seireki2:
11570 case 5:
11580 No=2:sp_on 9,1:sp_on 8,0:beep
11590 pause 200:goto Input_Seireki2:
11600 case 2:
11610 No=0:sp_on 13,1:sp_on 9,0:beep
11620 pause 200:goto Input_Seireki2:
11630 case 0:
11640 pause 200:goto Input_Seireki2:
11650 case 7:
11660 No=4:sp_on 5,1:sp_on 4,0:beep
11670 pause 200:goto Input_Seireki2:
11680 case 4:
11690 No=1:sp_on 6,1:sp_on 5,0:beep
11700 pause 200:goto Input_Seireki2:
11710 case 1:
11720 beep:pause 200:goto Input_Seireki2:
11730 end select
11740 endif
11750 '************************************************************************************************
11760 '1. 十字キー　下　矢印　下　ここまで
11770 '************************************************************************************************
11780 '************************************************************************************************
11790 '1. 十字キー　左　矢印　左　ここから
11800 '************************************************************************************************
11810 '左へボタン 十字キー　左　or 　カーソル左
11820 if ((y2 = -1) or (key$ = chr$(29))) then
11830 select case No
11840 'Ok ボタン  Okから　左　０に行く
11850 case -1:
11860 No=0:sp_on 13,1:sp_on 14,0:beep
11870 pause 200:goto Input_Seireki2:
11880 '0 ボタン  左　何もしない
11890 case 0:
11900 beep:pause 200:goto Input_Seireki2:
11910 case 3:
11920 No=2:sp_on 9,1:sp_on 12,0:beep
11930 pause 200:goto Input_Seireki2:
11940 case 2:
11950 No=1:sp_on 6,1:sp_on 9,0:beep
11960 pause 200:goto Input_Seireki2:
11970 case 1:
11980 beep:pause 200:goto Input_Seireki2:
11990 case 6:
12000 No=5:sp_on 8,1:sp_on 11,0:beep
12010 pause 200:goto Input_Seireki2:
12020 case 5:
12030 No=4:sp_on 5,1:sp_on 8,0:beep
12040 pause 200:goto Input_Seireki2:
12050 case 4:
12060 beep:pause 200:goto Input_Seireki2:
12070 case 9:
12080 No=8:sp_on 7,1:sp_on 10,0:beep
12090 pause 200:goto Input_Seireki2:
12100 case 8:
12110 No=7:sp_on 4,1:sp_on 7,0:beep
12120 pause 200:goto Input_Seireki2:
12130 case 7:
12140 beep:pause 200:goto Input_Seireki2:
12150 end select
12160 endif
12170 '************************************************************************************************
12180 '1. 十字キー　左　矢印　左　ここまで
12190 '************************************************************************************************
12200 '************************************************************************************************
12210 '十字キー　右　ここから
12220 '***********************************************************************************************
12230 '右  十字キー　右　or カーソル　右
12240 if ((y2 = 1) or (key$ = chr$(28))) then
12250 select case No
12260 '0ボタンからokボタン右に移動
12270 case 0:
12280 No=-1:sp_on 14,1:sp_on 13,0:beep
12290 pause 200:goto Input_Seireki2:
12300 '0ボタンからokボタン 右に移動　ここまで
12310 'OKボタンで右を押して何もしない
12320 case -1:
12330 beep:pause 200:goto Input_Seireki2:
12340 case 1:
12350 No=2:sp_on 9,1:sp_on 6,0:beep
12360 pause 200:goto Input_Seireki2:
12370 case 2:
12380 No=3:sp_on 12,1:sp_on 9,0:beep
12390 pause 200:goto Input_Seireki2:
12400 case 3:
12410 beep:pause 200:goto Input_Seireki2:
12420 case 4:
12430 No=5:sp_on 8,1:sp_on 5,0:beep
12440 pause 200:goto Input_Seireki2:
12450 case 5:
12460 No=6:sp_on 11,1:sp_on 8,0:beep
12470 pause 200:goto Input_Seireki2:
12480 case 7:
12490 No=8:sp_on 7,1:sp_on 4,0:beep
12500 pause 200:goto Input_Seireki2:
12510 case 8:
12520 No=9:sp_on 10,1:sp_on 7,0:beep
12530 pause 200:goto Input_Seireki2:
12540 case 9:
12550 beep:pause 200:goto Input_Seireki2:
12560 case 6:
12570 beep:pause 200:goto Input_Seireki2:
12580 end select
12590 'Okから右ボタンを押して何もしない ここまで
12600 endif
12610 '**********************************************************************************************************
12620 '右　ここまで
12630 '**********************************************************************************************************
12640 endif
12650 '**********************************************************************************************************
12660 '2.WUXGAの時1920x1280の時 ここまで
12670 '**********************************************************************************************************
12680 if ((bg=2) or (key$=chr$(13))) then
12690 select case count
12700 case 0:
12710 count=1
12720 if (No=-1) then
12730 count=0
12740 'Okボタンを押したとき
12750 goto Input_Seireki2:
12760 else
12770 '===================================
12780 'Okボタン以外が押されたとき  1桁目の入力
12790 '===================================
12800 count2=1
12810 if (No >= 1 and No <= 2) then
12820 buf_year$="":buf_year$ = str$(No)
12830 buf_year=No:buf_year2$ = buf_year$ + string$(3,"*") :'"***"
12840 if ex_info$(1) <> "JP" then
12850 n1= len("Input Born Year?(4 dedgit):")
12860 else
12870 n1 = len("生まれた年代(西暦4桁):")
12880 endif
12890 locate 2,4
12900 color rgb(255,255,255)
12910 if ex_info$(1) <> "JP" then
12920 buf_Born_Year_line$ = trim$("Input Born Year?(4 dedgit):" + buf_year2$)
12930 else
12940 buf_Born_Year_line$ = trim$("生まれた年代(西暦4桁):" + buf_year2$)
12950 endif
12960 'buf_Born_Year_line$ = left$(buf_Born_year_5490 'buf_Born_Year_line$ = left$(buf_Born_year_name$,1)
12970 'print "生まれた年代(西暦4桁):";buf_year2$
12980 print buf_Born_Year_line$
12990 goto Input_Seireki2:
13000 else
13010 count=0
13020 ui_msg"数字が範囲外になります。"
13030 buf_year$="":buf_year=0
13040 goto Input_Seireki2:
13050 endif
13060 endif
13070 case 1:
13080 count = 2
13090 if (No = -1) then
13100 count = 1
13110 goto Input_Seireki2:
13120 else
13130 count2 = 1
13140 b = val(buf_year$)
13150 buf_year = b * 10 + No
13160 buf_year$ = str$(buf_year):buf_year2$ = buf_year$ + string$(2,"**")
13170 locate 2,4
13180 color rgb(255,255,255)
13190 print "                                                                "
13200 locate 2,4
13210 if ex_info$(1) <> "JP" then
13220 print "Input Born Year(4 dedgit):";buf_year$
13230 else
13240 print "生まれた年代(西暦4桁):";buf_year2$
13250 endif
13260 'if (No = -1) then
13270 'count=1
13280 goto Input_Seireki2:
13290 endif
13300 case 2:
13310 count=3
13320 if (No=-1) then
13330 count =2
13340 goto Input_Seireki2:
13350 else
13360 b = val(buf_year$)
13370 buf_year = b*10 + No
13380 buf_year$ = str$(buf_year):buf_year2$ = buf_year$ + string$(1,"*")
13390 locate 2,4
13400 color rgb(255,255,255)
13410 print "                                        "
13420 locate 2,4
13430 if ex_info$(1) <> "JP" then
13440 print "Input Born Year?(4 dedgit):";buf_year$
13450 else
13460 print "生まれた年代(西暦4桁):";buf_year2$
13470 endif
13480 goto Input_Seireki2:
13490 endif
13500 case 3:
13510 count=4
13520 if (No = -1) then
13530 count=3
13540 goto Input_Seireki2:
13550 else
13560 b = val(buf_year$)
13570 buf_year = b * 10 + No
13580 buf_year$ = str$(buf_year)
13590 locate 2,4
13600 color RGB(255,255,255)
13610 print "                                      "
13620 locate 2,4
13630 if ex_info$(1) <> "JP" then
13640 print "Input Born Year?(4 dedgit):";buf_year$
13650 else
13660 print "生まれた年代(西暦4桁):";buf_year$
13670 endif
13680 buf_year=val(buf_year$)
13690 'year=val(buf_year$)
13700 'if (No=-1) then
13710 'goto Input_Born_Month:
13720 'else
13730 goto Input_Seireki2:
13740 endif
13750 case 4:
13760 'bufyear=buf_year
13770 if (No = -1) then
13780 buf_year = val(buf_year$)
13790 bufyear = buf_year
13800 sp_on 14,0
13810 goto Input_Born_Month:
13820 else
13830 goto Input_Seireki2:
13840 endif
13850 end select
13860 endif
13870 '=========================
13880 'bg2　キャンセルボタン
13890 '=========================
13900 if (bg2 = 2) then
13910 select case count2
13920 case 0:
13930 'Okボタンを押したときの処理
13940 if (No = -1) then
13950 buf_year=0:buf_year$=(""):buf_year$=trim$("****")
13960 'count = 0
13970 locate 2,4
13980 color rgb(255,255,255)
13990 print "                                      "
14000 locate 2,4
14010 if ex_info$(1) <> "JP" then
14020 print "Input Born Year?(4 dedgit):";buf_year$
14030 else
14040 print "生まれた年代（西暦4桁):";buf_year$
14050 endif
14060 '=============================
14070 'case 0:前の画面に戻る 数秘術トップメニュー
14080 '=============================
14090 sp_on 14,0:goto Kabara_TopScreen:
14100 else
14110 'count=0
14120 '(buf_year=0) then
14130 buf_year = 0:buf_year$ = string$(4,"*")
14140 goto Input_Seireki2:
14150 'endif
14160 endif
14170 case 1:
14180 if (No = -1) then
14190 count2 = 0:count = 0
14200 buf$=right$(buf_year$,1)
14210 if (val(buf$) >= 1 and val(buf$) <= 9) then
14220 buf_year$ = "****":buf_year=0
14230 color rgb(255,255,255)
14240 locate 0,4:
14250 print "                                      "
14260 locate 2,4
14270 if ex_info$(1) <> "JP" then
14280 print "Input Born Year(4 dedgit):";buf_year$
14290 else
14300 print "生まれた年代（西暦4桁):" + buf_year$
14310 endif
14320 goto Input_Seireki2:
14330 endif
14340 else
14350 endif
14360 end select
14370 endif
14380 end
14390 'Input"生れた年代(4桁,〜2025年):",year
14400 'if year > 2025 then goto Input_Seireki:
14410 'if year = 123 then cls 3:cls 4:goto Main_Screen:
14420 '"4桁目"
14430 'bufyear4 = fix(year / 1000)
14440 '"3桁目"
14450 'bufyear3 = fix((year - (bufyear4 * 1000)) / 100)
14460 '"2桁目"
14470 'bufyear2 = fix((year - ((bufyear4 * 1000)+(bufyear3*100)))/10)
14480 '"1桁目"
14490 'bufyear1 = fix((year - ((bufyear4*
14500 'bufyear = bufyear1+bufyear2+bufyear3+bufyear4
14510 '生れた月を入力
14520 Input_Born_Month:
14530 cls 3:play "":count=0:count2=0
14540 'No=-1:Okのとき
14550 init"kb:4":key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_Month$ = "**":buf_month=0
14560 for i=0 to 1
14570 buf_month(i)=0
14580 next i
14590 '***********************************************************
14600 '1.WXGAの時 ここから
14610 '(1200 x 800)
14620 '***********************************************************
14630 if ((size(0) <= 1280) and (size(1) <= 800)) then
14640 gload Gazo$ + Gazo_WXGA$ +"Screen2_907x680_20240216.png",0,0,0
14650 '***********************************************************
14660 '1.WXGAの時　ここまで
14670 '(1200 x 800)
14680 '***********************************************************
14690 else
14700 '***********************************************************
14710 '2.WUXGAの時(WXGA以外の時)　ここから
14720 '(1920 gload Gazo$ + "Selection.png",1,60,240
14730 '***********************************************************
14740 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
14750 gload Gazo$ + "Screen2.png",0,0,0
14760 gload Gazo$ + "downscreen.png",0,0,800
14770 '***********************************************************
14780 '2.WUXGAの時(WXGA以外の時)　ここまで
14790 '(1920 gload Gazo$ + "Selection.png",1,60,240
14800 '***********************************************************
14810 endif
14820 'Init"kb:2"
14830 if ex_info$(1) <> "JP" then
14840 else
14850 '音声ファイル再生 2023.06.07
14860 play Voice$ + "Voice_Input_Born_Month_20230607.mp3"
14870 endif
14880 font FONT
14890 locate 0,1
14900 '文字色：黒　 color rgb(0,0,0)
14910 if ex_info$(1) <> "JP" then
14920 '英語パート
14930 '文字色:白
14940 color rgb(255,255,255)
14950 print "Input Born Month?(1~12):" + chr$(13)
14960 '文字色:白
14970 color rgb(255,255,255)
14980 locate 2,4
14990 '文字色:白
15000 print "Your Born Month?(1~12):";buf_Month$
15010 color rgb(255,255,255)
15020 else
15030 '日本語パート
15040 color rgb(255,255,255)
15050 print "生まれた月を入れて下さい" + chr$(13)
15060 '文字色:白
15070 color rgb(255,255,255)
15080 locate 2,4
15090 '文字色:白
15100 print "生まれた月(1月~12月):";buf_Month$
15110 color rgb(255,255,255)
15120 endif
15130 'locate 4,6:print ":7"
15140 'locate 9,6:print ":8"
15150 'locate 12,6:print ":9"
15160 'locate 4,6
15170 '文字色:赤
15180 'print ":7  :8  :9" + chr$(13)
15190 'color rgb(255,255,255)
15200 'locate 4,8
15210 'print ":4  :5  :6" + chr$(13)
15220 'color rgb(255,255,255)
15230 'locate 4,10
15240 'print ":1  :2  :3" + chr$(13)
15250 'locate 4,12
15260 'print "    :0"
15270 'locate 12,12
15280 'color rgb(255,0,0)
15290 'print ":Ok"
15300 sp_on 4,0: sp_on 5,0:sp_on 6,0
15310 sp_on 7,0:sp_on 8,0:sp_on 9,0
15320 sp_on 10,0:sp_on 11,0:sp_on 12,0
15330 sp_on 13,0:sp_on 14,1
15340 Input_Born_Month2:
15350 key$="":bg=0:y=0:y2=0:bg2=0
15360 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
15370 key$ = inkey$
15380 bg = strig(1)
15390 y = stick(1)
15400 y2 = stick(0)
15410 bg2 = strig(0)
15420 pause 200
15430 wend
15440 if ((size(0) <= 1280) and (size(1) <= 800)) then
15450 '***********************************************************
15460 '1.WXGAの時 ここから
15470 '(1200 x 800)
15480 '***********************************************************
15490 '十字キー　ここから
15500 '上の矢印　または、十字キー上
15510 if ((y = -1) or (key$ = chr$(30))) then
15520 select case No
15530 'No=-1:okのとき:初期の状態
15540 '0kボタンから３に移動
15550 '上に行く 処理
15560 case -1:
15570 No=3:sp_on 6,1:sp_on 14,0:beep
15580 pause 200:goto Input_Born_Month2:
15590 '選択肢:3
15600 '3ボタンから 6に移動
15610 case 3:
15620 No=6:sp_on 9,1:sp_on 6,0:beep
15630 pause 200:goto Input_Born_Month2:
15640 '6ボタンから ９に移動
15650 case 6:
15660 No=9:sp_on 12,1:sp_on 9,0:beep
15670 pause 200:goto Input_Born_Month2:
15680 '6ボタンから ９に移動　ここまで
15690 '9で上を押して何もしない
15700 case 9:
15710 '何もしない
15720 No=9
15730 beep:pause 200:goto Input_Born_Month2:
15740 '9で上を押しても何もしない　ここまで
15750 '上　 0ボタンから2ボタン
15760 'sp_on 6,1:1
15770 'sp_on 8,1:5
15780 'sp_on 7,1:7
15790 case 0:
15800 No=2:sp_on 13,0:sp_on 5,1:beep
15810 pause 200:goto Input_Born_Month2:
15820 '上  0ボタンから2ボタン　ここまで
15830 '2から５になる 上
15840 case 2:
15850 No=5:sp_on 8,1:sp_on 5,0:beep
15860 pause 200:goto Input_Born_Month2:
15870 case 5:
15880 No=8:sp_on 11,1:sp_on 8,0:beep
15890 pause 200:goto Input_Born_Month2:
15900 case 8:
15910 beep:pause 200:goto Input_Born_Month2:
15920 case 1:
15930 No=4:sp_on 7,1:sp_on 4,0:beep
15940 pause 200:goto Input_Born_Month2:
15950 case 4:
15960 No=7:sp_on 10,1:sp_on 7,0:beep
15970 pause 200:goto Input_Born_Month2:
15980 case 7:
15990 beep:pause 200:goto Input_Born_Month2:
16000 end select
16010 endif
16020 '左３　ここまで
16030 '下の矢印
16040 '中央 2
16050 if ((y=1) or (key$ = chr$(31))) then
16060 select case No
16070 '9から６に下げる
16080 case 9:
16090 No=6:sp_on 12,0:sp_on 9,1:beep
16100 pause 200:goto Input_Born_Month2:
16110 '6から３に下げる
16120 case 6:
16130 No=3:sp_on 9,0:sp_on 6,1:beep
16140 pause 200:goto Input_Born_Month2:
16150 '3から０ｋに変える
16160 case 3:
16170 No=-1:sp_on 14,1:sp_on 6,0:beep
16180 pause 200:goto Input_Born_Month2:
16190 'Okから下のボタンを押しても何もしない
16200 case -1:
16210 beep:pause 200:goto Input_Born_Month2:
16220 case 8:
16230 No=5:sp_on 8,1:sp_on 11,0:beep
16240 pause 200:goto Input_Born_Month2:
16250 case 5:
16260 No=2:sp_on 5,1:sp_on 8,0:beep
16270 pause 200:goto Input_Born_Month2:
16280 case 2:
16290 No=0:sp_on 13,1:sp_on 5,0:beep
16300 pause 200:goto Input_Born_Month2:
16310 case 0:
16320 beep:pause 200:goto Input_Born_Month2:
16330 case 7:
16340 No=4:sp_on 7,1:sp_on 10,0:beep
16350 pause 200:goto Input_Born_Month2:
16360 case 4:
16370 No=1:sp_on 4,1:sp_on 7,0:beep
16380 pause 200:goto Input_Born_Month2:
16390 case 1:
16400 beep:pause 200:goto Input_Born_Month2:
16410 end select
16420 endif
16430 '左へボタン 十字キー　左　or 　カーソル左
16440 if ((y2 = -1) or (key$ = chr$(29))) then
16450 select case No
16460 'Ok ボタン  Okから　左　０に行く
16470 case -1:
16480 No=0:sp_on 13,1:sp_on 14,0:beep
16490 pause 200:goto Input_Born_Month2:
16500 '0 ボタン  左　何もしない
16510 case 0:
16520 beep:pause 200:goto Input_Born_Month2:
16530 case 3:
16540 No=2:sp_on 5,1:sp_on 6,0:beep
16550 pause 200:goto Input_Born_Month2:
16560 case 2:
16570 No=1:sp_on 5,0:sp_on 4,1:beep
16580 pause 200:goto Input_Born_Month2:
16590 case 1:
16600 beep:pause 200:goto Input_Born_Month2:
16610 case 6:
16620 No=5:sp_on 8,1:sp_on 9,0:beep
16630 pause 200:goto Input_Born_Month2:
16640 case 5:
16650 No=4:sp_on 7,1:sp_on 8,0:beep
16660 pause 200:goto Input_Born_Month2:
16670 case 4:
16680 beep:pause 200:goto Input_Born_Month2:
16690 case 9:
16700 No=8:sp_on 11,1:sp_on 12,0:beep
16710 pause 200:goto Input_Born_Month2:
16720 case 8:
16730 No=7:sp_on 10,1:sp_on 11,0:beep
16740 pause 200:goto Input_Born_Month2:
16750 case 7:
16760 beep:pause 200:goto Input_Born_Month2:
16770 end select
16780 endif
16790 '右  十字キー　右　or カーソル　右
16800 if ((y2 = 1) or (key$ = chr$(28))) then
16810 select case No
16820 '0ボタンからokボタン右に移動
16830 case 0:
16840 No=-1:sp_on 14,1:sp_on 13,0:beep
16850 pause 200:goto Input_Born_Month2:
16860 '0ボタンからokボタン 右に移動　ここまで
16870 'OKボタンで右を押して何もしない
16880 case -1:
16890 pause 200:goto Input_Born_Month2:
16900 case 1:
16910 No=2:sp_on 5,1:sp_on 4,0:beep
16920 pause 200:goto Input_Born_Month2:
16930 case 2:
16940 No=3:sp_on 6,1:sp_on 5,0
16950 beep:pause 200:goto Input_Born_Month2:
16960 case 3:
16970 beep:pause 200:goto Input_Born_Month2:
16980 case 4:
16990 No=5:sp_on 8,1:sp_on 7,0:beep
17000 pause 200:goto Input_Born_Month2:
17010 case 5:
17020 No=6:sp_on 9,1:sp_on 8,0:beep
17030 pause 200:goto Input_Born_Month2:
17040 case 7:
17050 No=8:sp_on 11,1:sp_on 10,0:beep
17060 pause 200:goto Input_Born_Month2:
17070 case 8:
17080 No=9:sp_on 12,1:sp_on 11,0:beep
17090 pause 200:goto Input_Born_Month2:
17100 case 9:
17110 beep:pause 200:goto Input_Born_Month2:
17120 case 6:
17130 beep:pause 200:goto Input_Born_Month2:
17140 end select
17150 'Okから右ボタンを押して何もしない ここまで
17160 endif
17170 '***********************************************************
17180 '1.WXGAの時 ここまで
17190 '(1200 x 800)
17200 '***********************************************************
17210 else
17220 '***********************************************************
17230 '2.WUXGAの時(WXGA以外の時)　ここから
17240 '(1920 gload Gazo$ + "Selection.png",1,60,240
17250 '***********************************************************
17260 '十字キー　ここから
17270 '上の矢印　または、十字キー上
17280 if ((y = -1) or (key$ = chr$(30))) then
17290 select case No
17300 'No=-1:okのとき:初期の状態
17310 '0kボタンから３に移動
17320 '上に行く 処理
17330 case -1:
17340 No=3:sp_on 12,1:sp_on 14,0:BEEP
17350 pause 200:goto Input_Born_Month2:
17360 '選択肢:3
17370 '3ボタンから 6に移動
17380 case 3:
17390 No=6:sp_on 12,0:sp_on 11,1:beep
17400 pause 200:goto Input_Born_Month2:
17410 '6ボタンから ９に移動
17420 case 6:
17430 No=9:sp_on 10,1:sp_on 11,0:beep
17440 pause 200:goto Input_Born_Month2:
17450 '6ボタンから ９に移動　ここまで
17460 '9で上を押して何もしない
17470 case 9:
17480 '何もしない
17490 No=9
17500 beep:pause 200:goto Input_Born_Month2:
17510 '9で上を押しても何もしない　ここまで
17520 '上　 0ボタンから2ボタン
17530 'sp_on 6,1:1
17540 'sp_on 8,1:5
17550 'sp_on 7,1:7
17560 case 0:
17570 No=2:sp_on 13,0:sp_on 9,1:beep
17580 pause 200:goto Input_Born_Month2:
17590 '上  0ボタンから2ボタン　ここまで
17600 '2から５になる 上
17610 case 2:
17620 No=5:sp_on 8,1:sp_on 9,0:beep
17630 pause 200:goto Input_Born_Month2:
17640 case 5:
17650 No=8:sp_on 7,1:sp_on 8,0:beep
17660 pause 200:goto Input_Born_Month2:
17670 case 8:
17680 beep:pause 200:goto Input_Born_Month2:
17690 case 1:
17700 No=4:sp_on 5,1:sp_on 6,0:beep
17710 pause 200:goto Input_Born_Month2:
17720 case 4:
17730 No=7:sp_on 4,1:sp_on 5,0:beep
17740 pause 200:goto Input_Born_Month2:
17750 case 7:
17760 beep:pause 200:goto Input_Born_Month2:
17770 end select
17780 endif
17790 '左３　ここまで
17800 '下の矢印
17810 '中央 2
17820 if ((y=1) or (key$ = chr$(31))) then
17830 select case No
17840 '9から６に下げる
17850 case 9:
17860 No=6:sp_on 11,1:sp_on 10,0:beep
17870 pause 200:goto Input_Born_Month2:
17880 '6から３に下げる
17890 case 6:
17900 No=3:sp_on 12,1:sp_on 11,0:beep
17910 pause 200:goto Input_Born_Month2:
17920 '3から０ｋに変える
17930 case 3:
17940 No=-1:sp_on 14,1:sp_on 12,0:beep
17950 pause 200:goto Input_Born_Month2:
17960 'Okから下のボタンを押しても何もしない
17970 case -1:
17980 beep:pause 200:goto Input_Born_Month2:
17990 case 8:
18000 No=5:sp_on 8,1:sp_on 7,0:beep
18010 pause 200:goto Input_Born_Month2:
18020 case 5:
18030 No=2:sp_on 9,1:sp_on 8,0:beep
18040 pause 200:goto Input_Born_Month2:
18050 case 2:
18060 No=0:sp_on 13,1:sp_on 9,0:beep
18070 pause 200:goto Input_Born_Month2:
18080 case 0:
18090 beep:pause 200:goto Input_Born_Month2:
18100 case 7:
18110 No=4:sp_on 5,1:sp_on 4,0:beep
18120 pause 200:goto Input_Born_Month2:
18130 case 4:
18140 No=1:sp_on 6,1:sp_on 5,0:beep
18150 pause 200:goto Input_Born_Month2:
18160 case 1:
18170 beep:pause 200:goto Input_Born_Month2:
18180 end select
18190 endif
18200 '左へボタン 十字キー　左　or 　カーソル左
18210 if ((y2 = -1) or (key$ = chr$(29))) then
18220 select case No
18230 'Ok ボタン  Okから　左　０に行く
18240 case -1:
18250 No=0:sp_on 13,1:sp_on 14,0
18260 beep:pause 200:goto Input_Born_Month2:
18270 '0 ボタン  左　何もしない
18280 case 0:
18290 beep:pause 200:goto Input_Born_Month2:
18300 case 3:
18310 No=2:sp_on 9,1:sp_on 12,0:beep
18320 pause 200:goto Input_Born_Month2:
18330 case 2:
18340 No=1:sp_on 6,1:sp_on 9,0:beep
18350 pause 200:goto Input_Born_Month2:
18360 case 1:
18370 beep:pause 200:goto Input_Born_Month2:
18380 case 6:
18390 No=5:sp_on 8,1:sp_on 11,0:beep
18400 pause 200:goto Input_Born_Month2:
18410 case 5:
18420 No=4:sp_on 5,1:sp_on 8,0:beep
18430 pause 200:goto Input_Born_Month2:
18440 case 4:
18450 beep:pause 200:goto Input_Born_Month2:
18460 case 9:
18470 No=8:sp_on 7,1:sp_on 10,0:beep
18480 pause 200:goto Input_Born_Month2:
18490 case 8:
18500 No=7:sp_on 4,1:sp_on 7,0:beep
18510 pause 200:goto Input_Born_Month2:
18520 case 7:
18530 beep:pause 200:goto Input_Born_Month2:
18540 end select
18550 endif
18560 '右  十字キー　右　or カーソル　右
18570 if ((y2 = 1) or (key$ = chr$(28))) then
18580 select case No
18590 '0ボタンからokボタン右に移動
18600 case 0:
18610 No=-1:sp_on 14,1:sp_on 13,0:beep
18620 pause 200:goto Input_Born_Month2:
18630 '0ボタンからokボタン 右に移動　ここまで
18640 'OKボタンで右を押して何もしない
18650 case -1:
18660 beep:pause 200:goto Input_Born_Month2:
18670 case 1:
18680 No=2:sp_on 9,1:sp_on 6,0:beep
18690 pause 200:goto Input_Born_Month2:
18700 case 2:
18710 No=3:sp_on 12,1:sp_on 9,0:beep
18720 pause 200:goto Input_Born_Month2:
18730 case 3:
18740 beep:pause 200:goto Input_Born_Month2:
18750 case 4:
18760 No=5:sp_on 8,1:sp_on 10,0:beep
18770 pause 200:goto Input_Born_Month2:
18780 case 5:
18790 No=6:sp_on 11,1:sp_on 8,0:beep
18800 pause 200:goto Input_Born_Month2:
18810 case 7:
18820 No=8:sp_on 7,1:sp_on 11,0:beep
18830 pause 200:goto Input_Born_Month2:
18840 case 8:
18850 No=9:sp_on 12,1:sp_on 7,0:beep
18860 pause 200:goto Input_Born_Month2:
18870 case 9:
18880 beep:pause 200:goto Input_Born_Month2:
18890 case 6:
18900 beep:pause 200:goto Input_Born_Month2:
18910 end select
18920 'Okから右ボタンを押して何もしない ここまで
18930 endif
18940 '***********************************************************
18950 '2.WUXGAの時(WXGA以外の時)　ここまで
18960 '(1920 gload Gazo$ + "Selection.png",1,60,240
18970 '***********************************************************
18980 endif
18990 '***********************************************************
19000 '2.WUXGAの時(WXGA以外の時)　ここまで
19010 '(1920 gload Gazo$ + "Selection.png",1,60,240
19020 '***********************************************************
19030 '十字キー　ここまで
19040 '右の丸ボタン　決定キー
19050 if ((bg=2) or (key$=chr$(13))) then
19060 select case count
19070 case 0:
19080 count = 1:buf_Month$ = str$(No):buf_month = No:buf_Month2$ = buf_Month$ + string$(1,"*"):count2=1
19090 if (buf_month = 1 or buf_month = 2) then
19100 locate 2,4
19110 color RGB(255,255,255)
19120 if ex_info$(1) <> "JP" then
19130 print "Input Born Month(1~12):";buf_Month2$
19140 else
19150 print "生まれた月(1月~12月):";buf_Month2$
19160 endif
19170 else
19180 locate 2,4
19190 color Rgb(255,255,255)
19200 if ex_info$(1) <> "JP" then
19210 print "Input Born Month(1~12):";buf_Month$
19220 else
19230 print "生まれた月(1月~12月):";buf_Month$
19240 endif
19250 endif
19260 goto Input_Born_Month2:
19270 case 1:
19280 count = 2:c = No
19290 c = val(buf_Month$)
19300 if (No = -1) then
19310 'if No=1 or No=2 then
19320 'endif
19330 month = buf_month
19340 buf_month=val(buf_Month$)
19350 month=buf_month
19360 '生まれた日に飛ぶ
19370 goto Input_Born_Day:
19380 else
19390 buf_month = c*10 + No
19400 buf_Month$= str$(buf_month)
19410 locate 2,4
19420 color Rgb(255,255,255)
19430 if ex_info$(1) <> "JP" then
19440 print "Input Born Month(1~12):";buf_Month$
19450 else
19460 print "生まれた月(1月~12月):";buf_Month$
19470 endif
19480 goto Input_Born_Month2:
19490 endif
19500 case 2:
19510 count=3:count2=1
19520 'c= val(buf_Month$)
19530 'buf_month = c*10 + No
19540 'buf_Month$ = str$(buf_month)
19550 'locate 2,3
19560 'print "生まれた月(1月～12月):";buf_Month$
19570 'goto Input_Born_Month2:
19580 'case 3:
19590 'count=4
19600 'b=val(buf_month$)
19610 'buf_month=c*10+No
19620 'buf_Month$=str$(buf_month)
19630 'locate 2,3
19640 'print "生まれた月(1月～12月):";buf_Month$
19650 'buf_month=val(buf_Month$)
19660 'year=val(buf_year$)
19670 if (No = -1) then
19680 goto Input_Born_Day:
19690 else
19700 goto Input_Born_Month2:
19710 endif
19720 'case 4:
19730 'bufyear=buf_year
19740 'if (No=-1) then
19750 'buf_month = val(buf_Month$)
19760 'month = buf_month
19770 'sp_on 14,0
19780 'goto Input_Born_Day:
19790 'else
19800 'goto Input_Born_Month2:
19810 'endif
19820 end select
19830 endif
19840 '左の丸ボタン　キャンセル
19850 if (bg2=2) then
19860 select case count2
19870 case 0:
19880 if (No = -1) then
19890 buf_month=0:buf_Month$="**"
19900 count2=0:count=0
19910 locate 0,3:print "                                   "
19920 if ex_info$(1) <> "JP" then
19930 print "Input Born Month?(1~12):";buf_Month$
19940 else
19950 locate 2,3:print "生まれた月(1月~12月):"+buf_Month$
19960 endif
19970 'if (buf_month > 1) then
19980 sp_on 14,0:goto Input_Born_Month2:
19990 'goto rewrite:
20000 else
20010 if ((No>=1 and No<=9) or (No>=10 and No <=12)) then
20020 buf_month=0:buf_Month$="**"
20030 locate 2,3
20040 color rgb(255,255,255)
20050 print "                                       "
20060 goto rewrite:
20070 if (No>2) then
20080 if ex_info$(1) <> "JP" then
20090 ui_msg "The value is out of range"
20100 else
20110 ui_msg "値が範囲外です。"
20120 endif
20130 goto rewrite:
20140 endif
20150 endif
20160 'endif
20170 rewrite:
20180 locate 2,4
20190 color rgb(255,255,255)
20200 print "                                      "
20210 locate 2,4
20220 if ex_info$(1) <> "JP" then
20230 print "Input Born Month?(1~12):";buf_Month$
20240 else
20250 print "生まれた月(1月~12月):";buf_Month$
20260 endif
20270 goto Input_Born_Month2:
20280 endif
20290 case 1:
20300 buf_Month$="**":buf_month=0
20310 if No=-1 then
20320 count2=2:count=0
20330 locate 0,4
20340 print "                                      "
20350 locate 2,4:
20360 if ex_info$(1) <> "JP" then
20370 print "Input Born Month?(1~12):";buf_Month$
20380 else
20390 print "生まれた月(1月~12月):" + buf_Month$
20400 endif
20410 goto Input_Born_Month2:
20420 endif
20430 case 2:
20440 sp_on 14,0:goto Input_Seireki:
20450 end select
20460 endif
20470 'endif
20480 end
20490 'end
20500 '生れた日を入力
20510 Input_Born_Day:
20520 '生まれた日入力
20530 cls 3:play ""
20540 'No=-1:Okのとき
20550 init"kb:4":key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_Day$ = "**":count=0:bg2=0:count2=0
20560 for i=0 to 1
20570 buf_day(i)=0
20580 next i
20590 '***********************************************************
20600 '1.WXGAの時 ここから
20610 '(1200 x 800)
20620 '***********************************************************
20630 if ((size(0) <= 1280) and (size(1) <= 800)) then
20640 gload Gazo$ + Gazo_WXGA$ + "Screen2_907x680_20240216.png",0,0,0
20650 '***********************************************************
20660 '1.WXGAの時　ここまで
20670 '(1200 x 800)
20680 '***********************************************************
20690 else
20700 '***********************************************************
20710 '2.WUXGAの時(WXGA以外の時)　ここから
20720 '(1920 gload Gazo$ + "Selection.png",1,60,240
20730 '***********************************************************
20740 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
20750 gload Gazo$ + "Screen2.png",0,0,0
20760 gload Gazo$ + "downscreen.png",0,0,800
20770 '***********************************************************
20780 '2.WUXGAの時(WXGA以外の時)　ここまで
20790 '(1920 gload Gazo$ + "Selection.png",1,60,240
20800 '***********************************************************
20810 endif
20820 'Init"kb:2"
20830 if ex_info$(1) <> "JP" then
20840 '英語音声パート
20850 else
20860 '日本語音声パート
20870 '音声ファイル再生 2023.06.07
20880 play Voice$ + "Voice_Input_Born_Day_20230607.mp3"
20890 endif
20900 font FONT
20910 if ex_info$(1) <> "JP" then
20920 locate 0,1
20930 '文字色：黒　 color rgb(0,0,0)
20940 color rgb(255,255,255)
20950 print "Input Born day?" + chr$(13)
20960 color rgb(255,255,255)
20970 locate 2,4
20980 print "Born Day(1~31):";buf_Day$
20990 else
21000 locate 0,1
21010 '文字色：黒　 color rgb(0,0,0)
21020 color rgb(255,255,255)
21030 print "生まれた日を入れて下さい" + chr$(13)
21040 color rgb(255,255,255)
21050 locate 2,4
21060 print "生まれた日(1日~31日):";buf_Day$
21070 endif
21080 'color rgb(255,255,255)
21090 'locate 4,6:print ":7"
21100 'locate 9,6:print ":8"
21110 'locate 12,6:print ":9"
21120 'locate 4,6
21130 'print ":7  :8  :9" + chr$(13)
21140 '=======================
21150 'テンキー　色　白　決定ボタン　青
21160 '=======================
21170 'color rgb(255,255,255)
21180 'locate 4,8
21190 'print ":4  :5  :6" + chr$(13)
21200 'color rgb(255,255,255)
21210 'locate 4,10
21220 'print ":1  :2  :3" + chr$(13)
21230 'locate 4,12
21240 'print "    :0"
21250 'locate 12,12
21260 'color rgb(255,0,0)
21270 'print ":Ok"
21280 sp_on 4,0: sp_on 5,0:sp_on 6,0
21290 sp_on 7,0:sp_on 8,0:sp_on 9,0
21300 sp_on 10,0:sp_on 11,0:sp_on 12,0
21310 sp_on 13,0:sp_on 14,1
21320 Input_Born_Day2:
21330 key$="":bg=0:y=0:y2=0:bg2=0
21340 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
21350 key$ = inkey$
21360 bg = strig(1)
21370 y = stick(1)
21380 y2 = stick(0)
21390 bg2 = strig(0)
21400 pause 200
21410 wend
21420 if ((size(0) <= 1280) and (size(1) <= 800)) then
21430 '十字キー　ここから
21440 '上の矢印　または、十字キー上
21450 if ((y = -1) or (key$ = chr$(30))) then
21460 select case No
21470 'No=-1:okのとき:初期の状態
21480 '0kボタンから３に移動
21490 '上に行く 処理
21500 case -1:
21510 No=3:sp_on 6,1:sp_on 14,0:beep
21520 pause 200:goto Input_Born_Day2:
21530 '選択肢:3
21540 '3ボタンから 6に移動
21550 case 3:
21560 No=6:sp_on 9,1:sp_on 6,0:beep
21570 pause 200:goto Input_Born_Day2:
21580 '6ボタンから ９に移動
21590 case 6:
21600 No=9:sp_on 12,1:sp_on 9,0:beep
21610 pause 200:goto Input_Born_Day2:
21620 '6ボタンから ９に移動　ここまで
21630 '9で上を押して何もしない
21640 case 9:
21650 '何もしない
21660 No=9
21670 beep:pause 200:goto Input_Born_Day2:
21680 '9で上を押しても何もしない　ここまで
21690 '上　 0ボタンから2ボタン
21700 'sp_on 6,1:1
21710 'sp_on 8,1:5
21720 'sp_on 7,1:7
21730 case 0:
21740 No=2:sp_on 13,0:sp_on 5,1:beep
21750 pause 200:goto Input_Born_Day2:
21760 '上  0ボタンから2ボタン　ここまで
21770 '2から５になる 上
21780 case 2:
21790 No=5:sp_on 8,1:sp_on 5,0:beep
21800 pause 200:goto Input_Born_Day2:
21810 case 5:
21820 No=8:sp_on 11,1:sp_on 8,0:beep
21830 pause 200:goto Input_Born_Day2:
21840 case 8:
21850 beep:pause 200:goto Input_Born_Day2:
21860 case 1:
21870 No=4:sp_on 7,1:sp_on 4,0:beep
21880 pause 200:goto Input_Born_Day2:
21890 case 4:
21900 No=7:sp_on 10,1:sp_on 7,0:beep
21910 pause 200:goto Input_Born_Day2:
21920 case 7:
21930 beep:pause 200:goto Input_Born_Day2:
21940 end select
21950 endif
21960 '左３　ここまで
21970 '下の矢印
21980 '中央 2
21990 if ((y=1) or (key$ = chr$(31))) then
22000 select case No
22010 '9から６に下げる
22020 case 9:
22030 No=6:sp_on 12,0:sp_on 9,1:beep
22040 pause 200:goto Input_Born_Day2:
22050 '6から３に下げる
22060 case 6:
22070 No=3:sp_on 9,0:sp_on 6,1:beep
22080 pause 200:goto Input_Born_Day2:
22090 '3から０ｋに変える
22100 case 3:
22110 No=-1:sp_on 14,1:sp_on 6,0:beep
22120 pause 200:goto Input_Born_Day2:
22130 'Okから下のボタンを押しても何もしない
22140 case -1:
22150 beep:pause 200:goto Input_Born_Day2:
22160 case 8:
22170 No=5:sp_on 8,1:sp_on 11,0:beep
22180 pause 200:goto Input_Born_Day2:
22190 case 5:
22200 No=2:sp_on 5,1:sp_on 8,0:beep
22210 pause 200:goto Input_Born_Day2:
22220 case 2:
22230 No=0:sp_on 13,1:sp_on 5,0:beep
22240 pause 200:goto Input_Born_Day2:
22250 case 0:
22260 beep:pause 200:goto Input_Born_Day2:
22270 case 7:
22280 No=4:sp_on 7,1:sp_on 10,0:beep
22290 pause 200:goto Input_Born_Day2:
22300 case 4:
22310 No=1:sp_on 4,1:sp_on 7,0:beep
22320 pause 200:goto Input_Born_Day2:
22330 case 1:
22340 beep:pause 200:goto Input_Born_Day2:
22350 end select
22360 endif
22370 '左へボタン 十字キー　左　or 　カーソル左
22380 if ((y2 = -1) or (key$ = chr$(29))) then
22390 select case No
22400 'Ok ボタン  Okから　左　０に行く
22410 case -1:
22420 No=0:sp_on 13,1:sp_on 14,0:beep
22430 pause 200:goto Input_Born_Day2:
22440 '0 ボタン  左　何もしない
22450 case 0:
22460 beep:pause 200:goto Input_Born_Day2:
22470 case 3:
22480 No=2:sp_on 5,1:sp_on 6,0:beep
22490 pause 200:goto Input_Born_Day2:
22500 case 2:
22510 No=1:sp_on 5,0:sp_on 4,1:beep
22520 pause 200:goto Input_Born_Day2:
22530 case 1:
22540 beep:pause 200:goto Input_Born_Day2:
22550 case 6:
22560 No=5:sp_on 8,1:sp_on 9,0:beep
22570 pause 200:goto Input_Born_Day2:
22580 case 5:
22590 No=4:sp_on 7,1:sp_on 8,0:beep
22600 pause 200:goto Input_Born_Day2:
22610 case 4:
22620 beep:pause 200:goto Input_Born_Day2:
22630 case 9:
22640 No=8:sp_on 11,1:sp_on 12,0:beep
22650 pause 200:goto Input_Born_Day2:
22660 case 8:
22670 No=7:sp_on 10,1:sp_on 11,0:beep
22680 pause 200:goto Input_Born_Day2:
22690 case 7:
22700 beep:pause 200:goto Input_Born_Day2:
22710 end select
22720 endif
22730 '右  十字キー　右　or カーソル　右
22740 if ((y2 = 1) or (key$ = chr$(28))) then
22750 select case No
22760 '0ボタンからokボタン右に移動
22770 case 0:
22780 No=-1:sp_on 14,1:sp_on 13,0:beep
22790 pause 200:goto Input_Born_Day2:
22800 '0ボタンからokボタン 右に移動　ここまで
22810 'OKボタンで右を押して何もしない
22820 case -1:
22830 pause 200:goto Input_Born_Day2:
22840 case 1:
22850 No=2:sp_on 5,1:sp_on 4,0:beep
22860 pause 200:goto Input_Born_Day2:
22870 case 2:
22880 No=3:sp_on 6,1:sp_on 5,0
22890 beep:pause 200:goto Input_Born_Day2:
22900 case 3:
22910 beep:pause 200:goto Input_Born_Day2:
22920 case 4:
22930 No=5:sp_on 8,1:sp_on 7,0:beep
22940 pause 200:goto Input_Born_Day2:
22950 case 5:
22960 No=6:sp_on 9,1:sp_on 8,0:beep
22970 pause 200:goto Input_Born_Day2:
22980 case 7:
22990 No=8:sp_on 11,1:sp_on 10,0:beep
23000 pause 200:goto Input_Born_Day2:
23010 case 8:
23020 No=9:sp_on 12,1:sp_on 11,0:beep
23030 pause 200:goto Input_Born_Day2:
23040 case 9:
23050 beep:pause 200:goto Input_Born_Day2:
23060 case 6:
23070 beep:pause 200:goto Input_Born_Day2:
23080 end select
23090 'Okから右ボタンを押して何もしない ここまで
23100 endif
23110 else
23120 '***********************************************************
23130 '2.WUXGAの時(WXGA以外の時)　ここから
23140 '(1920 gload Gazo$ + "Selection.png",1,60,240
23150 '***********************************************************
23160 '十字キー　ここから
23170 '上の矢印　または、十字キー上
23180 if ((y = -1) or (key$ = chr$(30))) then
23190 select case No
23200 'No=-1:okのとき:初期の状態
23210 '0kボタンから３に移動
23220 '上に行く 処理
23230 case -1:
23240 No=3:sp_on 12,1:sp_on 14,0:beep
23250 pause 200:goto Input_Born_Day2:
23260 '選択肢:3
23270 '3ボタンから 6に移動
23280 case 3:
23290 No=6:sp_on 12,0:sp_on 11,1:beep
23300 pause 200:goto Input_Born_Day2:
23310 '6ボタンから ９に移動
23320 case 6:
23330 No=9:sp_on 10,1:sp_on 11,0:beep
23340 pause 200:goto Input_Born_Day2:
23350 '6ボタンから ９に移動　ここまで
23360 '9で上を押して何もしない
23370 case 9:
23380 '何もしない
23390 No=9
23400 beep:pause 200:goto Input_Born_Day2:
23410 '9で上を押しても何もしない　ここまで
23420 '上　 0ボタンから2ボタン
23430 'sp_on 6,1:1
23440 'sp_on 8,1:5
23450 'sp_on 7,1:7
23460 case 0:
23470 No=2:sp_on 13,0:sp_on 9,1:beep
23480 pause 200:goto Input_Born_Day2:
23490 '上  0ボタンから2ボタン　ここまで
23500 '2から５になる 上
23510 case 2:
23520 No=5:sp_on 8,1:sp_on 9,0:beep
23530 pause 200:goto Input_Born_Day2:
23540 case 5:
23550 No=8:sp_on 7,1:sp_on 8,0:beep
23560 pause 200:goto Input_Born_Day2:
23570 case 8:
23580 beep:pause 200:goto Input_Born_Day2:
23590 case 1:
23600 No=4:sp_on 5,1:sp_on 6,0:beep
23610 pause 200:goto Input_Born_Day2:
23620 case 4:
23630 No=7:sp_on 4,1:sp_on 5,0:beep
23640 pause 200:goto Input_Born_Day2:
23650 case 7:
23660 beep:pause 200:goto Input_Born_Day2:
23670 end select
23680 endif
23690 '左３　ここまで
23700 '下の矢印
23710 '中央 2
23720 if ((y=1) or (key$ = chr$(31))) then
23730 select case No
23740 '9から６に下げる
23750 case 9:
23760 No=6:sp_on 11,1:sp_on 10,0:beep
23770 pause 200:goto Input_Born_Day2:
23780 '6から３に下げる
23790 case 6:
23800 No=3:sp_on 12,1:sp_on 11,0:beep
23810 pause 200:goto Input_Born_Day2:
23820 '3から０ｋに変える
23830 case 3:
23840 No=-1:sp_on 14,1:sp_on 12,0:beep
23850 pause 200:goto Input_Born_Day2:
23860 'Okから下のボタンを押しても何もしない
23870 case -1:
23880 beep:pause 200:goto Input_Born_Day2:
23890 case 8:
23900 No=5:sp_on 8,1:sp_on 7,0:beep
23910 pause 200:goto Input_Born_Day2:
23920 case 5:
23930 No=2:sp_on 9,1:sp_on 8,0:beep
23940 pause 200:goto Input_Born_Day2:
23950 case 2:
23960 No=0:sp_on 13,1:sp_on 9,0:beep
23970 pause 200:goto Input_Born_Day2:
23980 case 0:
23990 beep:pause 200:goto Input_Born_Day2:
24000 case 7:
24010 No=4:sp_on 5,1:sp_on 4,0:beep
24020 pause 200:goto Input_Born_Day2:
24030 case 4:
24040 No=1:sp_on 6,1:sp_on 5,0:beep
24050 pause 200:goto Input_Born_Day2:
24060 case 1:
24070 beep:pause 200:goto Input_Born_Day2:
24080 end select
24090 endif
24100 '左へボタン 十字キー　左　or 　カーソル左
24110 if ((y2 = -1) or (key$ = chr$(29))) then
24120 select case No
24130 'Ok ボタン  Okから　左　０に行く
24140 case -1:
24150 No=0:sp_on 13,1:sp_on 14,0:beep
24160 pause 200:goto Input_Born_Day2:
24170 '0 ボタン  左　何もしない
24180 case 0:
24190 beep:pause 200:goto Input_Born_Day2:
24200 case 3:
24210 No=2:sp_on 9,1:sp_on 12,0:beep
24220 pause 200:goto Input_Born_Day2:
24230 case 2:
24240 No=1:sp_on 6,1:sp_on 9,0:beep
24250 pause 200:goto Input_Born_Day2:
24260 case 1:
24270 pause 200:goto Input_Born_Day2:
24280 case 6:
24290 No=5:sp_on 8,1:sp_on 11,0:beep
24300 pause 200:goto Input_Born_Day2:
24310 case 5:
24320 No=4:sp_on 5,1:sp_on 8,0:beep
24330 pause 200:goto Input_Born_Day2:
24340 case 4:
24350 beep:pause 200:goto Input_Born_Day2:
24360 case 9:
24370 No=8:sp_on 7,1:sp_on 10,0:beep
24380 pause 200:goto Input_Born_Day2:
24390 case 8:
24400 No=7:sp_on 4,1:sp_on 7,0:beep
24410 pause 200:goto Input_Born_Day2:
24420 case 7:
24430 beep:pause 200:goto Input_Born_Day2:
24440 end select
24450 endif
24460 '右  十字キー　右　or カーソル　右
24470 if ((y2 = 1) or (key$ = chr$(28))) then
24480 select case No
24490 '0ボタンからokボタン右に移動
24500 case 0:
24510 No=-1:sp_on 14,1:sp_on 13,0:beep
24520 pause 200:goto Input_Born_Day2:
24530 '0ボタンからokボタン 右に移動　ここまで
24540 'OKボタンで右を押して何もしない
24550 case -1:
24560 beep:pause 200:goto Input_Born_Day2:
24570 case 1:
24580 No=2:sp_on 9,1:sp_on 6,0:beep
24590 pause 200:goto Input_Born_Day2:
24600 case 2:
24610 No=3:sp_on 12,1:sp_on 9,0:beep
24620 pause 200:goto Input_Born_Day2:
24630 case 3:
24640 beep:pause 200:goto Input_Born_Day2:
24650 case 4:
24660 No=5:sp_on 8,1:sp_on 5,0:beep
24670 pause 200:goto Input_Born_Day2:
24680 case 5:
24690 No=6:sp_on 11,1:sp_on 8,0:beep
24700 pause 200:goto Input_Born_Day2:
24710 case 7:
24720 No=8:sp_on 7,1:sp_on 4,0:beep
24730 pause 200:goto Input_Born_Day2:
24740 case 8:
24750 No=9:sp_on 10,1:sp_on 7,0:beep
24760 pause 200:goto Input_Born_Day2:
24770 case 9:
24780 beep:pause 200:goto Input_Born_Day2:
24790 case 6:
24800 beep:pause 200:goto Input_Born_Day2:
24810 end select
24820 'Okから右ボタンを押して何もしない ここまで
24830 endif
24840 '***********************************************************
24850 '2.WUXGAの時(WXGA以外の時)　ここまで
24860 '(1920 gload Gazo$ + "Selection.png",1,60,240
24870 '***********************************************************
24880 endif
24890 '十字キー　ここまで
24900 '右の丸ボタンを押したとき
24910 if ((bg = 2) or (key$ = chr$(13))) then
24920 'count :決定ボタンを押した回数
24930 select case (count mod 3)
24940 '1桁目入力
24950 case 0:
24960 count = 1:
24970 if (No = -1) then
24980 '1桁目　OKでは何もしない
24990 'goto check:
25000 else
25010 'ok以外のボタンを押したとき
25020 buf_day = No:buf_Day$ = str$(No)
25030 c=No:buf_Day2$ = buf_Day$ + string$(1,"*")
25040 locate 2,4
25050 color RGB(255,255,255)
25060 if ex_info$(1) <> "JP" then
25070 print "Input Born Day(1~31):";buf_Day2$
25080 else
25090 print "生まれた日(1日~31日):";buf_Day2$
25100 endif
25110 endif
25120 check:
25130 if (No >= 1 and No <= 9) then
25140 sp_on 14,0
25150 goto Input_Born_Day2:
25160 else
25170 sp_on 14,0
25180 goto complate:
25190 endif
25200 case 1:
25210 '10未満の数字ボタン+okボタン or 2桁目の数字ボタン
25220 count = 2:
25230 'locate 2,3
25240 'color RGB(255,255,255)
25250 'print "生まれた日(1日~31日):";buf_Day$
25260 'Okボタンを押したときの処理
25270 '入力値　10未満のとき
25280 'c = buf_day
25290 if (No = -1) then
25300 'c=buf_day
25310 ' buf_day = c
25320 'buf_Day$ = str$(buf_day)
25330 '10以下のとき
25340 if (buf_day < 10) then
25350 sp_on 14,0
25360 goto complate:
25370 endif
25380 else
25390 'c = No
25400 buf_day = c * 10 + No
25410 'buf_day = c
25420 buf_Day$ =str$(buf_day)
25430 locate 2,4
25440 color Rgb(255,255,255)
25450 if ex_info$(1) <> "JP" then
25460 print "Input Born Day(1~31):";buf_Day$
25470 else
25480 print "生まれた日(1日~31日):";buf_Day$
25490 endif
25500 goto Input_Born_Day2:
25510 endif
25520 '生まれた日　2桁目の数字　or 1桁の数字 + ok
25530 case 2:
25540 count=0
25550 'c=val(buf_Day$)
25560 'buf_day=c*10+No
25570 'buf_Day$=str$(buf_day)
25580 'day=buf_day
25590 'locate 2,3
25600 'print "生まれた日(1日〜31日):";buf_Day$
25610 'No=-1:ok ボタンを押したとき
25620 if (No = -1) then
25630 if ((buf_day > 0) and (buf_day < 32)) then
25640 sp_on 14,0
25650 goto complate:
25660 else
25670 goto Input_Born_Day2:
25680 endif
25690 'Okボタン以外を押したとき
25700 else
25710 c=val(buf_Day$)
25720 buf_day = c * 10 + No
25730 buf_Day$ = str$(buf_day)
25740 locate 2,4
25750 if ex_info$(1) <> "JP" then
25760 print "Input Born Day?(1~31):";buf_Day$
25770 else
25780 print "生まれた日(1日~31日):";buf_Day$
25790 endif
25800 'goto Input_Born_Day2:
25810 endif
25820 case 3:
25830 count = 4
25840 c=val(buf_day$)
25850 buf_day = c * 10 + No
25860 buf_day$ = str$(buf_day)
25870 locate 2,4
25880 if ex_info$(1) <> "JP" then
25890 print "Input Born Day?(1~31):";buf_Day$
25900 else
25910 print "生まれた日を入れてください(1日~31日):";buf_Day$
25920 endif
25930 year = val(buf_year$)
25940 if (No = -1) then
25950 'goto Input_Born_Day:
25960 sp_on 14,0:No=0
25970 goto complate:
25980 else
25990 goto Input_Born_Month2:
26000 endif
26010 'case 4:
26020 'bufyear=buf_year
26030 'if (No=-1) then
26040 'buf_day = val(buf_day$)
26050 'bufday = buf_day
26060 'sp_on 14,0
26070 'goto complate:
26080 'else
26090 'goto Input_Born_Day2:
26100 'endif
26110 end select
26120 endif
26130 if (bg2=2) then
26140 select case count
26150 case 0:
26160 if (No=-1) then
26170 'buf_day=0:buf_Day$="**"
26180 if (buf_day>=1 and buf_day<=31) then
26190 count=0:No=0
26200 buf_day=0:buf_Day$="**"
26210 'goto rewrite_day:
26220 else
26230 buf_day=0:buf_Day$="**"
26240 ui_msg"値が範囲外です"
26250 endif
26260 goto rewrite_day:
26270 else
26280 goto rewrite_day:
26290 endif
26300 rewrite_day:
26310 locate 2,4
26320 color rgb(255,255,255)
26330 print "                                      "
26340 locate 2,4
26350 if ex_info$(1)<>"JP" then
26360 print "Born Day(1~31):";buf_Day$
26370 else
26380 print "生まれた日(1日~31日):";buf_Day$
26390 endif
26400 goto Input_Born_Day2:
26410 end select
26420 endif
26430 '--------------------------Input_Born_Day:-------------------------------------------
26440 complate:
26450 suhiNo = buf_year + buf_month + buf_day
26460 'if (suhiNo < 1000) then
26470 a1 = fix(suhiNo / 1000)
26480 a2 = fix(suhiNo/100) - (a1 * 10)
26490 a3 = fix(suhiNo/10)-(a1*100+a2*10)
26500 a4 =fix(suhiNo-((a1*1000+a2*100+a3*10)))
26510 'endif
26520 bufsuhiNo = a1 + a2 + a3 + a4
26530 recomp:
26540 if ((bufsuhiNo > 0 and bufsuhiNo < 10) or (bufsuhiNo = 11) or (bufsuhiNo = 22) or (bufsuhiNo = 33)) then
26550 'bufsuhiNo=a6
26560 goto Kabara_Result_Screen:
26570 else
26580 a5 = fix(bufsuhiNo / 10)
26590 a6 = bufsuhiNo - a5 * 10
26600 bufsuhiNo = a6 + a5
26610 if (bufsuhiNo = 10) then
26620 bufsuhiNo=1
26630 endif
26640 goto Kabara_Result_Screen:
26650 endif
26660 Kabara_Result_Screen:
26670 cls 3:
26680 if ((size(0) <= 1280) and (size(1) <= 800)) then
26690 '****************************************************************************************************
26700 '1.WXGA(1260x800)の時
26710 '****************************************************************************************************
26720 gload Gazo$ + Gazo_WXGA$ + "ResultScreen_918x680_20240309.png",0,0,0
26730 '****************************************************************************************************
26740 '1.WUXGA(1260x800)の時
26750 '****************************************************************************************************
26760 else
26770 '****************************************************************************************************
26780 '1.WXGA(1920x1200)の時
26790 '****************************************************************************************************
26800 gload Gazo$ + "ResultScreen_20230601.png",0,0,0
26810 gload Gazo$ + "downscreen.png",0,0,800
26820 '****************************************************************************************************
26830 '1.WUXGA(1920x1200)の時
26840 '****************************************************************************************************
26850 endif
26860 init "kb:4"
26870 '
26880 play ""
26890 select case (bufsuhiNo)
26900 case 1:
26910 '****************************************************************************************************
26920 '1.数秘ナンバー 1
26930 '****************************************************************************************************
26940 play Voice$ + "Result_Kabara_1_20230607.mp3"
26950 '****************************************************************************************************
26960 '1.数秘ナンバー 1
26970 '****************************************************************************************************
26980 case 2:
26990 '****************************************************************************************************
27000 '1.数秘ナンバー 2
27010 '****************************************************************************************************
27020 play Voice$ + "Result_Kabara_2_20231112.mp3"
27030 '****************************************************************************************************
27040 '1.数秘ナンバー 2
27050 '****************************************************************************************************
27060 case 3:
27070 '****************************************************************************************************
27080 '1.数秘ナンバー 3
27090 '****************************************************************************************************
27100 play Voice$ + "Result_Kabara_3_20230607.mp3"
27110 '****************************************************************************************************
27120 '1.数秘ナンバー 3
27130 '****************************************************************************************************
27140 case 4:
27150 '****************************************************************************************************
27160 '1.数秘ナンバー 4
27170 '****************************************************************************************************
27180 play Voice$ + "Result_Kabara_4_20230607.mp3"
27190 '****************************************************************************************************
27200 '1.数秘ナンバー 4
27210 '****************************************************************************************************
27220 case 5:
27230 '****************************************************************************************************
27240 '1.数秘ナンバー 5
27250 '****************************************************************************************************
27260 play Voice$ + "Result_Kabara_5_20231112.mp3"
27270 '****************************************************************************************************
27280 '1.数秘ナンバー 5
27290 '****************************************************************************************************
27300 case 6:
27310 '****************************************************************************************************
27320 '1.数秘ナンバー 6
27330 '****************************************************************************************************
27340 play Voice$ + "Result_Kabara_6_20230607.mp3"
27350 '****************************************************************************************************
27360 '1.数秘ナンバー 6
27370 '****************************************************************************************************
27380 case 7:
27390 '****************************************************************************************************
27400 '1.数秘ナンバー 7
27410 '****************************************************************************************************
27420 play Voice$ + "Result_Kabara_7_20230607.mp3"
27430 '****************************************************************************************************
27440 '1.数秘ナンバー 7
27450 '****************************************************************************************************
27460 case 8:
27470 '****************************************************************************************************
27480 '1.数秘ナンバー 8
27490 '****************************************************************************************************
27500 play Voice$ + "Result_Kabara_8_20230607.mp3"
27510 '****************************************************************************************************
27520 '1.数秘ナンバー 8
27530 '****************************************************************************************************
27540 case 9:
27550 '****************************************************************************************************
27560 '1.数秘ナンバー 9
27570 '****************************************************************************************************
27580 play Voice$ + "Result_Kabara_9_20230607.mp3"
27590 '****************************************************************************************************
27600 '1.数秘ナンバー 9
27610 '****************************************************************************************************
27620 case 11:
27630 '****************************************************************************************************
27640 '1.数秘ナンバー 11
27650 '****************************************************************************************************
27660 play Voice$ + "Result_Kabara_11_20230607.mp3"
27670 '****************************************************************************************************
27680 '1.数秘ナンバー 11
27690 '****************************************************************************************************
27700 case 22:
27710 '****************************************************************************************************
27720 '1.数秘ナンバー 22
27730 '****************************************************************************************************
27740 play Voice$ + "Result_Kabara_22_20230607.mp3"
27750 '****************************************************************************************************
27760 '1.数秘ナンバー 22
27770 '****************************************************************************************************
27780 case 33:
27790 '****************************************************************************************************
27800 '1.数秘ナンバー 33
27810 '****************************************************************************************************
27820 play Voice$ + "Result_Kabara_33_20230607.mp3"
27830 '****************************************************************************************************
27840 '1.数秘ナンバー 33
27850 '****************************************************************************************************
27860 end select
27870 '****************************************************************************************************
27880 '
27890 '****************************************************************************************************
27900 font FONT
27910 '****************************************************************************************************
27920 '
27930 '****************************************************************************************************
27940 key$ = "":bg = 0:bg2=0
27950 'COLOR rgb(255,255,255)
27960 'print "●診断結果"+chr$(13)
27970 locate 0,2
27980 if ex_info$(1)<>"JP" then
27990 color rgb(0,0,0):print "Your Birth Day：";buf_year;".";buf_month;".";buf_day;".";chr$(13)
28000 color rgb(0,0,0):print"Your Kabara Kabara Number is";bufsuhiNo;".";chr$(13)
28010 locate 0,15:
28020 color rgb(255,255,255)
28030 print "Left button：Retry,Right Button：Main Screen" + chr$(13)
28040 else
28050 if ((size(0) <= 1280) and (size(1) <= 800)) then
28060 locate 0,4
28070 '****************************************************************************************************
28080 '1.WXGA(1260x800)の時
28090 '****************************************************************************************************
28100 color rgb(0,0,0):print "誕生日：";buf_year;"年";buf_month;"月";buf_day;"日";chr$(13)
28110 color rgb(0,0,0):print"あなたの数秘ナンバーは";bufsuhiNo;"です";chr$(13)
28120 locate 0,19
28130 print "                    "
28140 color rgb(255,255,255)
28150 locate 0,19
28160 print "左の丸：もう一度診断,右の丸：メイン画面" + chr$(13)
28170 '****************************************************************************************************
28180 '1.WUXGA(1260x800)の時
28190 '****************************************************************************************************
28200 else
28210 locate 0,2
28220 '****************************************************************************************************
28230 'WUXG(1920x1200)の時ここから
28240 '****************************************************************************************************
28250 color rgb(0,0,0):print "誕生日：";buf_year;"年";buf_month;"月";buf_day;"日";chr$(13)
28260 color rgb(0,0,0):print"あなたの数秘ナンバーは";bufsuhiNo;"です";chr$(13)
28270 locate 0,15
28280 color rgb(255,255,255)
28290 print "左の丸：もう一度診断,右の丸：メイン画面" + chr$(13)
28300 endif
28310 '****************************************************************************************************
28320 'WUXG(1920x1200)の時ここまで
28330 '****************************************************************************************************
28340 endif
28350 while ((key$ <> chr$(13)) and (bg <> 2) and (bg2 <> 2))
28360 key$ = inkey$
28370 bg = strig(1)
28380 bg2 = strig(0)
28390 pause 200
28400 wend
28410 'Enter or JoyPad right
28420 if ((key$ = chr$(13)) or (bg = 2)) then
28430 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 100:cls 3:goto Main_Screen:
28440 endif
28450 if ((bg2=2)) then
28460 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 100:cls 3:goto Input_Seireki:
28470 endif
28480 'suhiNo1 = fix(bufsuhiNo / 10)
28490 'suhiNo2 = bufsuhiNo - (suhiNo1 * 10)
28500 'bufsuhiNo = suhiNo1 + suhiNo2
28510 'goto recomp:
28520 'endif
28530 'print chr$(13)
28540 'color rgb(255,0,0)
28550 'print"トップ:エンターキー,S or s:保存"+chr$(13)
28560 'key$ = input$(1)
28570 'if key$ = chr$(13) then goto Main_Screen:
28580 '"Menu2 占いのルール"
28590 Suhi_Rule:
28600 '数秘術占いルールの表示
28610 cls 3:play "":init"kb:4"
28620 if  ((size(0)<=1280) and (size(1)<=800)) then
28630 '****************************************************************************************************
28640 'WUXG(1920x1200)の時ここから
28650 '****************************************************************************************************
28660 gload Gazo$ + Gazo_WXGA$ + "KabaraRuleScreen_864x640_20240219.png",0,0,0
28670 '****************************************************************************************************
28680 'WUXG(1920x1200)の時ここまで
28690 '****************************************************************************************************
28700 else
28710 '****************************************************************************************************
28720 'WUXG(1920x1200)の時ここから
28730 '****************************************************************************************************
28740 gload Gazo$ + "KabaraRuleScreen_20230601.png",0,0,0
28750 gload Gazo$ + "downscreen.png",0,0,800
28760 '****************************************************************************************************
28770 'WUXG(1920x1200)の時ここまで
28780 '****************************************************************************************************
28790 endif
28800 'cls 3:
28810 'line (0,0) - (1500,60),rgb(0,0,255),bf
28820 'line (0,60) - (1500,60*9),rgb(127,255,212),bf
28830 'line (0,60 * 9) - (1500,60 * 10 + 30),rgb(0,255,0),bf
28840 'COLOR rgb(255,255,255):print "Menu2 数秘術のルール";chr$(13)
28850 if ex_info$(1)<>"JP" then
28860 locate 0,2:Font 48
28870 print chr$(13) + chr$(13)
28880 color rgb(0,0,0)
28890 print "We will convert your birth date to a single number.";chr$(13)
28900 print "Number range: 1~9, 11, 22, 33";chr$(13)
28910 print "Example: If your birth date is 22nd November 1973";chr$(13)
28920 print "1+9+7+3+11+22=53 ";chr$(13)
28930 print "→ 5 + 3 = 8" + chr$(13)
28940 print "So, your numerology number is 8.";chr$(13)
28950 locate 0,15
28960 color rgb(255,255,255)
28970 print "Please press the right on the joystick"
28980 play Voice$ + "Voice_Kabara_Rule_Message_20230607.mp3"
28990 else
29000 Font FONT
29010 if ((size(0)<=1280) and (size(1)<=800)) then
29020 '************************************************************************************************
29030 '1.WXGAの時1200x800の時
29040 '************************************************************************************************
29050 color rgb(0,0,0)
29060 locate 1,5:print "誕生日を単数変換します";chr$(13)
29070 locate 1,7:print "数字の範囲:1~９,11,22,33";chr$(13)
29080 locate 1,9:print "例:1973年11月22日の場合";chr$(13)
29090 locate 1,11:print "1+9+7+3+11+22=53 ";chr$(13)
29100 locate 1,13:print "→ 5 + 3 = 8" + chr$(13)
29110 locate 1,15:print "故に8が数秘ナンバーになります";chr$(13)
29120 locate 0,19:color rgb(255,255,255)
29130 print "ジョイパッドの右を押してください"
29140 '************************************************************************************************
29150 '1.WXGAの時1200x800の時
29160 '************************************************************************************************
29170 else
29180 '****************************************************************************************************
29190 '2.WUXG(1920x1200)の時ここから
29200 '****************************************************************************************************
29210 print chr$(13) + chr$(13)
29220 color rgb(0,0,0)
29230 print "誕生日を単数変換します";chr$(13)
29240 print "数字の範囲:1~９,11,22,33";chr$(13)
29250 print "例:1973年11月22日の場合";chr$(13)
29260 print "1+9+7+3+11+22=53 ";chr$(13)
29270 print "→ 5 + 3 = 8" + chr$(13)
29280 print "故に8が数秘ナンバーになります";chr$(13)
29290 locate 0,15
29300 color rgb(255,255,255)
29310 print "ジョイパッドの右を押してください"
29320 '****************************************************************************************************
29330 '2.WUXG(1920x1200)の時ここまで
29340 '****************************************************************************************************
29350 endif
29360 play Voice$ + "Voice_Kabara_Rule_Message_20230607.mp3"
29370 endif
29380 '"key$ = input$(1)"
29390 '"if key$ = chr$(13) then goto Main_Screen:"
29400 suhi_rule_selection:
29410 bg = 0:key$ = "":bg2=0
29420 while ((bg <> 2) and (key$ <> chr$(13)) and (bg2<>2))
29430 bg = strig(1)
29440 key$ = inkey$
29450 bg2=strig(0)
29460 pause 200
29470 wend
29480 if ((bg = 2) or (key$ = chr$(13))) then
29490 pause 200:cls 4:goto Main_Screen:
29500 endif
29510 if (bg2=2) then
29520 play "":pause 200
29530 play Voice$ + "Voice_Kabara_Rule_Message_20230607.mp3"
29540 goto suhi_rule_selection:
29550 endif
29560 '2.設定 ここから
29570 '2-1.トップ画面に戻る
29580 Setting:
29590 cls 3:init"kb:4":font 48:No=0
29600 play ""
29610 play Voice$ + "Voice_Kabara_Setting_20230614.mp3"
29620 '****************************************************************************************************
29630 'W(1280x 800)の時ここから
29640 '****************************************************************************************************
29650 if (size(0)<=1280 and size(1)<=800) then
29660 gload Gazo$ + Gazo_WXGA$ + "Screen1_Setting_Top_907x680_20240221.png",0,0,0
29670 '****************************************************************************************************
29680 'W(1280 x800)の時ここまで
29690 '****************************************************************************************************
29700 else
29710 '****************************************************************************************************
29720 'WUXG(1920x1200)の時ここから
29730 '****************************************************************************************************
29740 gload Gazo$ + "Screen1_Setting_Top.png",0,0,0
29750 gload Gazo$ + "downscreen.png",0,0,800
29760 '****************************************************************************************************
29770 'WUXG(1920x1200)の時ここまで
29780 '****************************************************************************************************
29790 endif
29800 if (size(0)<=1280 and size(1)<=800) then
29810 font FONT:color rgb(255,255,255):cls
29820 sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:
29830 '****************************************************************************************************
29840 '(1280x800)の時 ここから
29850 '****************************************************************************************************
29860 locate 1,5:
29870 print "番号を選んでください"
29880 locate 1,7:
29890 print " :1.トップ画面に戻る"
29900 locate 1,10:
29910 print " :2.バーズアイグリッドデーターリスト"
29920 locate 1,13:
29930 print " :3.未実装" + chr$(13)
29940 locate 1,16:
29950 print " :4.未実装" + chr$(13)
29960 color rgb(0,0,0):locate 1,19:
29970 print "1.トップ画面に戻るを選択"
29980 '****************************************************************************************************
29990 '(1280x800)の時 ここまで
30000 '****************************************************************************************************
30010 else
30020 font FONT
30030 print chr$(13) + chr$(13) + chr$(13)
30040 color rgb(255,255,255):sp_on 0,1:
30050 '****************************************************************************************************
30060 'WUXG(1920x1200)の時ここから
30070 '****************************************************************************************************
30080 print "番号を選んでください" + chr$(13)
30090 print " :1.トップ画面に戻る"+ chr$(13)
30100 print " :2.バーズアイグリッドデーターリスト" + chr$(13)
30110 print " :3.未実装" + chr$(13)
30120 print " :4.未実装" + chr$(13)
30130 color rgb(0,0,0)
30140 locate 1,15:print "1.トップ画面に戻るを選択"
30150 '****************************************************************************************************
30160 'WUXG(1920x1200)の時ここまで
30170 '****************************************************************************************************
30180 endif
30190 Setting_Selection:
30200 y=0:key$="":bg=0:bg2=0
30210 while ((key$ <> chr$(13)) and (bg <> 2) and (bg2<>2) and (y <> -1) and (y <> 1))
30220 y=stick(1)
30230 key$ = inkey$
30240 bg=strig(1)
30250 bg2 = strig(0)
30260 pause 200
30270 wend
30280 if ((bg = 2) or (key$ = chr$(13))) then
30290 select case No
30300 case 0:
30310 sp_on 0,0:sp_on 1,0:sp_on 2,0:beep:pause 200:cls 3:goto Main_Screen:
30320 case 1:
30330 sp_on 0,0:sp_on 1,0:sp_on 2,0:beep:pause 200:goto BirdsEyeGrid_Entry:
30340 end select
30350 endif
30360 if (bg2 = 2) then
30370 play "":pause 200
30380 play Voice$ + "Voice_Kabara_Setting_20230614.mp3"
30390 goto Setting_Selection:
30400 endif
30410 '****************************************************************************************************
30420 '(1280x800)の時 ここから
30430 '****************************************************************************************************
30440 if (size(0) <= 1280 and size(1) <= 800) then
30450 if ((y=1) or (y=-1)) then
30460 select case No
30470 case 0:
30480 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:beep:gosub Setting_Recheck:pause 200:color rgb(0,0,0):locate 1,19:print "                    ":locate 1,19:print"2.バーズアイグリットデーターリストを選択":goto Setting_Selection:
30490 case else:
30500 No=0:sp_on 1,0:sp_on 0,1:sp_on 2,0:sp_on 3,0:beep:gosub Setting_Recheck:pause 200:locate 1,19:color rgb(0,0,0):print "                                              ":locate 1,19:print "1.トップ画面に戻るを選択":goto Setting_Selection:
30510 end select
30520 '****************************************************************************************************
30530 '(1280x800)の時 ここまで
30540 '****************************************************************************************************
30550 endif
30560 else
30570 '****************************************************************************************************
30580 '(1920x1280)の時 ここから
30590 '****************************************************************************************************
30600 if ((y = 1) or (y = -1)) then
30610 select case No
30620 case 0:
30630 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:beep:pause 200:color rgb(0,0,0):locate 1,15:print "                                              ":locate 1,15:print"2.バーズアイグリットデーターリストを選択":goto Setting_Selection:
30640 case else:
30650 No=0:sp_on 1,0:sp_on 0,1:sp_on 2,0:sp_on 3,0:beep:pause 200:color rgb(0,0,0):locate 1,15:print "                                              ":locate 1,15:print "1.トップ画面に戻るを選択":goto Setting_Selection:
30660 end select
30670 endif
30680 '****************************************************************************************************
30690 '(1920x1200)の時 ここまで
30700 '****************************************************************************************************
30710 endif
30720 '2.設定 ここまで
30730 '3.Help
30740 '3-1.ルールの表示
30750 '3-2.バージョン
30760 '3-3.トップに戻る
30770 Help:
30780 cls 3:font FONT:No=0
30790 play ""
30800 '****************************************************************************************************
30810 ''WXGAの場合　ここから (1280 x 800)
30820 '****************************************************************************************************
30830 if ((size(0) <= 1280) and (size(1) <= 800)) then
30840 gload Gazo$ + Gazo_WXGA$ + "TopScreen_Help_907x680_20240216.png",0,0,0
30850 '****************************************************************************************************
30860 ''WXGAの場合　ここまで (1280 x 800)
30870 '****************************************************************************************************
30880 else
30890 '****************************************************************************************************
30900 'WUXG(1920x1200)の時ここから
30910 '****************************************************************************************************
30920 gload Gazo$ + "TopScreen_Help20230612.png",0,0,0
30930 gload Gazo$ + "downscreen.png",0,0,800
30940 endif
30950 '****************************************************************************************************
30960 'WUXG(1920x1200)の時ここまで
30970 '****************************************************************************************************
30980 if ex_info$(1)<>"JP" then
30990 font FONT
31000 color rgb(255,255,255)
31010 print chr$(13)+chr$(13)+chr$(13)
31020 print "Please select a number"+chr$(13)
31030 print " :1. Rules for Explain" + chr$(13)
31040 print " :2. Display Version" + chr$(13)
31050 print " :3. References" + chr$(13)
31060 print " :4. Return to Top Screen" + chr$(13)
31070 else
31080 if ((size(0)<=1280) and (size(1)<=800)) then
31090 color rgb(255,255,255)
31100 font FONT
31110 locate 1,5
31120 print "番号を選んでください"
31130 locate 1,7
31140 print " :1.ルールの説明"
31150 locate 1,10
31160 print " :2.バージョンの表示"
31170 locate 1,13
31180 print " :3.参考文献"
31190 locate 1,16
31200 print " :4.トップ画面に戻る"
31210 else
31220 '****************************************************************************************************
31230 'WUXG(1920x1200)の時ここから
31240 '****************************************************************************************************
31250 font FONT
31260 color rgb(255,255,255)
31270 print chr$(13)+chr$(13)+chr$(13)
31280 print "番号を選んでください"+chr$(13)
31290 print " :1.ルールの説明" + chr$(13)
31300 print " :2.バージョンの表示" + chr$(13)
31310 print " :3.参考文献" + chr$(13)
31320 print " :4.トップ画面に戻る" + chr$(13)
31330 endif
31340 endif
31350 '****************************************************************************************************
31360 'WUXG(1920x1200)の時ここまで
31370 '****************************************************************************************************
31380 '************************************************************************************************
31390 '1.WXGAの場合　ここから (1280 x 800)
31400 '************************************************************************************************
31410 color rgb(0,0,0)
31420 if ((size(0) <= 1280) and (size(1) <= 800)) then
31430 sp_on 0,1:sp_on 1,0:sp_on 2,0,sp_on 3,0
31440 locate 1,19
31450 print "                                  "
31460 if ex_info$(1) <> "JP" then
31470 print "1. Select Rules for Explain"
31480 else
31490 locate 1,19
31500 print "1.ルールの説明を選択"
31510 endif
31520 '************************************************************************************************
31530 '1.WXGAの場合　ここまで (1280 x 800)
31540 '************************************************************************************************
31550 else
31560 '*************************************************************************************************
31570 '2.WUXG(1920x1200)の時ここから
31580 '**************************************************************************************************
31590 'color rgb(0,0,0)
31600 sp_on 0,1:sp_on 1,0:sp_on 2,0,sp_on 3,0
31610 locate 1,15
31620 print "                                  "
31630 if ex_info$(1) <> "JP" then
31640 print "1. Select Rules for Explain"
31650 else
31660 locate 1,15
31670 print "1.ルールの説明を選択"
31680 endif
31690 '****************************************************************************************************
31700 '2.WUXG(1920x1200)の時ここまで
31710 '****************************************************************************************************
31720 endif
31730 init"kb:4"
31740 play Voice$ + "Voice_Kabara_Help_Top_20230614.mp3"
31750 Help_Select:
31760 bg=0:key$="":y=0:bg2=0
31770 while ((key$ <> chr$(31)) and (key$ <> chr$(13)) and (y <> 1) and (y <> -1) and (bg <> 2) and (bg2 <> 2))
31780 y = stick(1)
31790 key$ = inkey$
31800 bg = strig(1)
31810 bg2 = strig(0)
31820 pause 200
31830 wend
31840 if ex_info$(1)<>"JP" then
31850 '*******************************************************************************************************
31860 '英語の時 ここから
31870 '*******************************************************************************************************
31880 'Joypad: Down (y=1), Cursor: Down (key$=chr$(31))
31890 if ((y = 1) or (key$ = chr$(31))) then
31900 select case No
31910 case 0:
31920 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print"2. Display Version":goto Help_Select:
31930 case 1:
31940 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "3. References":goto Help_Select:
31950 case 2:
31960 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "4. Return to Top Screen":goto Help_Select:
31970 case 3:
31980 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "1. Select Rule for Explain":goto Help_Select:
31990 end select
32000 endif
32010 '************************************************************************************************
32020 '1.WXGAの場合　ここから (1280 x 800)
32030 '************************************************************************************************
32040 if ((y = -1) or (key$ = chr$(30))) then
32050 select case No
32060 case 0:
32070 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,19:print "                                      ":locate 1,19:print "4.Return to Top Screen":goto Help_Select:
32080 case 1:
32090 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,19:print "                                      ":locate 1,19:print "1.Select Rules for Explain":goto Help_Select:
32100 case 2:
32110 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,19:print "                                        ":locate 1,19:print "2.Display Version":goto Help_Select:
32120 case 3:
32130 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,19:print "                                              ":locate 1,19:print "3.References":goto Help_Select:
32140 end select
32150 endif
32160 '************************************************************************************************
32170 '1.WXGAの場合　ここまで (1280 x 800)
32180 '************************************************************************************************
32190 '****************************************************************************************************
32200 'WUXG(1920x1200)の時ここから
32210 '****************************************************************************************************
32220 if ((y = -1) or (key$ = chr$(30))) then
32230 select case No
32240 case 0:
32250 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "4.Return to Top Screen":goto Help_Select:
32260 case 1:
32270 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.Select Rules for Explain":goto Help_Select:
32280 case 2:
32290 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                        ":locate 1,15:print "2.Display Version":goto Help_Select:
32300 case 3:
32310 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "3.References":goto Help_Select:
32320 end select
32330 endif
32340 '****************************************************************************************************
32350 'WUXG(1920x1200)の時ここまで
32360 '****************************************************************************************************
32370 '*******************************************************************************************************
32380 '英語の時 ここまで
32390 '*******************************************************************************************************
32400 else
32410 '******************************************************************************************************
32420 '日本語の時
32430 '******************************************************************************************************
32440 'endif
32450 'endif
32460 '************************************************************************************************
32470 '1.WXGAの場合　ここから (1280 x 800)
32480 '************************************************************************************************
32490 '******************************************************************************************************
32500 '日本語の時
32510 '******************************************************************************************************
32520 if ((size(0) <= 1280) and (size(1) <= 800)) then
32530 'ジョイパッド：下 (y=1)、カーソル：下 (key$=chr$(31))
32540 if ((y = 1) or (key$ = chr$(31))) then
32550 select case No
32560 case 0:
32570 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_put 1,(5,Y + 120),1,0:count = count + 1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0):locate 1,19:print "                                      ":locate 1,19:print"2.バージョンの表示を選択":goto Help_Select:
32580 case 1:
32590 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,Y + 220),2,0:count = count + 1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0):locate 1,19:print "                                      ":locate 1,19:print "3.参考文献を選択":goto Help_Select:
32600 case 2:
32610 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,Y + 320),0,0:count = count + 1:beep:pause 200:locate 1,19:gosub Help_Top_ReCheck:color rgb(0,0,0):print "                                      ":locate 1,19:print "4.トップ画面に戻る":goto Help_Select:
32620 case 3:
32630 '****************************
32640 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,Y + 20),0,0:count = count + 1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0):locate 1,19:print "                                              ":locate 1,19:print "1.ルールの説明を選択":goto Help_Select:
32650 '****************************
32660 end select
32670 endif
32680 '************************************************************************************************
32690 '1.WXGAの場合　ここまで (1280 x 800)
32700 '************************************************************************************************
32710 '******************************************************************************************************
32720 '日本語の時
32730 '******************************************************************************************************
32740 else
32750 '****************************************************************************************************
32760 'WUXG(1920x1200)の時ここから
32770 '****************************************************************************************************
32780 '******************************************************************************************************
32790 '日本語の時
32800 '******************************************************************************************************
32810 if ((y = 1) or (key$ = chr$(31))) then
32820 select case No
32830 case 0:
32840 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print"2.バージョンの表示を選択":goto Help_Select:
32850 case 1:
32860 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "3.参考文献を選択":goto Help_Select:
32870 case 2:
32880 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "4.トップ画面に戻る":goto Help_Select:
32890 case 3:
32900 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "1.ルールの説明を選択":goto Help_Select:
32910 end select
32920 endif
32930 '****************************************************************************************************
32940 'WUXG(1920x1200)の時ここまで
32950 '****************************************************************************************************
32960 endif
32970 'ジョイパッド：上  (y=-1) 、カーソル上 (key$=chr$(30))
32980 '************************************************************************************************
32990 '1.WXGAの場合　ここから (1280 x 800)
33000 '************************************************************************************************
33010 if ((size(0) <= 1280) and (size(1) <= 800)) then
33020 if ((y = -1) or (key$ = chr$(30))) then
33030 select case No
33040 case 0:
33050 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,Y+320),0,0:count=count+1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0):locate 1,15:print "                                      ":locate 1,19:print "4.トップ画面に戻るを選択":goto Help_Select:
33060 case 1:
33070 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,Y+20),0,0:count=count+1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0,0):locate 1,15:print "                                      ":locate 1,19:print "1.ルールの説明を選択":goto Help_Select:
33080 case 2:
33090 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(5,Y+120),1,0:count=count+1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0):locate 1,15:print "                                        ":locate 1,19:print "2.バージョンの表示を選択":goto Help_Select:
33100 case 3:
33110 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,Y+220),2,0:count=count+1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0):locate 1,15:print "                                              ":locate 1,19:print "3.参考文献を選択":goto Help_Select:
33120 end select
33130 endif
33140 '************************************************************************************************
33150 '1.WXGAの場合　ここから (1280 x 800)
33160 '************************************************************************************************
33170 else
33180 '************************************************************************************************
33190 'WUXG(1920x1200)の時ここから
33200 '************************************************************************************************
33210 if ((y = -1) or (key$ = chr$(30))) then
33220 select case No
33230 case 0:
33240 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "4.トップ画面に戻るを選択":goto Help_Select:
33250 case 1:
33260 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.ルールの説明を選択":goto Help_Select:
33270 case 2:
33280 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                        ":locate 1,15:print "2.バージョンの表示を選択":goto Help_Select:
33290 case 3:
33300 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "3.参考文献を選択":goto Help_Select:
33310 end select
33320 endif
33330 '****************************************************************************************************
33340 'WUXG(1920x1200)の時ここまで
33350 '****************************************************************************************************
33360 endif
33370 'endif
33380 'ジョイパッド　右(bg=2) or Enter key (key$=chr$(13))
33390 if ((bg = 2) or (key$ = chr$(13))) then
33400 select case No
33410 case 0:
33420 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:goto Suhi_Rule_explainTop: 'Suhi_Rule:
33430 case 1:
33440 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:goto Version:
33450 case 2:
33460 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 20:goto References1:
33470 '3:Top画面に行く
33480 case 3:
33490 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:cls 4:goto Main_Screen:
33500 end select
33510 endif
33520 if (bg2 = 2) then
33530 play "":pause 200
33540 play Voice$ + "Voice_Kabara_Help_Top_20230614.mp3"
33550 goto Help_Select:
33560 endif
33570 'ルールの説明　トップ画面
33580 Suhi_Rule_explainTop:
33590 '**********************************************************
33600 cls 3:No=0
33610 play ""
33620 '****************************************************************************************************
33630 'WUXG(1920x1200)の時ここから
33640 '背景画像
33650 '****************************************************************************************************
33660 font FONT
33670 if ((size(0) <= 1280) and (size(1) <= 800)) then
33680 gload Gazo$ + Gazo_WXGA$ + "Rule_explain_TopScreen_907x680_20240218.png",0,0,0
33690 else
33700 gload Gazo$ + "Rule_explain_TopScreen20240201.png",0,0,0
33710 gload Gazo$ + "downscreen.png",0,0,800
33720 endif
33730 '****************************************************************************************************
33740 'WUXG(1920x1200)の時ここまで
33750 '背景画像
33760 '****************************************************************************************************
33770 if ex_info$(1)<>"JP" then
33780 color rgb(255,255,255)
33790 print chr$(13)+chr$(13)+chr$(13)
33800 print "Please select a number"+chr$(13)
33810 print " :1.How to Kabara" + chr$(13)
33820 print " :2. Explain for BirdseyeGrid" + chr$(13)
33830 print " :3. Return to Top Screen" + chr$(13)
33840 else
33850 '****************************************************************************************************
33860 'WUXG(1920x1200)の時ここから
33870 '****************************************************************************************************
33880 '****************************************************************************************************
33890 'Top画面メニュー表示文字　ここから
33900 '****************************************************************************************************
33910 '***************************************************************************************************
33920 'WXGA(1200x800)の時 ここから
33930 '***************************************************************************************************
33940 if ((size(0) <= 1280) and (size(1) <= 800)) then
33950 '***************************************************************************************************
33960 'WXGA(1200x800)の時 ここから
33970 '***************************************************************************************************
33980 color rgb(255,255,255)
33990 locate 1,5
34000 print "番号を選んでください"
34010 locate 1,7:    '〇
34020 print " :1.数秘術のやり方"
34030 locate 1,10:   '〇
34040 print " :2.バーズアイグリットの説明"
34050 locate 1,13:    '〇
34060 print " :3.トップ画面に戻る"
34070 '***************************************************************************************************
34080 'WXGA(1200x800)の時 ここまで
34090 '***************************************************************************************************
34100 else
34110 '***************************************************************************************************
34120 'WXGA(1920x1260) の時 ここから
34130 '***************************************************************************************************
34140 color rgb(255,255,255)
34150 print chr$(13)+chr$(13)+chr$(13)
34160 print "番号を選んでください"+chr$(13)
34170 print " :1.数秘術のやり方" + chr$(13)
34180 print " :2.バーズアイグリットの説明" + chr$(13)
34190 print " :3.トップ画面に戻る" + chr$(13)
34200 '***************************************************************************************************
34210 'WXGA(1920x1260) の時 ここまで
34220 '***************************************************************************************************
34230 '****************************************************************************************************
34240 'Top画面メニュー表示文字　ここまで
34250 '****************************************************************************************************
34260 endif
34270 '****************************************************************************************************
34280 'WUXG(1920x1200)の時ここまで
34290 '****************************************************************************************************
34300 endif
34310 color rgb(0,0,0)
34320 sp_on 0,1:sp_on 1,0:sp_on 2,0,sp_on 3,0
34330 locate 1,15
34340 print "                                  "
34350 if ex_info$(1) <> "JP" then
34360 '***************************************************************************************************
34370 '英語の時
34380 '*************************************************************************************************
34390 print "                                  "
34400 print ":1.How to Kabara"
34410 '***************************************************************************************************
34420 '英語の時
34430 '*************************************************************************************************
34440 else
34450 '******************************************************************************************************
34460 '日本語の時
34470 '****************************************************************************************************
34480 '****************************************************************************************************
34490 'WXGA 1280 x 800 の時　ここから
34500 '****************************************************************************************************
34510 if ((size(0) <= 1280) and (size(1) <= 800))  then
34520 '****************************************************************************************************
34530 'WXGA 1280x800 の時　ここから
34540 '****************************************************************************************************
34550 locate 1,19
34560 print ":1.数秘術のやり方"
34570 '****************************************************************************************************
34580 'WXGA 1280 x 800 の時　ここまで
34590 '****************************************************************************************************
34600 endif
34610 '****************************************************************************************************
34620 'WXGA 1280 x 800 の時　ここまで
34630 '****************************************************************************************************
34640 else
34650 '****************************************************************************************************
34660 '1920 x 1260  ここから
34670 '****************************************************************************************************
34680 locate 1,15
34690 print ":1.数秘術のやり方"
34700 '****************************************************************************************************
34710 '1920 x 1260 ここまで
34720 '****************************************************************************************************
34730 endif
34740 endif
34750 init "kb:4"
34760 play Voice$ + "Voice_Kabara_Help_Top_20230614.mp3"
34770 Suhi_Rule_explainTop2:
34780 bg=0:key$="":y=0:bg2=0
34790 while ((key$ <> chr$(31)) and (key$ <> chr$(13)) and (y <> 1) and (y <> -1) and (bg <> 2) and (bg2 <> 2))
34800 y = stick(1)
34810 key$ = inkey$
34820 bg = strig(1)
34830 bg2 = strig(0)
34840 pause 200
34850 wend
34860 '******************************************************************************************************
34870 '英語 ここから
34880 '******************************************************************************************************
34890 if ex_info$(1)<>"JP" then
34900 '******************************************************************************************************
34910 '英語 ここから
34920 '******************************************************************************************************
34930 'Joypad: Down (y=1), Cursor: Down (key$=chr$(31))
34940 if ((y = 1) or (key$ = chr$(31))) then
34950 select case No
34960 case 0:
34970 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print"2. Explain for BirdseyeGrid":goto Suhi_Rule_explainTop2:
34980 case 1:
34990 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "3. Return to Top Screen":goto Suhi_Rule_explainTop2:
35000 case 2:
35010 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "1.How to Kabara":goto Suhi_Rule_explainTop2:
35020 end select
35030 endif
35040 'Joypad: Up (y=-1), Cursor: Up (key$=chr$(30))
35050 if ((y = -1) or (key$ = chr$(30))) then
35060 select case No
35070 case 0:
35080 No=2:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 2,(5,Y+220),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.How to Kabara":goto Suhi_Rule_explainTop2:
35090 case 2:
35100 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(5,Y+120),1,0:beep:pause 200:locate 1,15:print "                                        ":locate 1,15:print "2. Explain for BirdseyeGrid":goto Suhi_Rule_explainTop2:
35110 case 3:
35120 No=0:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 0,(5,Y+20),2,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "3. Return to Top Screen":goto Suhi_Rule_explainTop2:
35130 end select
35140 endif
35150 '********************************************************************************************************
35160 '英語　ここまで
35170 '********************************************************************************************************
35180 else
35190 '********************************************************************************************************
35200 '英語　ここまで
35210 '********************************************************************************************************
35220 'ジョイパッド：下 (y=1)、カーソル：下 (key$=chr$(31))
35230 '*******************************************************************************************************
35240 'WXGA 1200x 800 日本語
35250 '*******************************************************************************************************
35260 if ((size(0) <= 1280) and (size(1) <= 800)) then
35270 '*******************************************************************************************************
35280 'WXGA 1200x 800 ここから 日本語
35290 '*******************************************************************************************************
35300 if ((y = 1) or (key$ = chr$(31))) then
35310 select case No
35320 case 0:
35330 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_put 1,(x,Y+120),1,0:beep:gosub Suhi_Rule_Screen_Recheck:pause 200:count=count+1:color rgb(0,0,0):locate 1,19:print "                                      ":locate 1,19:print"2.バーズアイグリットの説明":goto Suhi_Rule_explainTop2:
35340 case 1:
35350 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(X,Y+220),2,0:beep:gosub Suhi_Rule_Screen_Recheck:pause 200:count=count+1:locate 1,19:color rgb(0,0,0):print "                                      ":locate 1,19:print "3.トップ画面に戻る":goto Suhi_Rule_explainTop2:
35360 case 2:
35370 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(X,Y+20),0,0:beep:gosub Suhi_Rule_Screen_Recheck:pause 200:count=count+1:locate 1,19:color rgb(0,0,0):print "                                              ":locate 1,19:print "1.数秘術のやり方を選択":goto Suhi_Rule_explainTop2:
35380 end select
35390 endif
35400 'ジョイパッド：上  (y=-1) 、カーソル上 (key$=chr$(30))
35410 if ((y = -1) or (key$ = chr$(30))) then
35420 select case No
35430 case 0:
35440 No=2:sp_on 1,0:sp_on 0,0:sp_on 2,1:sp_on 0,0:sp_put 2,(5,Y+220),0,0:beep:gosub Suhi_Rule_Screen_Recheck:pause 200:count=count+1:locate 1,19:color rgb(0,0,0):print "                                      ":locate 1,19:print "1.数秘術のやり方":goto Suhi_Rule_explainTop2:
35450 case 1:
35460 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,Y+20),1,0:beep:gosub Suhi_Rule_Screen_Recheck:pause 200:count=count+1:locate 1,19:color rgb(0,0,0):print "                                        ":locate 1,19:print "2.バーズアイグリットの説明を選択":goto Suhi_Rule_explainTop2:
35470 case 2:
35480 No=1:sp_on 1,1:sp_on 1,0:sp_on 0,0:sp_on 2,0:sp_put 1,(5,Y+120),2,0:beep:gosub Suhi_Rule_Screen_Recheck:pause 200:count=count+1:locate 1,19:color rgb(0,0,0):print "                                              ":locate 1,19:print "3.トップ画面に行く":goto Suhi_Rule_explainTop2:
35490 end select
35500 endif
35510 endif
35520 '*******************************************************************************************************
35530 'WXGA 1200x 800 ここまで 日本語
35540 '*******************************************************************************************************
35550 '*******************************************************************************************************
35560 '1920x 1260 　ここから
35570 '*******************************************************************************************************
35580 else
35590 '*******************************************************************************************************
35600 '1920x 1260 　ここから
35610 '*******************************************************************************************************
35620 if ((y = 1) or (key$ = chr$(31))) then
35630 select case No
35640 case 0:
35650 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print"2.バーズアイグリットの説明":goto Suhi_Rule_explainTop2:
35660 case 1:
35670 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "3.トップ画面に戻る":goto Suhi_Rule_explainTop2:
35680 case 2:
35690 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "1.数秘術のやり方を選択":goto Suhi_Rule_explainTop2:
35700 end select
35710 endif
35720 'ジョイパッド：上  (y=-1) 、カーソル上 (key$=chr$(30))
35730 if ((y = -1) or (key$ = chr$(30))) then
35740 select case No
35750 case 2:
35760 No=0:sp_on 1,0:sp_on 0,1:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.数秘術のやり方":goto Suhi_Rule_explainTop2:
35770 case 0:
35780 No=1:sp_on 2,0:sp_on 1,1:sp_on 2,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                        ":locate 1,15:print "2.バーズアイグリットの説明を選択":goto Suhi_Rule_explainTop2:
35790 case 1:
35800 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "3.トップ画面に行く":goto Suhi_Rule_explainTop2:
35810 end select
35820 endif
35830 endif
35840 '******************************************************************************************************
35850 '1920x 1260　ここまで
35860 '******************************************************************************************************
35870 'endif
35880 'ジョイパッド　右(bg=2) or Enter key (key$=chr$(13))
35890 '*******************************************************************************************************
35900 '決定ボタンを押したときの処理　共通部分　ここから
35910 '********************************************************************************************************
35920 '********************************************************************************************************
35930 'bg:右の丸ボタン　chr$(13):Enter Key
35940 '********************************************************************************************************
35950 if ((bg = 2) or (key$ = chr$(13))) then
35960 select case No
35970 case 0:
35980 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 20:goto Suhi_Rule:  '1.数秘ルールの説明
35990 case 1:
36000 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 20:goto BirdsEyeGrid_Explain1:  '2.バーズアイグリットの説明
36010 '3:Top画面に行く
36020 case 2:
36030 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:cls 4:goto Main_Screen: '3.メイン画面に行く
36040 end select
36050 endif
36060 '********************************************************************************************************
36070 '決定ボタンを押したときの処理　共通部分　ここまで
36080 '*********************************************************************************************************
36090 if (bg2 = 2) then
36100 play "":pause 200
36110 play Voice$ + "Voice_Kabara_Help_Top_20230614.mp3"
36120 goto Suhi_Rule_explainTop2:
36130 endif
36140 '**********************************************************
36150 'バーズアイグリットの説明1
36160 'Help-
36170 '**********************************************************
36180 BirdsEyeGrid_Explain1:
36190 '●.初期設定
36200 cls 3:Font FONT:No=0:bg=0:key$="":bg2=0
36210 play "":'音を停める
36220 'バーズアイグリット基本チャートを表示　　ここから
36230 if ex_info$(1) <> "JP" then
36240 '英語ファイル
36250 else
36260 if ((size(0)<=1280) and (size(1)<=800)) then
36270 gload Gazo$ + Gazo_WXGA$ + "BirdsEyeGrid_Explain1_Chart_907x680_20240219.png",0,0,0
36280 else
36290 '****************************************************************************************************
36300 'WUXG(1920x1200)の時ここから
36310 '****************************************************************************************************
36320 '日本語ファイル
36330 gload Gazo$ + "BirdsEyeGrid_Explain1_Chart_20240202.png",0,0,0
36340 '****************************************************************************************************
36350 'WUXG(1920x1200)の時ここまで
36360 '****************************************************************************************************
36370 endif
36380 'バーズアイグリット基本チャートを表示　　ここまで
36390 endif
36400 'ジョイパッドの右で次へ行く
36410 while ((key$ <> chr$(13)) and (bg <> 2) and (bg2<>2))
36420 key$ = inkey$
36430 bg = strig(1)
36440 bg2 = strig(0)
36450 pause 200
36460 wend
36470 if (bg=2 or key$=chr$(13)) then
36480 'ジョイパッドの右を押した時、もしくはEnterを押したときの処理
36490 'goto バーズアイグリット説明の2番目に行く
36500 '未実装なのでメイン画面に行く
36510 goto Main_Screen:
36520 end
36530 endif
36540 if (bg2 = 2 or key$ = "") then
36550 'ジョイパッドの左を押した時、もしくはSpaceを押したときの処理
36560 'goto Top画面に行く
36570 goto Main_Screen:
36580 'end
36590 endif
36600 '**********************************************************
36610 'バーズアイグリットの説明2
36620 'Help-
36630 '**********************************************************
36640 BirdsEyeGrid_Explain2:
36650 '●.初期設定
36660 cls 3:Font 48:No = 0:bg = 0:key$ = "":bg2 = 0
36670 play "":'音を停める
36680 'バーズアイグリット基本チャートを表示　　ここから
36690 if ex_info$(1) <> "JP" then
36700 '英語ファイル
36710 else
36720 '日本語ファイル
36730 '****************************************************************************************************
36740 'WUXG(1920x1200)の時ここから
36750 '****************************************************************************************************
36760 gload Gazo$ + "BirdsEyeGrid_Exaple1_Chart_20240202.png",0,0,0
36770 '****************************************************************************************************
36780 'WUXG(1920x1200)の時ここまで
36790 '****************************************************************************************************
36800 'バーズアイグリット基本チャートを表示　　ここまで
36810 endif
36820 'ジョイパッドの右で次へ行く
36830 while ((key$ <> chr$(13)) and (bg <> 2) and (bg2<>2))
36840 key$ = inkey$
36850 bg = strig(1)
36860 bg2 = strig(0)
36870 pause 200
36880 wend
36890 if (bg = 2 or key$ = chr$(13)) then
36900 'ジョイパッドの右を押した時、もしくはEnterを押したときの処理
36910 'goto バーズアイグリット説明の3番目に行く
36920 end
36930 endif
36940 if (bg2 = 2 or key$ = "") then
36950 'ジョイパッドの左を押した時、もしくはSpaceを押したときの処理
36960 'goto Top画面に行く
36970 goto Main_Screen:
36980 'end
36990 endif
37000 '**********************************************************
37010 '数秘術占い　トップ画面
37020 Kabara_TopScreen:
37030 cls 3:play "":
37040 if ((size(0)<=1280) and (size(1)<=800)) then
37050 '***********************************************************
37060 '1280x800ここから
37070 '***********************************************************
37080 gload Gazo$ + Gazo_WXGA$ + "Kabara_TopScreen_853x640_20240223.png",0,0,0
37090 '************************************************************
37100 '1280x800ここまで
37110 '************************************************************
37120 else
37130 '****************************************************************************************************
37140 'WUXG(1920x1200)の時ここから
37150 '****************************************************************************************************
37160 gload Gazo$ + "Kabara_TopScreen20230618.png",0,0,0
37170 gload Gazo$ + "downscreen.png",0,0,800
37180 '****************************************************************************************************
37190 'WUXG(1920x1200)の時ここまで
37200 '****************************************************************************************************
37210 endif
37220 play Voice$ + "KabaraTop_Selection_20230721.mp3"
37230 sp_on 0,1:sp_on  1,0:sp_on 2,0:sp_on 3,0
37240 init"kb:4":No=0
37250 if ex_info$(1)<>"JP" then
37260 color rgb(255,255,255)
37270 print chr$(13)+chr$(13)+chr$(13)
37280 print "Please select a number" + chr$(13)
37290 print " :1.Numerology" + chr$(13)
37300 print " :2.Bird's Eye Grid" + chr$(13)
37310 print " :3.Compatibility Divination" + chr$(13)
37320 print " :4.Return to Top Screen" + chr$(13)
37330 color rgb(0,0,0)
37340 locate 1,15:print "1. Select Numerology"
37350 else
37360 if ((size(0)<=1280) and (size(1)<=800)) then
37370 '***************************************************************************************************
37380 '1280 x800 ここから
37390 '***************************************************************************************************
37400 color rgb(255,255,255):font FONT
37410 locate 1,5
37420 print "番号を選んでください" + chr$(13)
37430 locate 1,7
37440 print " :1.数秘術占い" + chr$(13)
37450 locate 1,10
37460 print " :2.バーズアイグリット" + chr$(13)
37470 locate 1,13
37480 print " :3.相性占い" + chr$(13)
37490 locate 1,16
37500 print " :4.トップ画面に戻る" + chr$(13)
37510 color rgb(0,0,0)
37520 locate 1,18:print "1.数秘術占いを選択"
37530 '***************************************************************************************************
37540 '1280 x800 ここまで
37550 '***************************************************************************************************
37560 else
37570 '****************************************************************************************************
37580 'WUXG(1920x1200)の時ここから
37590 '****************************************************************************************************
37600 color rgb(255,255,255):font FONT
37610 print chr$(13)+chr$(13)+chr$(13)
37620 print "番号を選んでください" + chr$(13)
37630 print " :1.数秘術占い" + chr$(13)
37640 print " :2.バーズアイグリット" + chr$(13)
37650 print " :3.相性占い" + chr$(13)
37660 print " :4.トップ画面に戻る" + chr$(13)
37670 color rgb(0,0,0)
37680 locate 1,15:print "1.数秘術占いを選択"
37690 '****************************************************************************************************
37700 'WUXG(1920x1200)の時ここまで
37710 '****************************************************************************************************
37720 endif
37730 endif
37740 Kabara_TopScreen2:
37750 y = 0:bg = 0:key$ = "":bg2 = 0
37760 while ((y <> 1) and (y <> -1) and (key$ <> chr$(31)) and (key$ <> chr$(30)) and (key$ <> chr$(13)) and (bg <> 2) and (bg2 <> 2))
37770 key$ = inkey$
37780 bg = strig(1)
37790 y = stick(1)
37800 bg2 = strig(0)
37810 pause 200
37820 wend
37830 '選択ボタン
37840 'カーソル下 　と　ジョイパッド　の下
37850 '****************************************************************************************************
37860 '英語パート ここから
37870 '****************************************************************************************************
37880 if ex_info$(1)<>"JP" then
37890 if ((y = 1) or (key$ = chr$(31))) then
37900 select case No
37910 case 2:
37920 No=3:sp_on 3,1:sp_on 1,0:sp_on 2,0:sp_on 0,0:sp_put 3,(X,Y+320),0,0:beep:pause 200:locate 1,15:print "                                    ":locate 1,15:print "4.Return to Top Screen":goto Kabara_TopScreen2:
37930 case 3:
37940 No=0:sp_on 0,1:sp_on 2,0:sp_on 1,0:sp_on 3,0:sp_put 0,(X,Y+20),0,0:beep:pause 200: locate 1,15:print "                                      ":locate 1,15:print "1.Select Numerology":goto Kabara_TopScreen2:
37950 case 0:
37960 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(X,Y+120),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.Select Bird's Eye Grid":goto Kabara_TopScreen2:
37970 case 1:
37980 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:sp_on 3,0:sp_put 2,(X,Y+220),0,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print"3.Select Compatibility Divination":goto Kabara_TopScreen2:
37990 end select
38000 endif
38010 '*****************************************************************************************************
38020 '英語パート ここまで
38030 '****************************************************************************************************
38040 else
38050 '****************************************************************************************************
38060 '日本語パート ここから
38070 '****************************************************************************************************
38080 if ((size(0) <= 1280) and (size(1) <= 800)) then
38090 '******************************************************************************************************
38100 '1280 x 800 日本語 ここから
38110 '*****************************************************************************************************
38120 if ((y = 1) or (key$ = chr$(31))) then
38130 select case No
38140 case 2:
38150 No=3:sp_on 3,1:sp_on 1,0:sp_on 2,0:sp_on 0,0:sp_put 3,(X,Y+320),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                    ":locate 1,18:print "4.トップ画面に戻るを選択":goto Kabara_TopScreen2:
38160 case 3:
38170 No=0:sp_on 0,1:sp_on 2,0:sp_on 1,0:sp_on 3,0:sp_put 0,(X,Y+20),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0): locate 1,18:print"                                      ":locate 1,18:print "1.数秘術占いを選択":goto Kabara_TopScreen2:
38180 case 0:
38190 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(X,Y+120),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                      ":locate 1,18:print "2.バーズアイグリッドを選択":goto Kabara_TopScreen2:
38200 case 1:
38210 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:sp_on 3,0:sp_put 2,(X,Y+220),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                              ":locate 1,18:print"3.相性占いを選択":goto Kabara_TopScreen2:
38220 end select
38230 endif
38240 'カーソル　上  or  ジョイパッド　上
38250 if ((y = -1) or (key$ = chr$(30))) then
38260 select case No
38270 case 0:
38280 No=3:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,1:sp_put 3,(X,Y+320),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                      ":locate 1,18:print "4.トップ画面に戻るを選択":goto Kabara_TopScreen2:
38290 case 1:
38300 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(X,Y+20),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                      ":locate 1,18:print "1.数秘術占いを選択":goto Kabara_TopScreen2:
38310 case 2:
38320 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(X,Y+120),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                      ":locate 1,18:print "2.バーズアイグリッドを選択":goto Kabara_TopScreen2:
38330 case 3:
38340 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(X,Y+220),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                       ":locate 1,18:print"3.相性占いを選択":goto Kabara_TopScreen2:
38350 end select
38360 endif
38370 '*****************************************************************************************************
38380 '1280 x800 ここまで
38390 '******************************************************************************************************
38400 else
38410 '******************************************************************************************************
38420 '1920x1280 ここから
38430 '******************************************************************************************************
38440 if ((y = 1) or (key$ = chr$(31))) then
38450 select case No
38460 case 2:
38470 No=3:sp_on 3,1:sp_on 1,0:sp_on 2,0:sp_on 0,0:sp_put 3,(X,Y+320),3,0:beep:pause 200:locate 1,15:print "                                    ":locate 1,15:print "4.トップ画面に戻るを選択":goto Kabara_TopScreen2:
38480 case 3:
38490 No=0:sp_on 0,1:sp_on 2,0:sp_on 1,0:sp_on 3,0:sp_put 0,(X,Y+20),0,0:beep:pause 200: locate 1,15:print"                                      ":locate 1,15:print "1.数秘術占いを選択":goto Kabara_TopScreen2:
38500 case 0:
38510 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(X,Y+120),1,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.バーズアイグリッドを選択":goto Kabara_TopScreen2:
38520 case 1:
38530 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:sp_on 3,0:sp_put 2,(X,Y+220),2,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print"3.相性占いを選択":goto Kabara_TopScreen2:
38540 end select
38550 endif
38560 'カーソル　上  or  ジョイパッド　上
38570 if ((y = -1) or (key$ = chr$(30))) then
38580 select case No
38590 case 0:
38600 No=3:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,1:sp_put 3,(X,Y+320),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "4.トップ画面に戻るを選択":goto Kabara_TopScreen2:
38610 case 1:
38620 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(X,Y+20),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.数秘術占いを選択":goto Kabara_TopScreen2:
38630 case 2:
38640 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(X,,Y+120),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.バーズアイグリッドを選択":goto Kabara_TopScreen2:
38650 case 3:
38660 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(X,Y+220),0,0:beep:pause 200:locate 1,15:print "                                       ":locate 1,15:print"3.相性占いを選択":goto Kabara_TopScreen2:
38670 end select
38680 endif
38690 '******************************************************************************************************
38700 '日本語 ここまで
38710 '******************************************************************************************************
38720 endif
38730 '******************************************************************************************************
38740 '1920x 1280 ここまで
38750 '******************************************************************************************************
38760 endif
38770 '決定ボタン
38780 'ジョイパッドの右　or  Enter key
38790 if ((bg = 2) or (key$ = chr$(13))) then
38800 select case No
38810 case 0:
38820 '1.数秘術占い
38830 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:goto Input_Seireki:
38840 case 3:
38850 '4.メイン画面にいく
38860 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_on 1,0:pause 200:goto Main_Screen:
38870 case 1:
38880 '2.バースアイグリッド
38890 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:goto Input_name1_Birdseye:
38900 case 2:
38910 '3.相性占い
38920 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:goto Kabara_Aishou_Top:
38930 end select
38940 endif
38950 if (bg2 = 2) then
38960 play "":pause 200
38970 play Voice$ + "Voice_Kabara_Top_20230621.mp3"
38980 goto Kabara_TopScreen2:
38990 endif
39000 '1.バースアイグリット　名入力
39010 Inputname1:
39020 cls 3:init"kb:4":
39030 '****************************************************************************************************
39040 'WUXG(1920x1200)の時ここから
39050 '****************************************************************************************************
39060 font FONT
39070 bg=0:key$="":y=0:No=-1:name1$="":i=1
39080 gload Gazo$ + "Selection.png",1,10,100
39090 'Line 1:☓
39100 'A:選択肢
39110 sp_def 15,(50,250),16,16
39120 'B:選択肢
39130 sp_def 16,(200,250),16,16
39140 'C:選択肢
39150 sp_def 17,(350,250),16,16
39160 'D:選択肢
39170 sp_def 18,(500,250),16,16
39180 'E:選択肢
39190 sp_def 19,(630,250),16,16
39200 'F:選択肢
39210 sp_def 20,(780,250),16,16
39220 'G:選択肢
39230 sp_def 21,(930,250),16,16
39240 'Line 2:☓
39250 'H:選択肢
39260 sp_def 22,(50,345),16,16
39270 'I:選択肢
39280 sp_def 23,(200,345),16,16
39290 'J:選択肢
39300 sp_def 24,(350,345),16,16
39310 'K:選択肢
39320 sp_def 25,(500,345),16,16
39330 'L:選択肢
39340 sp_def 26,(630,345),16,16
39350 'M:選択肢
39360 sp_def 27,(780,345),16,16
39370 'N:選択肢
39380 sp_def 28,(930,345),16,16
39390 'Line 3:☓
39400 'O:選択肢
39410 sp_def 29,(50,440),16,16
39420 'P:選択肢
39430 sp_def 30,(200,440),16,16
39440 'Q:選択肢
39450 sp_def 31,(350,440),16,16
39460 'R:選択肢
39470 sp_def 32,(500,440),16,16
39480 'S:選択肢
39490 sp_def 33,(630,440),16,16
39500 'T:選択肢
39510 sp_def 34,(780,440),16,16
39520 'U:選択肢
39530 sp_def 35,(930,440),16,16
39540 'Line 4:◯
39550 'V:選択肢
39560 sp_def 36,(50,535),16,16
39570 'W:選択肢
39580 sp_def 37,(200,535),16,16
39590 'X:選択肢
39600 sp_def 38,(350,535),16,16
39610 'Y:選択肢
39620 sp_def 39,(500,535),16,16
39630 'Z:選択肢
39640 sp_def 40,(630,535),16,16
39650 'Ok:選択肢
39660 sp_def 41,(780,535),16,16
39670 'sp_def 42,(930,535),16,16
39680 'Line 1
39690 'A
39700 sp_on 15,0
39710 'B
39720 sp_on 16,0
39730 'C
39740 sp_on 17,0
39750 'D
39760 sp_on 18,0
39770 'E
39780 sp_on 19,0
39790 'F
39800 sp_on 20,0
39810 'G
39820 sp_on 21,0
39830 'Line 1
39840 'Line 2
39850 'H
39860 sp_on 22,0
39870 'I
39880 sp_on 23,0
39890 'J
39900 sp_on 24,0
39910 'K
39920 sp_on 25,0
39930 'L
39940 sp_on 26,0
39950 'M
39960 sp_on 27,0
39970 'N
39980 sp_on 28,0
39990 'Line 2
40000 'Line 3
40010 'O
40020 sp_on 29,0
40030 'P
40040 sp_on 30,0
40050 'Q
40060 sp_on 31,0
40070 'R
40080 sp_on 32,0
40090 'S
40100 sp_on 33,0
40110 'T
40120 sp_on 34,0
40130 'U
40140 sp_on 35,0
40150 'Line 3
40160 'Line 4
40170 'V
40180 sp_on 36,0
40190 'W
40200 sp_on 37,0
40210 'X
40220 sp_on 38,0
40230 'Y
40240 sp_on 39,0
40250 'Z
40260 sp_on 40,0
40270 'Ok
40280 sp_on 41,1
40290 '****************************************************************************************************
40300 'WUXG(1920x1200)の時ここまで
40310 '****************************************************************************************************
40320 'Line 4
40330 'sp_on 42,1
40340 'Line 1
40350 'sp_put 15,(50,250),0,0
40360 'sp_put 16,(200,250),0,0
40370 'sp_put 17,(350,250),0,0
40380 'sp_put 18,(500,250),0,0
40390 'sp_put 19,(630,250),0,0
40400 'sp_put 20,(780,250),0,0
40410 'sp_put 21,(930,250),0,0
40420 'Line 2
40430 'sp_put 22,(50,345),0,0
40440 'sp_put 23,(200,345),0,0
40450 'sp_put 24,(350,345),0,0
40460 'sp_put 25,(500,345),0,0
40470 'sp_put 26,(630,345),0,0
40480 'sp_put 27,(780,345),0,0
40490 'sp_put 28,(930,345),0,0
40500 'Line 3
40510 'sp_put 29,(50,440),0,0
40520 'sp_put 30,(200,440),0,0
40530 'sp_put 31,(350,440),0,0
40540 'sp_put 32,(500,440),0,0
40550 'sp_put 33,(630,440),0,0
40560 'sp_put 34,(780,440),0,0
40570 'sp_put 35,(930,440),0,0
40580 'Line 4
40590 'sp_put 36,(50,535),0,0
40600 'sp_put 37,(200,535),0,0
40610 'sp_put 38,(350,535),0,0
40620 'sp_put 39,(500,535),0,0
40630 'sp_put 40,(630,535),0,0
40640 sp_put 41,(780,535),0,0
40650 'sp_put 42,(930,536),0,0
40660 gload Gazo$ + "Screen1.png",0,0,0
40670 color rgb(255,255,255)
40680 locate 1,3
40690 print "名前の姓をアルファベットで入力してください"
40700 locate 1,5
40710 print " A  B  C  D  E  F  G"
40720 locate 1,7
40730 print " H  I  J  K  L  M  N"
40740 locate 1,9
40750 print " O  P  Q  R  S  T  U"
40760 locate 1,11
40770 print " V  W  X  Y  Z":locate 17,11:color rgb(255,0,0):print "Ok"
40780 locate 1,15:color rgb(0,0,0)
40790 print "名前の姓:" + name1$
40800 select_name1:
40810 bg = 0:y = 0:key$ = "":y2=0:init"kb:4":
40820 '有効ボタン
40830 '1.決定ボタン(bg:2)
40840 '2.Enter Key$:chr$(13)
40850 '3.カーソル上 (chr$(31))
40860 '4.カーソル　左 (chr$(29))
40870 '5.ジョイパッド　上 (y:1)
40880 '6:ジョイパッド　左 (y2:-1)
40890 '7:ジョイパッド　下 (y:-1)
40900 while ((bg <> 2) and (key$ <> chr$(13)) and (y <> -1) and (y <> 1) and (key$ <> chr$(31)) and (y2 <> -1) and (key$ <> chr$(29)))
40910 key$ = inkey$
40920 'ジョイパッドの決定:bg
40930 bg = strig(1)
40940 y = stick(1)
40950 y2 = stick(0)
40960 pause 200
40970 wend
40980 '====================================
40990 'Birds Eye Grid 名前入力
41000 '入力スタイル　アルファベット入力
41010 'sp_on:　スプライトのオンオフ
41020 'sp_put :表示位置
41030 'No:ボタン番号
41040 '====================================
41050 'カーソルで下に行く
41060 if ((y=-1) or (key$=chr$(31))) then
41070 select case No
41080 '1.Ok ボタン
41090 'sp_on スプライトのオンオフ
41100 'sp_put スプライトを表示
41110 case -1:
41120 '1.アルファベット　入力ボタン
41130 '実装未完全なので終了
41140 'Ok → T ○ :No:20=T
41150 No=20:sp_on 41,0:sp_on 34,1:sp_put 34,(780,440),0,0:goto select_name1:
41160 'T  → M ○
41170 case 20:
41180 No = 13:sp_on 34,0:sp_on 27,1:sp_put 27,(780,345),0,0:goto select_name1:
41190 'M  →　F ○
41200 case 13:
41210 No = 6:sp_on 27,0:sp_on 20,1:sp_put 20,(780,250),0,0:goto select_name1:
41220 'F  → Ok
41230 case 6:
41240 No=-1:sp_on 20,0:sp_on 41,1:sp_put 41,(780,535),0,0:goto select_name1:
41250 end select
41260 endif
41270 '2.決定ボタン
41280 if ((key$ = chr$(13)) OR  (bg = 2)) then
41290 select case No
41300 case -1:
41310 'スプライトをOFFにする
41320 sp_on 41,0
41330 end select
41340 endif
41350 '3.カーソル　左
41360 if (key$ = chr$(29) or (y2 =-1)) then
41370 select case No
41380 'Line 4
41390 'Line 4
41400 '1.
41410 'Z:-1 :Ok ボタン
41420 'Ok → Z
41430 case -1:
41440 'Ok →　Z
41450 'Ok ボタン OFF,Z Button ON
41460 'No=26:Z
41470 No = 26:sp_on 41,0:sp_on 40,1:sp_put 40,(630,535),0,0:goto select_name1:
41480 '2.
41490 '26:Zボタン Z→ Y
41500 case 26:
41510 No=25:sp_on 40,0:sp_on 39,1:sp_put 39,(500,535),0,0:goto select_name1:
41520 '3.
41530 '25:Yボタン  Y → X
41540 case 25:
41550 No=24:sp_on 39,0:sp_on 38,1:sp_put 38,(350,535),0,0:goto select_name1:
41560 '4
41570 '24:Xボタン X → W
41580 case 24:
41590 No=23:sp_on 38,0:sp_on 37,1:sp_put 37,(200,535),0,0:goto select_name1:
41600 '23:Wボタン X → W
41610 '5
41620 case 23:
41630 '22:Vボタン W → V
41640 No=22:sp_on 37,0:sp_on 36,1:sp_put 36,(50,535),0,0:goto select_name1:
41650 case 22:
41660 '-1:V→ Ok
41670 No=-1:sp_on 36,0:sp_on 41,1:sp_put 41,(780,535),0,0:goto select_name1:
41680 'Line 3
41690 case 20:
41700 '33:T34  → S:33 :◯
41710 No=19:sp_on 34,0:sp_on 33,1:sp_put 33,(630,440),0,0:goto select_name1:
41720 case 19:
41730 '32:S:33 → R:32 :◯
41740 No=18:sp_on 33,0:sp_on 32,1:sp_put 32,(500,440),0,0:goto select_name1:
41750 case 18:
41760 '31:R:32 → Q:31 :◯
41770 No=17:sp_on 32,0:sp_on 31,1:sp_put 31,(350,440),0,0:goto select_name1:
41780 '30:O → P :◯
41790 case 17:
41800 '30:Q:31 → P:30 :◯
41810 No=16:sp_on 31,0:sp_on 30,1:sp_put 30,(200,440),0,0:goto select_name1:
41820 case 16:
41830 '29:P:30 → O:29 :◯
41840 No=15:sp_on 30,0:sp_on 29,1:sp_put 29,(50,440),0,0:goto select_name1:
41850 case 15:
41860 '28:O:29 → U:21  :◯
41870 'O:OFF,U:ON
41880 No=21:sp_on 29,0:sp_on 35,1:sp_put 35,(930,440),0,0:goto select_name1:
41890 '27:U:21 → T:20  :◯
41900 case 21:
41910 'U:OFF:T:ON
41920 No=20:sp_on 35,0:sp_on  34,1:sp_put 34,(780,440),0,0:goto select_name1:
41930 'Line 2
41940 '26:M:13 → L:12 : ○
41950 case 13:
41960 'M:OFF,L:ON
41970 No=12:sp_on 27,0:sp_on 26,1:sp_put 26,(630,345),0,0:goto select_name1:
41980 '25:L:12 → K:11 : ○
41990 case 12:
42000 No=11:sp_on 26,0:sp_on 25,1:sp_put 25,(500,345),0,0:goto select_name1:
42010 '24:K:11 → J:10 : ○
42020 case 11:
42030 No=10:sp_on 25,0:sp_on 24,1:sp_put 24,(350,345),0,0:goto select_name1:
42040 '23:J:10 → I:9  : ○
42050 case 10:
42060 No=9:sp_on 24,0:sp_on 23,1:sp_put 23,(200,345),0,0:goto select_name1:
42070 '22:I:9 → H:8    :○
42080 case 9:
42090 No=8:sp_on 23,0:sp_on 22,1:sp_put 22,(50,345),0,0:goto select_name1:
42100 '21:H:8 → N:14:   :○
42110 case 8:
42120 No=14:sp_on 22,0:sp_on 28,1:sp_put 28,(930,345),0,0:goto select_name1:
42130 '20:N:14 → M:13:   :○
42140 case 14:
42150 No=6:sp_on 28,0:sp_on 27,1:sp_put 27,(780,345),0,0:goto select_name1:
42160 '●.Line 1:
42170 '19:F:20 → E:19 : ☓
42180 'F:OFF,E:ON
42190 case 6:
42200 No = 5:sp_on 20,0:sp_on 19,1:sp_put 19,(630,250),0,0:goto select_name1:
42210 '18:E → D
42220 'E:OFF,D:ON
42230 case 5:
42240 No=4:sp_on 19,0:sp_on 18,1:sp_put 18,(500,250),0,0:goto select_name1:
42250 '17:D → C
42260 'D:OFF,C:ON
42270 case 4:
42280 No=3:sp_on 18,0:sp_on 17,1:sp_put 17,(350,250),0,0:goto select_name1:
42290 case 3:
42300 No=2:sp_on 17,0:sp_on 16,1:sp_put 16,(200,250),0,0:goto select_name1:
42310 case 2:
42320 No=1:sp_on 16,0:sp_on 15,1:sp_put 15,(50,250),0,0:goto select_name1:
42330 case 1:
42340 No=7:sp_on 15,0:sp_on 21,1:sp_put 21,(930,250),0,0:goto select_name1:
42350 case 7:
42360 No=6:sp_on 21,0:sp_on 20,1:sp_put 20,(780,250),0,0:goto select_name1:
42370 end select
42380 endif
42390 '上から下の方向
42400 if ((key$ = chr$(31)) or  (y = 1)) then
42410 select case No
42420 '●.1
42430 '1:A→H
42440 case 1:
42450 No=8:sp_on 15,0:sp_on 22,1:sp_put 22,(50,345),0,0:goto select_name1:
42460 '2:H→O
42470 case 8:
42480 No=15:sp_on 22,0:sp_on 29,1:sp_put 29,(50,440),0,0:goto select_name1:
42490 '3:O→V
42500 case 15:
42510 No=22:sp_on 29,0:sp_on 36,1:sp_put 36,(50,535),0,0:goto select_name1:
42520 '4:V→A
42530 case 22:
42540 No=1:sp_on 36,0:sp_on 15,1:sp_put 15,(50,250),0,0:goto select_name1:
42550 '●.2
42560 '5.B→I
42570 case 2:
42580 No=9:sp_on 16,0:sp_on 23,1:sp_put 23,(200,345),0,0:goto select_name1:
42590 '6.I→P
42600 case 9:
42610 No=16:sp_on 23,0:sp_on 30,1:sp_put 30,(200,440),0,0:goto select_name1:
42620 '7.P→W
42630 case 16:
42640 No=23:sp_on 30,0:sp_on 37,1:sp_put 37,(200,535),0,0:goto select_name1:
42650 '8.W→B
42660 case 23:
42670 No=2:sp_on 37,0:sp_on 16,1:sp_put 16,(200,250),0,0:goto select_name1:
42680 '●.3
42690 '9.C→J
42700 case 3:
42710 No=10:sp_on 17,0:sp_on 24,1:Sp_put 24,(350,345),0,0:goto select_name1:
42720 '10.J→Q
42730 case 10:
42740 No=17:sp_on 24,0:sp_on 31,1:sp_put 31,(350,440),0,0:goto select_name1:
42750 '11.Q→X
42760 case 17:
42770 No=24:sp_on 31,0:sp_on 38,1:sp_put 38,(350,535),0,0:goto select_name1:
42780 '12.X→C
42790 case 24:
42800 No=3:sp_on 38,0:sp_on 17,1:sp_put 17,(350,250),0,0:goto select_name1:
42810 '●.4
42820 '13.D→K
42830 case 4:
42840 No=11:sp_on 18,0:sp_on 25,1:sp_put 25,(500,345),0,0:goto select_name1:
42850 '14.K→R
42860 case 11:
42870 No=18:sp_on 25,0:sp_on 32,1:sp_put 32,(500,440),0,0:goto select_name1:
42880 '15.R→Y
42890 case 18:
42900 No=25:sp_on 32,0:sp_on 39,1:sp_put 39,(500,535),0,0:goto select_name1:
42910 '16.Y→D
42920 case 25:
42930 No=4:sp_on 39,0:sp_on 18,1:sp_put 18,(500,250),0,0:goto select_name1:
42940 '●.5
42950 '17.E→L
42960 case 5:
42970 No=12:sp_on 19,0:sp_on 26,1:sp_put 26,(630,345),0,0:goto select_name1:
42980 '18.L→S
42990 case 12:
43000 No=19:sp_on 26,0:sp_on 33,1:sp_put 33,(630,440),0,0:goto select_name1:
43010 '19.S→Z
43020 case 19:
43030 No=26:sp_on 33,0:sp_on 40,1:sp_put 40,(630,535),0,0:goto select_name1:
43040 '20.Z→E
43050 case 26:
43060 No=5:sp_on 40,0:sp_on 19,1:sp_put 19,(630,250),0,0:goto select_name1:
43070 '●.6
43080 '21.F→M
43090 case 6:
43100 No=13:sp_on 20,0:sp_on 27,1:sp_put 27,(780,345),0,0:goto select_name1:
43110 '22.M→T
43120 case 13:
43130 No=20:sp_on 27,0:sp_on 34,1:sp_put 34,(780,440),0,0:goto select_name1:
43140 '23.T→Ok
43150 case 20:
43160 No=-1:sp_on 34,0:sp_on 41,1:sp_PUT 41,(780,535),0,0:goto select_name1:
43170 '24.Ok→F
43180 case -1:
43190 No=6:sp_on 41,0:sp_on 20,1:sp_put 20,(780,250),0,0:goto select_name1:
43200 '●.7
43210 '25.G→N
43220 case 7:
43230 No=14:sp_on 21,0:sp_on 28,1:sp_put 28,(930,345),0,0:goto select_name1:
43240 '26.N→U
43250 case 14:
43260 No=21:sp_on 28,0:sp_on 35,1:sp_PUT 35,(930,440),0,0:goto select_name1:
43270 '27.U→G
43280 case 21:
43290 No=7:sp_on 35,0:sp_on 21,1:sp_put 21,(930,250),0,0:goto select_name1:
43300 end select
43310 endif
43320 '決定ボタン　で名前の姓に文字を追加。
43330 if (key$ = chr$(13) or bg = 2) then
43340 select case No
43350 'Okボタン
43360 case -1:
43370 goto Inputname2:
43380 'Aの文字
43390 case 1:
43400 'if len(n$)=0 then
43410 n$=String$(i,"A"):name1$=n$:locate 1,15:print "                       ":locate 1,15:print "名前の姓:" +name1$:i=i+1:
43420 'else
43430 'name1$=Mid$("A",i,i+1):locate 1,15:print "                                      ":locate 1,15:print "名前の姓:"+name1$:i=i+1
43440 'endif
43450 goto select_name1:
43460 case 2:
43470 n$=String$(i,"B"):name1$=n$:locate 1,15:print "                                     ":locate 1,15:print "名前の姓:"+name1$:i=i+1:goto select_name1:
43480 end select
43490 endif
43500 Input_name1_Birdseye:
43510 cls 3:init "kb:2":play "":font 48
43520 gload Gazo$ + "Input_Birtheye2.png",0,0,0
43530 if ex_info$(1)<>"JP" then
43540 play Voice$ + "Birdseyegrid_InputName1_20231120.mp3"
43550 color rgb(0,0,255)
43560 locate 1,2:print "Please enter your name in English"
43570 color rgb(0,0,0)
43580 locate 1,5:Input "Name (Surname):",name1$
43590 else
43600 '****************************************************************************************************
43610 '共通部分　ここから
43620 '****************************************************************************************************
43630 play Voice$ + "Birdseyegrid_InputName1_20231120.mp3"
43640 color rgb(0,0,255)
43650 locate 1,2:print "名前をアルファベットで入れてください"
43660 color rgb(0,0,0)
43670 locate 1,5:Input "名前（姓の部分）:",name1$
43680 '****************************************************************************************************
43690 '共通部分　ここまで
43700 '****************************************************************************************************
43710 endif
43720 '27.U→G
43730 'locate 1,5:print "Hit any key"
43740 n1 = len(name1$)
43750 if (n1 < 11) then
43760 for i=1 to n1
43770 buf_name1$(i-1) = Mid$(ucase$(name1$),i,1)
43780 next i
43790 endif
43800 goto Inputname2:
43810 '2.グリッドアイ　姓の入力
43820 'end
43830 Inputname2:
43840 cls 3:init"kb:2":font 48:play ""
43850 gload Gazo$ + "Input_Birtheye1.png",0,0,0
43860 if ex_info$(1)<>"JP" then
43870 play Voice$ + "Birdseyegrid_InputName2_20231120.mp3"
43880 color rgb(0,0,255)
43890 locate 1,2:print "Please enter your name in English"
43900 color rgb(0,0,0)
43910 locate 1,5:Input "Name (First name):",name2$
43920 n2 = len(name2$)
43930 for i=1 to n2
43940 buf_name2$(i-1) = Mid$(ucase$(name2$),i,1)
43950 next i
43960 else
43970 '****************************************************************************************************
43980 '共通部分　ここから
43990 '****************************************************************************************************
44000 play Voice$ + "Birdseyegrid_InputName2_20231120.mp3"
44010 color rgb(0,0,255)
44020 locate 1,2:print "名前をアルファベットで入れてください"
44030 color rgb(0,0,0)
44040 locate 1,5:Input "名前(名の部分):",name2$
44050 n2 = len(name2$)
44060 for i=1 to n2
44070 buf_name2$(i-1) = Mid$(ucase$(name2$),i,1)
44080 next i
44090 '****************************************************************************************************
44100 '共通部分　ここまで
44110 '****************************************************************************************************
44120 endif
44130 '****************************************************************************************************
44140 '計算領域　ここから
44150 '****************************************************************************************************
44160 Complate:
44170 'name1
44180 for i=0 to 25
44190 for n=1 to len(name1$)
44200 if (buf_chart$(i,0) = buf_name1$(n-1)) then
44210 b = val(buf_chart$(i,1))
44220 buffer(b-1) = buffer(b-1) + 1
44230 endif
44240 next n
44250 next i
44260 'name2
44270 for i=0 to 25
44280 for n=1 to len(name2$)
44290 if (buf_chart$(i,0) = buf_name2$(n-1)) then
44300 c = val(buf_chart$(i,1))
44310 buffer(c - 1) = buffer(c - 1) + 1
44320 endif
44330 next n
44340 next i
44350 '****************************************************************************************************
44360 '計算領域 ここまで
44370 '****************************************************************************************************
44380 '****************************************************************************************************
44390 '結果表示領域
44400 '****************************************************************************************************
44410 Result_Birtheye1:
44420 cls 3:init"kb:4":No=0:play "": '音を止める
44430 '****************************************************************************************************
44440 '1280x800　ここから
44450 '****************************************************************************************************
44460 if ((size(0) <= 1280) and (size(1) <= 800)) then
44470 gload Gazo$ + Gazo_WXGA$ + "Result_Birtheye1_907x640_20240223.png",0,0,0
44480 '****************************************************************************************************
44490 '1280x800　ここまで
44500 '****************************************************************************************************
44510 else
44520 '****************************************************************************************************
44530 '1920x1280　ここから
44540 '****************************************************************************************************
44550 gload Gazo$ + "Result_Birtheye1_20230630.png",0,0,0
44560 gload Gazo$ + "downscreen.png",0,0,800
44570 '****************************************************************************************************
44580 '1920x1280　ここまで
44590 '****************************************************************************************************
44600 endif
44610 play Voice$ + "Result_Birdseyegrid_20231120.mp3"
44620 color rgb(255,255,255):font FONT
44630 '****************************************************************************************************
44640 '1280x800　ここから
44650 '****************************************************************************************************
44660 if ((size(0) <= 1280) and (size(1) <= 800)) then
44670 'font FONT
44680 '1の表示
44690 locate 5,18
44700 print "3"      'print buffer(0)
44710 '2の表示
44720 locate 4,10
44730 print buffer(1)
44740 '3の表示
44750 locate 4,6
44760 print buffer(2)
44770 '4の表示
44780 'locate 8,13
44790 'print buffer(3)
44800 '5の表示
44810 'locate 8,7
44820 'print buffer(4)
44830 '6の表示
44840 'locate 8,3
44850 'print buffer(5)
44860 '7の表示
44870 'locate 11,13
44880 'print buffer(6)
44890 '8の表示
44900 'locate 11,7
44910 'print buffer(7)
44920 '9の表示
44930 'locate 11,3
44940 'print buffer(8)
44950 '****************************************************************************************************
44960 '1280x800　ここまで
44970 '****************************************************************************************************
44980 else
44990 'font FONT
45000 '1の表示
45010 locate 3,14:print buffer(0);
45020 '2の表示
45030 locate 3,9:print buffer(1);
45040 '3の表示
45050 locate 3,5:print buffer(2);
45060 '4の表示
45070 locate 10,14:print buffer(3);
45080 '5の表示
45090 locate 10,9:print buffer(4);
45100 '6の表示
45110 locate 10,5:print buffer(5);
45120 '7の表示
45130 locate 15,14:print buffer(6);
45140 '8の表示
45150 locate 15,9:print buffer(7);
45160 '9の表示
45170 locate 15,5:print buffer(8);
45180 endif
45190 'name を大文字に変換
45200 if ((size(0) <= 1280) and (size(1) <= 800)) then
45210 else
45220 'name を大文字に変換
45230 font FONT:color rgb(0,0,0)
45240 locate 5,3:print ucase$(name1$ + name2$) 'NG
45250 endif
45260 'color rgb(0,0,0)
45270 'bg:右のボタン  ,bg2:左のボタン
45280 if ex_info$(1) <> "JP" then
45290 color rgb(255,255,255)
45300 'print "Left circle: Main Screen, Right circle: Open Menu"
45310 else
45320 if ((size(0) <= 1280) and (size(1) <= 800)) then
45330 font FONT
45340 'locate 0,15:print "左の丸:メイン画面,右の丸：メニューを開く"
45350 else
45360 font FONT
45370 color rgb(0,0,0)
45380 locate 0,15:print "右の丸:次へ,左の丸：もう一度診断 "
45390 endif
45400 endif
45410 bg=0:key$="":bg2=0
45420 while ((bg <> 2) and (key$ <> chr$(13)) and (bg2 <> 2))
45430 'Enterと決定ボタン
45440 key$ = inkey$
45450 '右ボタン:1
45460 bg = strig(1)
45470 '左の丸ボタン:0
45480 bg2=strig(0)
45490 pause 200
45500 wend
45510 if ((bg=2) or (key$=chr$(13))) then
45520 'データーをクリアしてトップ画面に行く
45530 'for i=0 to 8
45540 'buffer(i)=0
45550 'next i
45560 'for n=0 to 9
45570 'buf_name1$(n) = ""
45580 'buf_name2$(n) = ""
45590 'next n
45600 'Topに行く
45610 'goto Main_Screen:
45620 'メニューを開く
45630 'goto BirdsEye_Result2:
45640 'Menu(ui_select) リストに飛ぶ
45650 goto Result_Birtheye_List1:
45660 endif
45670 if ((bg2=2) or (key$="")) then
45680 'データーをクリアする
45690 for i=0 to 8
45700 buffer(i)=0
45710 next i
45720 for n=0 to 9
45730 buf_name1$(n)=""
45740 buf_name2$(n)=""
45750 next n
45760 goto Main_Screen:
45770 endif
45780 'goto Result_Birtheye1:
45790 'Result_Birtheye2:
45800 'cls 3:color rgb(255,255,255)
45810 'end
45820 'Memory 消去
45830 '****************************************************************************************************
45840 '
45850 '結果表示領域　ここまで
45860 '****************************************************************************************************
45870 '横のフォーカスライン
45880 BirdsEye_Result2:
45890 cls 3:init"kb:4":No = 0:bg = 0:key$ = "":bg2 = 0
45900 if ((buffer(2) > 0) and (buffer(5) > 0) and  (buffer(8) >  0)) then
45910 Forcus1_buffer$(2)="○"
45920 else
45930 Forcus1_buffer$(2)="☓"
45940 endif
45950 if ((buffer(1) > 0 ) and  (buffer(4) > 0) and   (buffer(7) > 0)) then
45960 Forcus1_buffer$(1)="○"
45970 else
45980 Forcus1_buffer$(1) = "☓"
45990 endif
46000 if ((buffer(0) > 0) and (buffer(3) > 0) and (buffer(6) > 0)) then
46010 Forcus1_buffer$(0)="○"
46020 else
46030 Forcus1_buffer$(0)="☓"
46040 endif
46050 gload Gazo$ + "Screen1.png",0,0,0
46060 if ex_info$(1)<>"JP" then
46070 color rgb(255,0,0):
46080 locate 1,1
46090 print "Bird's Eye Grid (Focus Line 1)"
46100 color rgb(255,255,255)
46110 locate 1,3:
46120 print "●. Horizontal Focus Line"
46130 locate 1,5
46140 print "1. Sharp Line:"+Forcus1_buffer$(2)
46150 locate 1,7
46160 print "2. Mediator Line:"+Forcus1_buffer$(1)
46170 locate 1,9
46180 print "3. Steady Line:"+Forcus1_buffer$(0)
46190 color rgb(0,0,0)
46200 locate 0,15:print "Right circle: Next, Left circle: Diagnose again "
46210 else
46220 color rgb(255,0,0):
46230 locate 1,1
46240 print "バーズアイグリッド(フォーカスライン1)"
46250 color rgb(255,255,255)
46260 locate 1,3:
46270 print "●.横のフォーカスライン"
46280 locate 1,5
46290 print "1.切れ者ライン:"+Forcus1_buffer$(2)
46300 locate 1,7
46310 print "2.調停者ライン:"+Forcus1_buffer$(1)
46320 locate 1,9
46330 print "3.しっかり者ライン:"+Forcus1_buffer$(0)
46340 color rgb(0,0,0)
46350 locate 0,15:print "右の丸:次へ,左の丸：もう一度診断 "
46360 endif
46370 while (key$ <> chr$(13) and bg <> 2 and bg2 <> 2 )
46380 key$ = inkey$
46390 bg = strig(1)
46400 bg2 = strig(0)
46410 pause 200
46420 wend
46430 if ((bg=2) or (key$=chr$(13))) then
46440 goto BirdsEye_Result3:
46450 endif
46460 if (bg2=2) then
46470 for i=0 to 8
46480 buffer(i)=0
46490 next i
46500 goto Main_Screen:
46510 endif
46520 BirdsEye_Result3:
46530 cls 3:init"kb:4":bg=0:bg2=0:key$="":No=0
46540 if ((buffer(2) > 0) and (buffer(1) > 0) and  (buffer(0) >  0)) then
46550 Forcus2_buffer$(2)="○"
46560 else
46570 Forcus2_buffer$(2)="☓"
46580 endif
46590 if ((buffer(5) > 0 ) and  (buffer(4) > 0) and   (buffer(3) > 0)) then
46600 Forcus2_buffer$(1)="○"
46610 else
46620 Forcus2_buffer$(1) = "☓"
46630 endif
46640 if ((buffer(8) > 0) and (buffer(7) > 0) and (buffer(6) > 0)) then
46650 Forcus2_buffer$(0)="○"
46660 else
46670 Forcus2_buffer$(0)="☓"
46680 endif
46690 gload Gazo$ + "Screen1.png",0,0,0
46700 if ex_info$(1)<>"JP" then
46710 color rgb(255,0,0):
46720 locate 1,1
46730 print "Bird's Eye Grid (Focus Line 2)"
46740 color rgb(255,255,255)
46750 locate 1,3
46760 print "●. Vertical Focus Line"
46770 locate 1,5
46780 print "1. Expresser Line:" + Forcus2_buffer$(2)
46790 locate 1,7
46800 print "2. Commander Line:" + Forcus2_buffer$(1)
46810 locate 1,9
46820 print "3. Leader Line:" + Forcus2_buffer$(0)
46830 color rgb(0,0,0)
46840 locate 0,15:print "Right circle: Next, Left circle: Retest "
46850 else
46860 '****************************************************************************************************
46870 'WUXG(1920x1200)の時ここから
46880 '****************************************************************************************************
46890 color rgb(255,0,0):
46900 locate 1,1
46910 print "バーズアイグリッド(フォーカスライン2)"
46920 color rgb(255,255,255)
46930 locate 1,3
46940 print "●.縦のフォーカスライン"
46950 locate 1,5
46960 print "1.表現者ライン:" + Forcus2_buffer$(2)
46970 locate 1,7
46980 print "2.司令塔ライン:" + Forcus2_buffer$(1)
46990 locate 1,9
47000 print "3.指導者ライン:" + Forcus2_buffer$(0)
47010 color rgb(0,0,0)
47020 locate 0,15:print "右の丸:次へ,左の丸：もう一度診断 "
47030 '****************************************************************************************************
47040 'WUXG(1920x1200)の時ここから
47050 '****************************************************************************************************
47060 endif
47070 while ((key$ <> chr$(13)) and (bg <> 2) and (bg2 <> 2))
47080 key$ = inkey$
47090 bg = strig(1)
47100 bg2 = strig(0)
47110 pause 200
47120 wend
47130 if ((bg = 2) or (key$ = chr$(13))) then
47140 goto BirdsEye_Result4:
47150 endif
47160 if (bg2=2) then
47170 for i=0 to 8
47180 buffer(i)=0
47190 next i
47200 goto Main_Screen:
47210 endif
47220 BirdsEye_Result4:
47230 cls 3:init"kb:4":bg=0:bg2=0:key$="":No=0
47240 if ((buffer(0) > 0) and (buffer(4) > 0) and  (buffer(8) >  0)) then
47250 Forcus3_buffer$(1) = "○"
47260 else
47270 Forcus3_buffer$(1) = "☓"
47280 endif
47290 if ((buffer(2) > 0 ) and  (buffer(4) > 0) and   (buffer(6) > 0)) then
47300 Forcus3_buffer$(0) = "○"
47310 else
47320 Forcus3_buffer$(0) = "☓"
47330 endif
47340 gload Gazo$ + "Screen1.png",0,0,0
47350 if ex_info$(1)<>"JP" then
47360 color rgb(255,0,0):
47370 locate 1,1
47380 print "Bird's Eye Grid (Focus Line 3)"
47390 color rgb(255,255,255)
47400 locate 1,3:
47410 print "●. Diagonal Focus Line"
47420 locate 1,5
47430 print "1. Success Line:"+Forcus3_buffer$(1)
47440 locate 1,7
47450 print "2. Celebrity Line:"+Forcus3_buffer$(0)
47460 color rgb(0,0,0)
47470 locate 0,15:print "Right circle: Top Menu, Left circle: Top Diagnosis"
47480 else
47490 '****************************************************************************************************
47500 'WUXG(1920x1200)の時ここから
47510 '****************************************************************************************************
47520 color rgb(255,0,0):
47530 locate 1,1
47540 print "バーズアイグリッド(フォーカスライン3)"
47550 color rgb(255,255,255)
47560 locate 1,3:
47570 print "●.斜めのフォーカスライン"
47580 locate 1,5
47590 print "1.成功者ライン:"+Forcus3_buffer$(1)
47600 locate 1,7
47610 print "2.セレブライン:"+Forcus3_buffer$(0)
47620 color rgb(0,0,0)
47630 locate 0,15:print "右の丸:トップメニュー,左の丸：診断トップ "
47640 '*************************************************************************************************
47650 'WUXG(1920x1200)の時ここまで
47660 '*************************************************************************************************
47670 endif
47680 while ((key$ <> chr$(13)) and (bg <> 2) and (bg2 <> 2))
47690 key$ = inkey$
47700 bg = strig(1)
47710 bg2 = strig(0)
47720 pause 200
47730 wend
47740 if ((bg=2) or (key$=chr$(13))) then
47750 goto Result_Birtheye1:
47760 endif
47770 if (bg2=2) then
47780 'データークリア
47790 for i=0 to 8
47800 buffer(i) = 0
47810 next i
47820 goto Main_Screen:
47830 endif
47840 References1:
47850 cls 3:key$ = "":bg = 0:play "":
47860 font 48-8
47870 if ((size(0) <= 1280) and (size(1) <= 800)) then
47880 gload Gazo$ + Gazo_WXGA$ +  "Reference1_864x640_20240219.png",0,0,0
47890 else
47900 gload Gazo$ + "Reference1_20230703.png",0,0,0
47910 gload Gazo$ + "downscreen.png",0,0,800
47920 endif
47930 if ex_info$(1)<>"JP" then
47940 print chr$(13)+chr$(13)+chr$(13)
47950 color rgb(0,0,255)
47960 print "・Title: 名前で運命のすべてがわかる　数秘術" + chr$(13)
47970 print "・Author: Carol Adrienne, Ph.D" + chr$(13)
47980 print "・Publisher: Gento-sha" + chr$(13)
47990 print "・Website: www.carolAdrienne.jp/" + chr$(13)
48000 print "・ISBN: 978-4-344-01394-0" + chr$(13)
48010 print "・Price: 1500 yen + tax" + chr$(13)
48020 color rgb(255,255,255)
48030 locate 1,18
48040 print "Right joystick: Next"
48050 else
48060 '****************************************************************************************************
48070 '(1200x800)の時ここから
48080 '****************************************************************************************************
48090 if ((size(0)<=1280) and (size(1)<=800)) then
48100 font FONT
48110 color rgb(0,0,255)
48120 locate 1,5:
48130 print "・Title:名前で運命のすべてがわかる　数秘術" + chr$(13)
48140 locate 1,7:
48150 print "・Author:carol Adrinne,PhD"+chr$(13)
48160 locate 1,9:
48170 print "・出版社:幻冬舎" + chr$(13)
48180 locate 1,11:
48190 print "・HP:www.carolAdrienne.jp/"+chr$(13)
48200 locate 1,13:
48210 print "・ISBN:978-4-344-01394-0"+chr$(13)
48220 locate 1,15
48230 print "・定価:1500円 + 税"+chr$(13)
48240 color rgb(255,255,255)
48250 locate 1,18
48260 print "ジョイパッド右：次へ"
48270 '****************************************************************************************************
48280 '(1200x800)の時ここまで
48290 '****************************************************************************************************
48300 else
48310 '****************************************************************************************************
48320 'WUXG(1920x1200)の時ここから
48330 '****************************************************************************************************
48340 font FONT
48350 print chr$(13)+chr$(13)+chr$(13)
48360 color rgb(0,0,255)
48370 print "・Title:名前で運命のすべてがわかる　数秘術" + chr$(13)
48380 print "・Author:carol Adrinne,PhD"+chr$(13)
48390 print "・出版社:幻冬舎" + chr$(13)
48400 print "・HP:www.carolAdrienne.jp/"+chr$(13)
48410 print "・ISBN:978-4-344-01394-0"+chr$(13)
48420 print "・定価:1500円 + 税"+chr$(13)
48430 color rgb(255,255,255)
48440 locate 1,18
48450 print "ジョイパッド右：次へ"
48460 '****************************************************************************************************
48470 'WUXG(1920x1200)の時ここまで
48480 '****************************************************************************************************
48490 endif
48500 endif
48510 while (key$ <> chr$(13) and bg <> 2)
48520 bg = strig(1)
48530 key$ = inkey$
48540 pause 200
48550 wend
48560 '
48570 if ((bg = 2) or (key$ = chr$(13))) then
48580 pause 200:goto References2:
48590 endif
48600 'ユダヤの秘儀 カバラ大占術
48610 References2:
48620 cls 3:play "":bg = 0:key$ = ""
48630 if ((size(0)<=1280) and (size(1)<=800)) then
48640 gload Gazo$ + Gazo_WXGA$ +  "Reference2_864x640_20240219.png",0,0,0
48650 else
48660 gload Gazo$ + "Reference2_20230703.png",0,0,0
48670 gload Gazo$ + "downscreen.png",0,0,800
48680 endif
48690 '参考文献２
48700 'カバラ大占術
48710 if ex_info$(1)<>"JP" then
48720 print chr$(13) + chr$(13) + chr$(13)
48730 color  rgb(0,0,255):font 48-8
48740 locate 1,3
48750 print "・Title: ユダヤの秘儀 大占術占術" + chr$(13)
48760 print "・Author: Hironari Asano" + chr$(13)
48770 print "・Publisher: NON BOOK" + chr$(13)
48780 print "・ISBN: 4-396-10364-6" + chr$(13)
48790 print "・Price: 829 yen + tax"
48800 color rgb(255,255,255)
48810 locate 1,18
48820 print "Right joystick: Return to top"
48830 else
48840 '****************************************************************************************************
48850 '(1200x800)の時 ここから
48860 '****************************************************************************************************
48870 if ((size(0)<=1280) and (size(1)<=800)) then
48880 font FONT
48890 color  rgb(0,0,255):
48900 locate 1,5:print "・Title:ユダヤの秘儀 大占術占術" + chr$(13)
48910 locate 1,7:print "・著者：浅野 八郎" + chr$(13)
48920 locate 1,9:print "・出版社:NON BOOK" + chr$(13)
48930 locate 1,11:print "・ISBN:4-396-10364-6" + chr$(13)
48940 locate 1,13:print "・定価:829円 + 税"
48950 color rgb(255,255,255)
48960 locate 1,18
48970 print "ジョイパッド右：トップへ行く"
48980 '****************************************************************************************************
48990 '(1200x800)の時 ここまで
49000 '****************************************************************************************************
49010 else
49020 '****************************************************************************************************
49030 'WUXG(1920x1200)の時ここから
49040 '****************************************************************************************************
49050 color  rgb(0,0,255):font FONT
49060 print chr$(13) + chr$(13) + chr$(13)
49070 locate 1,3
49080 print "・Title:ユダヤの秘儀 大占術占術" + chr$(13)
49090 print "・著者：浅野　八郎" + chr$(13)
49100 print "・出版社:NON BOOK" + chr$(13)
49110 print "・ISBN:4-396-10364-6" + chr$(13)
49120 print "・定価:829円 + 税"
49130 color rgb(255,255,255)
49140 locate 1,18
49150 print "ジョイパッド右：トップへ行く"
49160 '****************************************************************************************************
49170 'WUXG(1920x1200)の時ここまで
49180 '****************************************************************************************************
49190 endif
49200 endif
49210 while ((key$ <> chr$(13)) and (bg <> 2))
49220 bg = strig(1)
49230 key$ = inkey$
49240 pause 200
49250 wend
49260 if ((bg = 2) or (key$ = chr$(13))) then
49270 pause 200:goto Main_Screen:
49280 endif
49290 end
49300 '1.数秘術　トップ画面
49310 Kabara_First_Top:
49320 cls 3:color rgb(255,255,255):play ""
49330 gload Gazo$ + "Kabara_First_Top_20230710.png",0,0,0
49340 gload Gazo$ + "downscreen.png",0,0,800
49350 No=0:init"kb:4"
49360 Play Voice$ + "KabaraTop_Selection_20230721.mp3"
49370 if ex_info$(1)<>"JP" then
49380 print chr$(13);chr$(13)
49390 color rgb(255,255,255)
49400 locate 3,4:No=0
49410 print "Please select a number" + chr$(13)
49420 print " :1. Numerology" + chr$(13)
49430 print " :2. Return to the top screen" + chr$(13)
49440 color rgb(0,0,0)
49450 sp_on 0,1
49460 locate 1,15:print "1. Select Numerology"
49470 else
49480 '****************************************************************************************************
49490 'WUXG(1920x1200)の時ここから
49500 '****************************************************************************************************
49510 print chr$(13);chr$(13)
49520 color rgb(255,255,255)
49530 locate 3,4:No=0
49540 print "番号選んでください" + chr$(13)
49550 print " :1.数秘術占い" + chr$(13)
49560 print " :2.トップ画面に戻る" + chr$(13)
49570 color rgb(0,0,0)
49580 sp_on 0,1
49590 locate 1,15:print "1.数秘術番号を求めるを選択"
49600 '****************************************************************************************************
49610 'WUXG(1920x1200)の時ここまで
49620 '****************************************************************************************************
49630 endif
49640 'KeyBord:true
49650 'Joy Pad:true
49660 '上、下:true
49670 '
49680 'ｂｇ：決定ボタン
49690 'カーソル　上
49700 'カーソル　下
49710 Kabara_First_Top2:
49720 key$ = "":bg = 0:y = 0:
49730 while (((key$ <> chr$(13)) and (key$ <> chr$(30)) and (key$ <> chr$(31)) and (bg <> 2) and (y <> 1) and (y <> -1)))
49740 key$ = inkey$
49750 bg = strig(1)
49760 y = stick(1)
49770 'PauseでCPUを休める
49780 pause 5
49790 wend
49800 '1.カーソル　下 処理 chr$(31)
49810 'カーソル　下
49820 if ex_info$(1) <> "JP" then
49830 if ((key$ = chr$(31)) or (y = 1)) then
49840 select case No
49850 '
49860 case 1:
49870 No = 0:sp_on 0,1:sp_on 2,0:sp_on 3,0:sp_on 1,0:pause 200:locate 1,15:print "                                       ":locate 1,15:print "1. Select Numerology":goto Kabara_First_Top2:
49880 case 0:
49890 No=1:sp_on 1,1:sp_on 0,0:sp_on 3,0:sp_on 2,0:pause 200:locate 1,15:print "                                              ":locate 1,15:print "2. Return to the top screen":goto Kabara_First_Top2:
49900 'case 2:
49910 '       No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print "                                              ":locate 1,15:print "1. Select Numerology Number":goto Kabara_First_Top2:
49920 end select
49930 endif
49940 else
49950 if ((key$ = chr$(31)) or (y = 1)) then
49960 select case No
49970 '
49980 case 1:
49990 No = 0:sp_on 0,1:sp_on 2,0:sp_on 3,0:sp_on 1,0:pause 200:locate 1,15:print "                                       ":locate 1,15:print "1.数秘術占いを選択":goto Kabara_First_Top2:
50000 case 0:
50010 No=1:sp_on 1,1:sp_on 0,0:sp_on 3,0:sp_on 2,0:pause 200:locate 1,15:print "                                              ":locate 1,15:print "2.トップ画面に戻るを選択":goto Kabara_First_Top2:
50020 'case 2:
50030 '       No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print "                                              ":locate 1,15:print "1.数秘術番号を求めるを選択":goto Kabara_First_Top2:
50040 end select
50050 endif
50060 '2.カーソル　上 処理 chr$(30)
50070 if ((key$ = chr$(30)) or (y = -1)) then
50080 select case No
50090 case 0:
50100 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:pause 200:locate 1,15:Print "                                       ":locate 1,15:print "2.トップ画面に戻るを選択":goto Kabara_First_Top2:
50110 case 1:
50120 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:PRINT"                                       ":locate 1,15:print "1.数秘術占いを選択":goto Kabara_First_Top2:
50130 'case 2:
50140 '      No=1:sp_on 0,0:sp_on 2,0:sp_on 1,1:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.数秘術の相性占いを選択":goto Kabara_First_Top2:
50150 end select
50160 endif
50170 endif
50180 '3.決定 処理  bg:2 or Enter key:chr$(13)
50190 if ((bg = 2) or (key$ = chr$(13))) then
50200 select case No
50210 case 0:
50220 sp_on 0,0:sp_on 1,0:sp_on 2,0:No=0: 'goto Input_Seireki:
50230 goto Kabara_TopScreen:
50240 'case 1:
50250 '    sp_on 0,0:sp_on 1,0:sp_on 2,0:No=0:goto Kabara_Aishou_Top:
50260 case 1:
50270 sp_on 0,0:sp_on 1,0:sp_on 2,0:No=0:goto Main_Screen:
50280 end select
50290 endif
50300 '
50310 'Kabara 相性占い トップ画面
50320 Kabara_Aishou_Top:
50330 cls 3:y=0:key$="":bg=0:No=0
50340 play ""
50350 gload Gazo$ + "Kabara_Aishou_Top_20230717.png",0,0,0
50360 gload Gazo$ + "downscreen.png",0,0,800
50370 if ex_info$(1)<>"JP" then
50380 play Voice$ + "Kabara_Aishou_TopScreen_20230721.mp3"
50390 print chr$(13) + chr$(13)
50400 locate 0,4:color rgb(255,255,255)
50410 print "Please select a number" + chr$(13)
50420 print " :1. Compatibility fortune-telling ...." + chr$(13)
50430 print " :2. Business compatibility fortune-telling" + chr$(13)
50440 print " :3. Return to the top screen" + chr$(13)
50450 sp_on 0,1:sp_on 1,0:sp_on 2,0
50460 color rgb(0,0,0)
50470 locate 1,15:print "1. Select compatibility fortune-telling of two men and women"
50480 else
50490 play Voice$ + "Kabara_Aishou_TopScreen_20230721.mp3"
50500 '****************************************************************************************************
50510 'WUXG(1920x1200)の時ここから
50520 '****************************************************************************************************
50530 print chr$(13) + chr$(13)
50540 locate 0,4:color rgb(255,255,255)
50550 'print "Ok"
50560 '
50570 print "番号を選んでください" + chr$(13)
50580 print " :1.男女2人の相性占い(実装不完全)" + chr$(13)
50590 print " :2.ビジネスの相性占い" + chr$(13)
50600 print " :3.トップ画面に戻る" + chr$(13)
50610 sp_on 0,1:sp_on 1,0:sp_on 2,0
50620 color rgb(0,0,0)
50630 locate 1,15:print "1.男女2人の相性占いを選択"
50640 '****************************************************************************************************
50650 'WUXG(1920x1200)の時ここまで
50660 '****************************************************************************************************
50670 endif
50680 Kabara_Aishou_Top2:
50690 key$ = "":y = 0:bg = 0:
50700 while ((key$ <> chr$(13)) and (y <> 1) and (y <> -1) and (bg <> 2) and (key$ <> chr$(30)) and (key$ <> chr$(31)))
50710 'ジョイパッド(右) ,十字キー (上下)
50720 'ジョイパッドの右のボタン bg = 2(ジョイパッド右：決定　)、Enter(chr$(13):（決定）)
50730 y = stick(1)
50740 key$ = inkey$
50750 bg = strig(1)
50760 pause 200
50770 wend
50780 'カーソル　下 or 十字キー　下
50790 if ex_info$(1)<>"JP" then
50800 if ((key$ = chr$(31)) or (y = 1)) then
50810 select case No
50820 'Option change 1 - 2
50830 'case 0 1. Compatibility fortune-telling => 2. Business compatibility fortune-telling
50840 'ok
50850 case 0:
50860 No = 1:sp_on 1,1:sp_on 2,0:sp_on 0,0:pause 200:locate 1,15:print "                                                                               ":locate 1,15:print "2. Select business compatibility fortune-telling":goto Kabara_Aishou_Top2:
50870 'Option change 2 - 3
50880 case 1:
50890 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:print "                                       ":locate 1,15:print "3. Select return to the top screen":locate 1,16:goto Kabara_Aishou_Top2:
50900 'Release time case 2 comment release
50910 case 2:
50920 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1. Select compatibility fortune-telling of two men and women":goto Kabara_Aishou_Top2:
50930 case else:
50940 goto Kabara_Aishou_Top2:
50950 end select
50960 endif
50970 if ((key$ = chr$(30)) or (y = -1)) then
50980 select case No
50990 case 0:
51000 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:locate 1,15:print "                                       ":locate 1,15:print " :3. Return to the top screen" :goto Kabara_Aishou_Top2:
51010 case 1:
51020 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print"                                       ":locate 1,15:print " :1. Compatibility fortune-telling...." :goto Kabara_Aishou_Top2:
51030 case 2:
51040 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print " :2. Business compatibility fortune-telling":goto Kabara_Aishou_Top2:
51050 case else:
51060 goto Kabara_Aishou_Top2:
51070 end select
51080 endif
51090 else
51100 if ((key$ = chr$(31)) or (y = 1)) then
51110 select case No
51120 '選択肢　1 - 2に変更
51130 'case 0 1.男女の相性占い => 2.ビジネスの相性占い
51140 'ok
51150 case 0:
51160 No = 1:sp_on 1,1:sp_on 2,0:sp_on 0,0:pause 200:locate 1,15:print "                                                                               ":locate 1,15:print "2.ビジネスの相性を選択":goto Kabara_Aishou_Top2:
51170 '選択肢　2 - 3に変更
51180 case 1:
51190 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:print "                                       ":locate 1,15:print "3.トップ画面に戻るを選択":locate 1,16:goto Kabara_Aishou_Top2:
51200 'リリース時 case 2コメント解除
51210 case 2:
51220 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.男女の相性占いを選択":goto Kabara_Aishou_Top2:
51230 case else:
51240 goto Kabara_Aishou_Top2:
51250 end select
51260 endif
51270 '十字キー　上　、カーソル　上
51280 if ((key$ = chr$(30)) or (y = -1)) then
51290 select case No
51300 case 0:
51310 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:locate 1,15:print "                                       ":locate 1,15:print "3.トップ画面に戻るを選択":goto Kabara_Aishou_Top2:
51320 case 1:
51330 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print"                                       ":locate 1,15:print "1.男女2人の相性を選択":goto Kabara_Aishou_Top2:
51340 case 2:
51350 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.ビジネスの相性を選択":goto Kabara_Aishou_Top2:
51360 case else:
51370 goto Kabara_Aishou_Top2:
51380 end select
51390 endif
51400 endif
51410 '十字キー　上下:選択
51420 'ジョイパッド 右:決定
51430 if ((bg = 2) or (key$ = chr$(13))) then
51440 select case No
51450 '1.男女の相性
51460 case 0:
51470 '男女の相性占い(未実装)トップ画面に飛ぶ
51480 cls 3:sp_on 0,0:sp_on 1,0:sp_on 2,0:goto Danjyo_Aisyou_Top:
51490 '2ビジネスの相性
51500 case 1:
51510 cls 3:sp_on 0,0:sp_on 1,0:sp_on 2,0:goto Business_Aishou_Input_1_parson:
51520 case 2:
51530 sp_on 0,0:sp_on 1,0:sp_on 2,0:pause 200:goto Main_Screen:
51540 end select
51550 endif
51560 '0.男女の相性　トップ画面　ここから
51570 Danjyo_Aisyou_Top:
51580 cls 3:y=0:key$="":bg=0:No=0
51590 play ""
51600 gload Gazo$ + "Screen1.png",0,0,0
51610 gload Gazo$ + "downscreen.png",0,0,800
51620 if ex_info$(1)<>"JP" then
51630 print chr$(13) + chr$(13)
51640 locate 0,4:color rgb(255,255,255)
51650 print "Please select a number" + chr$(13)
51660 print " :1. Compatibility with a person of ...." + chr$(13)
51670 print " :2. Compatibility between two people" + chr$(13)
51680 print " :3. Return to the top screen" + chr$(13)
51690 sp_on 0,1:sp_on 1,0:sp_on 2,0
51700 color rgb(0,0,0)
51710 locate 1,15:print "1. Compatibility with a person of ...."
51720 else
51730 print chr$(13) + chr$(13)
51740 locate 0,4:color rgb(255,255,255)
51750 '****************************************************************************************************
51760 'WUXG(1920x1200)の時ここから
51770 '****************************************************************************************************
51780 print "番号を選んでください" + chr$(13)
51790 print " :1.自分と異性の相性(未実装)" + chr$(13)
51800 print " :2.男女2人の相性" + chr$(13)
51810 print " :3.トップ画面に戻る" + chr$(13)
51820 sp_on 0,1:sp_on 1,0:sp_on 2,0
51830 color rgb(0,0,0)
51840 locate 1,15:print "1.自分と異性の相性(未実装)を選択"
51850 '****************************************************************************************************
51860 'WUXG(1920x1200)の時ここまで
51870 '****************************************************************************************************
51880 endif
51890 Danjyo_Aisyou_Top2:
51900 key$ = "":y = 0:bg = 0:
51910 while ((key$ <> chr$(13)) and (y <> 1) and (y <> -1) and (bg <> 2) and (key$ <> chr$(30)) and (key$ <> chr$(31)))
51920 'ジョイパッド(右) ,十字キー (上下)
51930 'ジョイパッドの右のボタン bg = 2(ジョイパッド右：決定　)、Enter(chr$(13):（決定）)
51940 y = stick(1)
51950 key$ = inkey$
51960 bg = strig(1)
51970 pause 200
51980 wend
51990 if ex_info$(1)<>"JP" then
52000 'Cursor down or arrow key down
52010 if ((key$ = chr$(31)) or (y = 1)) then
52020 select case No
52030 'Option 1 - 2 change
52040 'case 0 1. Compatibility fortune-telling => 2. Business compatibility fortune-telling
52050 'ok
52060 case 0:
52070 No = 1:sp_on 1,1:sp_on 2,0:sp_on 0,0:pause 200:locate 1,15:print "                                                                               ":locate 1,15:print "2. Select compatibility between two people":goto Danjyo_Aisyou_Top2:
52080 'Option 2 - 3 change
52090 case 1:
52100 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:print "                                       ":locate 1,15:print "3. Select return to the top screen":locate 1,16:goto Danjyo_Aisyou_Top2:
52110 'Release time case 2 comment release
52120 case 2:
52130 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1. Select compatibility with a person of the opposite sex (not implemented)":goto Danjyo_Aisyou_Top2:
52140 case else:
52150 goto Kabara_Aishou_Top2:
52160 end select
52170 endif
52180 'Arrow key up, cursor up
52190 if ((key$ = chr$(30)) or (y = -1)) then
52200 select case No
52210 case 0:
52220 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:locate 1,15:print "                                       ":locate 1,15:print "3. Select return to the top screen":goto Danjyo_Aisyou_Top2:
52230 case 1:
52240 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print"                                       ":locate 1,15:print "1. Select compatibility with a person of the opposite sex (not implemented)":goto Danjyo_Aisyou_Top2:
52250 case 2:
52260 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2. Select compatibility between two people":goto Danjyo_Aisyou_Top2:
52270 case else:
52280 goto Kabara_Aishou_Top2:
52290 end select
52300 endif
52310 else
52320 'カーソル　下 or 十字キー　下
52330 if ((key$ = chr$(31)) or (y = 1)) then
52340 select case No
52350 '選択肢　1 - 2に変更
52360 'case 0 1.男女の相性占い => 2.ビジネスの相性占い
52370 'ok
52380 case 0:
52390 No = 1:sp_on 1,1:sp_on 2,0:sp_on 0,0:pause 200:locate 1,15:print "                                                                               ":locate 1,15:print "2.男女2人の相性を選択":goto Danjyo_Aisyou_Top2:
52400 '選択肢　2 - 3に変更
52410 case 1:
52420 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:print "                                       ":locate 1,15:print "3.トップ画面に戻るを選択":locate 1,16:goto Danjyo_Aisyou_Top2:
52430 'リリース時 case 2コメント解除
52440 case 2:
52450 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.自分と異性の相性(未実装)を選択":goto Danjyo_Aisyou_Top2:
52460 case else:
52470 goto Kabara_Aishou_Top2:
52480 end select
52490 endif
52500 '十字キー　上　、カーソル　上
52510 if ((key$ = chr$(30)) or (y = -1)) then
52520 select case No
52530 case 0:
52540 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:locate 1,15:print "                                       ":locate 1,15:print "3.トップ画面に戻るを選択":goto Danjyo_Aisyou_Top2:
52550 case 1:
52560 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print"                                       ":locate 1,15:print "1.自分と異性の相性(未実装)":goto Danjyo_Aisyou_Top2:
52570 case 2:
52580 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.男女2人の相性を選択":goto Danjyo_Aisyou_Top2:
52590 case else:
52600 goto Kabara_Aishou_Top2:
52610 end select
52620 endif
52630 endif
52640 end
52650 '十字キー　上下:選択
52660 'ジョイパッド 右:決定
52670 if ((bg = 2) or (key$ = chr$(13))) then
52680 select case No
52690 '1.自分と異性の相性
52700 case 0:
52710 '未実装
52720 cls 3:sp_on 0,0:sp_on 1,0:sp_on 2,0:
52730 '2男女の相性 男性の名前入力に飛ぶ
52740 case 1:
52750 cls 3:sp_on 0,0:sp_on 1,0:sp_on 2,0:goto Danjyo_Aisyou_Input_Name_male:
52760 case 2:
52770 sp_on 0,0:sp_on 1,0:sp_on 2,0:pause 200:goto Main_Screen:
52780 end select
52790 endif
52800 '0.男女の相性　トップ画面　ここまで
52810 '1.男女の相性 ここから
52820 '1-1.男性の名前を入力
52830 Danjyo_Aisyou_Input_Name_male:
52840 No=0:color RGB(255,255,255)
52850 '入力:キーボード
52860 cls 3:init "kb:2"
52870 gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
52880 gload Gazo$ + "downscreen.png",0,0,800
52890 for i=0 to 3
52900 buf_male_year(i)=0
52910 next i
52920 if ex_info$(1)<>"JP" then
52930 play "":color rgb(255,0,0):male_name$ = ""
52940 locate 0,1
52950 print "Male Compatibility" + chr$(13) + chr$(13)
52960 color rgb(255,255,255):
52970 locate 0,3
52980 print "We will find the compatibility with a man. Please enter the man's name" + chr$(13)
52990 locate 0,15:color rgb(0,0,0)
53000 Input "Man's Name:",male_name$
53010 else
53020 '****************************************************************************************************
53030 'WUXG(1920x1200)の時ここから
53040 '****************************************************************************************************
53050 play "":color rgb(255,0,0):male_name$ = ""
53060 locate 0,1
53070 print "男性の相性" + chr$(13) + chr$(13)
53080 color rgb(255,255,255):
53090 locate 0,3
53100 print "男性の相性を求めます。男性の名前を" + chr$(13)
53110 print "入れてください" + chr$(13)
53120 locate 0,15:color rgb(0,0,0)
53130 Input "男性の名前:",male_name$
53140 '****************************************************************************************************
53150 'WUXG(1920x1200)の時ここまで
53160 '****************************************************************************************************
53170 endif
53180 '-------------------------------------------
53190 '1-2:男性の生まれた年代
53200 Danjyo_Aisyou_Input_Born_Year:
53210 No=0:color RGB(255,255,255)
53220 cls 3:init "kb:4"
53230 '****************************************************************************************************
53240 'WUXG(1920x1200)の時ここから
53250 '****************************************************************************************************
53260 gload Gazo$ + "Screen1.png",0,0,0
53270 gload Gazo$ + "downscreen.png",0,0,800
53280 '****************************************************************************************************
53290 'WUXG(1920x1200)の時ここから
53300 '****************************************************************************************************
53310 play "":color rgb(255,0,0)
53320 '-------------------------------------------
53330 font 48
53340 if ex_info$(1)<>"JP" then
53350 locate 0,1
53360 color rgb(255,255,255)
53370 print "Please enter the man's birth year" + chr$(13)
53380 color rgb(255,255,255)
53390 locate 1,3
53400 print "Man's Birth Year (4 digits):";buf_male_year$
53410 else
53420 '****************************************************************************************************
53430 'WUXG(1920x1200)の時ここから
53440 '****************************************************************************************************
53450 locate 0,1
53460 '文字色：黒　 color rgb(0,0,0)
53470 color rgb(255,255,255)
53480 print "男性の生まれた年代を入れて下さい" + chr$(13)
53490 color rgb(255,255,255)
53500 locate 1,3
53510 print "男性の生まれた年代(西暦4桁):";buf_male_year$
53520 '****************************************************************************************************
53530 'WUXG(1920x1200)の時ここから
53540 '****************************************************************************************************
53550 endif
53560 color rgb(255,255,255)
53570 'locate 4,6:print ":7"
53580 'locate 9,6:print ":8"
53590 'locate 12,6:print ":9"
53600 locate 4,6
53610 print ":7  :8  :9" + chr$(13)
53620 color rgb(255,255,255)
53630 locate 4,8
53640 print ":4  :5  :6" + chr$(13)
53650 color rgb(255,255,255)
53660 locate 4,10
53670 print ":1  :2  :3" + chr$(13)
53680 locate 4,12
53690 print "    :0"
53700 locate 12,12
53710 color rgb(0,0,255)
53720 print ":Ok"
53730 sp_on 4,0: sp_on 5,0:sp_on 6,0
53740 sp_on 7,0:sp_on 8,0:sp_on 9,0
53750 sp_on 10,0:sp_on 11,0:sp_on 12,0
53760 sp_on 13,0:sp_on 14,1
53770 '-------------------------------------------------------------------------------------
53780 Danjyo_Aisyou_Input_Male_Born_Year2:
53790 key$="":bg=0:y=0:y2=0:bg2=0:
53800 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
53810 key$ = inkey$
53820 bg = strig(1)
53830 y = stick(1)
53840 y2 = stick(0)
53850 bg2=strig(0)
53860 pause 200
53870 wend
53880 '十字キー　ここから
53890 '上の矢印　または、十字キー上
53900 if ((y = -1) or (key$ = chr$(30))) then
53910 select case No
53920 'No=-1:okのとき:初期の状態
53930 '0kボタンから３に移動
53940 '上に行く 処理
53950 case -1:
53960 No=3:sp_on 12,1:sp_on 14,0
53970 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53980 '選択肢:3
53990 '3ボタンから 6に移動
54000 case 3:
54010 No=6:sp_on 12,0:sp_on 11,1
54020 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54030 '6ボタンから ９に移動
54040 case 6:
54050 No=9:sp_on 10,1:sp_on 11,0
54060 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54070 '6ボタンから ９に移動　ここまで
54080 '9で上を押して何もしない
54090 case 9:
54100 '何もしない
54110 No=9
54120 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54130 '9で上を押しても何もしない　ここまで
54140 '上　 0ボタンから2ボタン
54150 'sp_on 6,1:1
54160 'sp_on 8,1:5
54170 'sp_on 7,1:7
54180 case 0:
54190 No=2:sp_on 13,0:sp_on 9,1:
54200 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54210 '上  0ボタンから2ボタン　ここまで
54220 '2から５になる 上
54230 case 2:
54240 No=5:sp_on 8,1:sp_on 9,0:
54250 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54260 case 5:
54270 No=8:sp_on 7,1:sp_on 8,0
54280 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54290 case 8:
54300 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54310 case 1:
54320 No=4:sp_on 5,1:sp_on 6,0
54330 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54340 case 4:
54350 No=7:sp_on 4,1:sp_on 5,0
54360 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54370 case 7:
54380 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54390 end select
54400 endif
54410 '左３　ここまで
54420 '下の矢印
54430 '中央 2
54440 if ((y=1) or (key$ = chr$(31))) then
54450 select case No
54460 '9から６に下げる
54470 case 9:
54480 No=6:sp_on 11,1:sp_on 10,0
54490 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54500 '6から３に下げる
54510 case 6:
54520 No=3:sp_on 12,1:sp_on 11,0
54530 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54540 '3から０ｋに変える
54550 case 3:
54560 No=-1:sp_on 14,1:sp_on 12,0
54570 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54580 'Okから下のボタンを押しても何もしない
54590 case -1:
54600 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54610 case 8:
54620 No=5:sp_on 8,1:sp_on 7,0
54630 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54640 case 5:
54650 No=2:sp_on 9,1:sp_on 8,0
54660 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54670 case 2:
54680 No=0:sp_on 13,1:sp_on 9,0
54690 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54700 case 0:
54710 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54720 case 7:
54730 No=4:sp_on 5,1:sp_on 4,0
54740 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54750 case 4:
54760 No=1:sp_on 6,1:sp_on 5,0
54770 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54780 case 1:
54790 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54800 end select
54810 endif
54820 '左へボタン 十字キー　左　or 　カーソル左
54830 if ((y2 = -1) or (key$ = chr$(29))) then
54840 select case No
54850 'Ok ボタン  Okから　左　０に行く
54860 case -1:
54870 No=0:sp_on 13,1:sp_on 14,0
54880 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54890 '0 ボタン  左　何もしない
54900 case 0:
54910 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54920 case 3:
54930 No=2:sp_on 9,1:sp_on 12,0:
54940 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54950 case 2:
54960 No=1:sp_on 6,1:sp_on 9,0:
54970 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54980 case 1:
54990 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55000 case 6:
55010 No=5:sp_on 8,1:sp_on 11,0
55020 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55030 case 5:
55040 No=4:sp_on 5,1:sp_on 8,0
55050 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55060 case 4:
55070 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55080 case 9:
55090 No=8:sp_on 7,1:sp_on 10,0
55100 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55110 case 8:
55120 No=7:sp_on 4,1:sp_on 7,0
55130 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55140 case 7:
55150 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55160 end select
55170 endif
55180 '右  十字キー　右　or カーソル　右
55190 if ((y2 = 1) or (key$ = chr$(28))) then
55200 select case No
55210 '0ボタンからokボタン右に移動
55220 case 0:
55230 No=-1:sp_on 14,1:sp_on 13,0
55240 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55250 '0ボタンからokボタン 右に移動　ここまで
55260 'OKボタンで右を押して何もしない
55270 case -1:
55280 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55290 case 1:
55300 No=2:sp_on 9,1:sp_on 6,0
55310 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55320 case 2:
55330 No=3:sp_on 12,1:sp_on 9,0
55340 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55350 case 3:
55360 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55370 case 4:
55380 No=5:sp_on 8,1:sp_on 5,0
55390 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55400 case 5:
55410 No=6:sp_on 11,1:sp_on 8,0
55420 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55430 case 7:
55440 No=8:sp_on 7,1:sp_on 4,0
55450 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55460 case 8:
55470 No=9:sp_on 10,1:sp_on 7,0
55480 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55490 case 9:
55500 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55510 case 6:
55520 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55530 end select
55540 'Okから右ボタンを押して何もしない ここまで
55550 endif
55560 '十字キー　ここまで
55570 '==============================
55580 'ここから
55590 '==============================
55600 if ((bg = 2) or (key$ = chr$(13))) then
55610 select case count
55620 case 0:
55630 count = 1
55640 if (No = -1) then
55650 count = 0:No=0
55660 buf_male_year(0) = No
55670 'Okボタンを押したとき
55680 goto Danjyo_Aisyou_Input_Male_Born_Year2:
55690 else
55700 'Okボタン以外が押されたとき
55710 if (No >= 1 and No <= 2) then
55720 buf_year$="":buf_year$ = str$(No) + "***"
55730 buf_year = No:a= No
55740 buf_Jyoushi_Born_Day(0) = No
55750 if ex_info$(1)<>"JP" then
55760 locate 1,3
55770 color rgb(255,255,255)
55780 print "Year of birth of the male (4 digits AD):";buf_year$
55790 else
55800 count=0
55810 ui_msg"The number is out of range."
55820 endif
55830 else
55840 '****************************************************************************************************
55850 'WUXG(1920x1200)の時ここから
55860 '****************************************************************************************************
55870 locate 1,3
55880 color rgb(255,255,255)
55890 print "男性の生まれた年代(西暦4桁):";buf_year$
55900 goto Danjyo_Aisyou_Input_Male_Born_Year2:
55910 '****************************************************************************************************
55920 'WUXG(1920x1200)の時ここまで
55930 '****************************************************************************************************
55940 else
55950 count=0
55960 ui_msg"数字が範囲外になります。"
55970 endif
55980 buf_year$="":buf_year=0
55990 goto Danjyo_Aisyou_Input_Male_Born_Year2:
56000 endif
56010 'endif
56020 case 1:
56030 count = 2
56040 if (No = -1) then
56050 count = 1
56060 goto Danjyo_Aisyou_Input_Male_Born_Year2:
56070 else
56080 '****************************************************************************************************
56090 'WUXG(1920x1200)の時ここから
56100 '****************************************************************************************************
56110 buf_year = a * 10 + No
56120 b=buf_year
56130 buf_year$ = str$(buf_year) + "**"
56140 buf_male_year(0)=buf_year
56150 locate 1,3
56160 color rgb(255,255,255)
56170 print "                                                                "
56180 locate 1,3
56190 print "男性の生まれた年代(西暦4桁):" + buf_year$
56200 'if (No = -1) then
56210 'count=1
56220 goto Danjyo_Aisyou_Input_Male_Born_Year2:
56230 '****************************************************************************************************
56240 'WUXG(1920x1200)の時ここまで
56250 '****************************************************************************************************
56260 endif
56270 case 2:
56280 count=3
56290 if (No=-1) then
56300 count =2
56310 goto Danjyo_Aisyou_Input_Male_Born_Year2:
56320 else
56330 buf_year = b * 10 + No
56340 c=buf_year
56350 buf_year$ = str$(buf_year) + "*"
56360 buf_male_year(0) = buf_year
56370 locate 1,3
56380 color rgb(255,255,255)
56390 print " 　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　"
56400 if ex_info$(1)<>"JP" then
56410 locate 1,3
56420 print "Year of birth of the male (4 digits AD):";buf_year$
56430 else
56440 '****************************************************************************************************
56450 'WUXG(1920x1200)の時ここから
56460 '****************************************************************************************************
56470 locate 1,3
56480 print "男性の生まれた年代(西暦4桁):";buf_year$
56490 goto Danjyo_Aisyou_Input_Male_Born_Year2:
56500 '****************************************************************************************************
56510 'WUXG(1920x1200)の時ここまで
56520 '****************************************************************************************************
56530 endif
56540 endif
56550 case 3:
56560 count=4
56570 if (No = -1) then
56580 No=0
56590 goto Danjyo_Aisyou_Input_Male_Born_Year2:
56600 else
56610 buf_year = c * 10 + No
56620 buf_year$ = str$(buf_year)
56630 buf_male_year(0) = buf_year
56640 if ex_info$(1)<>"JP" then
56650 locate 1,3
56660 color RGB(255,255,255)
56670 print "                                      "
56680 locate 1,3
56690 print "Year of birth of the male (4 digits AD):";buf_year$
56700 else
56710 locate 1,3
56720 color RGB(255,255,255)
56730 print "                                      "
56740 locate 1,3
56750 print "男性の生まれた年代(西暦4桁):";buf_year$
56760 endif
56770 buf_year=val(buf_year$)
56780 'year=val(buf_year$)
56790 'if (No=-1) then
56800 'goto Input_Born_Month:
56810 'else
56820 goto Danjyo_Aisyou_Input_Male_Born_Year2:
56830 endif
56840 case 4:
56850 'bufyear=buf_year
56860 if (No=-1) then
56870 buf_year = val(buf_year$)
56880 buf_male_year(0)=buf_year
56890 sp_on 14,0:No=0
56900 goto Danjyo_Aisyou_Input_Male_Born_Year2:
56910 else
56920 goto Danjyo_Aisyou_Input_Male_Born_Year2:
56930 endif
56940 end select
56950 endif
56960 '===========================
56970 'ここまでを部下のところにコピーする.
56980 '===========================
56990 if (bg2 = 2) then
57000 select case count2
57010 case 0:
57020 if (No = -1) then
57030 buf_male_year=0:buf_male_year$=trim$(""):buf_male_year$=trim$("****")
57040 count=0
57050 if ex_info$(1)<>"JP" then
57060 locate 1,3
57070 color rgb(255,255,255)
57080 print "                                      "
57090 locate 1,3
57100 print "Year of birth of the male (4 digits AD):" + buf_male_year$
57110 goto Danjyo_Aisyou_Input_Male_Born_Year2:
57120 else
57130 '(buf_year=0) then
57140 buf_male_year=0:buf_male_year$="****"
57150 locate 1,3
57160 print "                                       "
57170 locate 1,3
57180 print "Year of birth of the male (4 digits AD):"+buf_male_year$
57190 goto Danjyo_Aisyou_Input_Male_Born_Year2:
57200 else
57210 locate 1,3
57220 color rgb(255,255,255)
57230 print "                                      "
57240 locate 1,3
57250 print "男性の生まれた年代（西暦4桁):" + buf_male_year$
57260 goto Danjyo_Aisyou_Input_Male_Born_Year2:
57270 else
57280 '(buf_year=0) then
57290 buf_male_year=0:buf_male_year$="****"
57300 locate 1,3
57310 print "                                       "
57320 locate 1,3
57330 print "男性の生まれた年代(西暦4桁):"+buf_male_year$
57340 goto Danjyo_Aisyou_Input_Male_Born_Year2:
57350 endif
57360 endif
57370 end select
57380 endif
57390 '-------生まれた年代　男性-------------
57400 '-------生まれた月　男性-------------
57410 '1-2:男性の生まれた月
57420 Danjyo_Aisyou_Input_Male_Born_Month:
57430 cls 3:play "":count=0:count2=0
57440 'No=-1:Okのとき
57450 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_male_Month$ = "**":buf_male_month=0
57460 for i=0 to 1
57470 buf_male_month(i)=0
57480 next i
57490 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
57500 '****************************************************************************************************
57510 'WUXG(1920x1200)の時ここから
57520 '****************************************************************************************************
57530 gload Gazo$ + "Screen1.png",0,0,0
57540 gload Gazo$ + "downscreen.png",0,0,800
57550 '****************************************************************************************************
57560 'WUXG(1920x1200)の時ここまで
57570 '****************************************************************************************************
57580 'Init"kb:4"
57590 '音声ファイル再生 2023.06.07
57600 play Voice$ + "Input_Born_Month_Jyoushi_20230831.mp3"
57610 '****************************************************************************************************
57620 'WUXG(1920x1200)の時ここから
57630 '****************************************************************************************************
57640 font 48
57650 '****************************************************************************************************
57660 'WUXG(1920x1200)の時ここまで
57670 '****************************************************************************************************
57680 locate 0,1
57690 '文字色：黒　 color rgb(0,0,0)
57700 '文字色:白
57710 color rgb(255,255,255)
57720 print "男性の生まれた月を入れて下さい" + chr$(13)
57730 '文字色:白
57740 color rgb(255,255,255)
57750 locate 1,3
57760 '文字色:白
57770 print "男性の生まれた月(1月~12月):"+buf_male_Month$
57780 color rgb(255,255,255)
57790 'locate 4,6:print ":7"
57800 'locate 9,6:print ":8"
57810 'locate 12,6:print ":9"
57820 locate 4,6
57830 '文字色:赤
57840 print ":7  :8  :9" + chr$(13)
57850 color rgb(255,255,255)
57860 locate 4,8
57870 print ":4  :5  :6" + chr$(13)
57880 color rgb(255,255,255)
57890 locate 4,10
57900 print ":1  :2  :3" + chr$(13)
57910 locate 4,12
57920 print "    :0"
57930 locate 12,12
57940 color rgb(0,0,255)
57950 print ":Ok"
57960 sp_on 4,0: sp_on 5,0:sp_on 6,0
57970 sp_on 7,0:sp_on 8,0:sp_on 9,0
57980 sp_on 10,0:sp_on 11,0:sp_on 12,0
57990 sp_on 13,0:sp_on 14,1
58000 '----------------------------------------------------------------------------------------
58010 Danjyo_Aisyou_Input_Male_Born_Month2:
58020 key$="":bg=0:y=0:y2=0:bg2=0
58030 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
58040 key$ = inkey$
58050 bg = strig(1)
58060 y = stick(1)
58070 y2 = stick(0)
58080 bg2 = strig(0)
58090 pause 200
58100 wend
58110 '十字キー　ここから
58120 '上の矢印　または、十字キー上
58130 if ((y = -1) or (key$ = chr$(30))) then
58140 select case No
58150 'No=-1:okのとき:初期の状態
58160 '0kボタンから３に移動
58170 '上に行く 処理
58180 case -1:
58190 No=3:sp_on 12,1:sp_on 14,0
58200 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58210 '選択肢:3
58220 '3ボタンから 6に移動
58230 case 3:
58240 No=6:sp_on 12,0:sp_on 11,1
58250 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58260 '6ボタンから ９に移動
58270 case 6:
58280 No=9:sp_on 10,1:sp_on 11,0
58290 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58300 '6ボタンから ９に移動　ここまで
58310 '9で上を押して何もしない
58320 case 9:
58330 '何もしない
58340 No=9
58350 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58360 '9で上を押しても何もしない　ここまで
58370 '上　 0ボタンから2ボタン
58380 'sp_on 6,1:1
58390 'sp_on 8,1:5
58400 'sp_on 7,1:7
58410 case 0:
58420 No=2:sp_on 13,0:sp_on 9,1:
58430 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58440 '上  0ボタンから2ボタン　ここまで
58450 '2から５になる 上
58460 case 2:
58470 No=5:sp_on 8,1:sp_on 9,0:
58480 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58490 case 5:
58500 No=8:sp_on 7,1:sp_on 8,0
58510 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58520 case 8:
58530 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58540 case 1:
58550 No=4:sp_on 5,1:sp_on 6,0
58560 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58570 case 4:
58580 No=7:sp_on 4,1:sp_on 5,0
58590 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58600 case 7:
58610 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58620 end select
58630 endif
58640 '左３　ここまで
58650 '下の矢印
58660 '中央 2
58670 if ((y=1) or (key$ = chr$(31))) then
58680 select case No
58690 '9から６に下げる
58700 case 9:
58710 No=6:sp_on 11,1:sp_on 10,0
58720 pause 200:gotoDanjyo_Aisyou_Input_Male_Born_Month2:
58730 '6から３に下げる
58740 case 6:
58750 No=3:sp_on 12,1:sp_on 11,0
58760 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58770 '3から０ｋに変える
58780 case 3:
58790 No=-1:sp_on 14,1:sp_on 12,0
58800 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58810 'Okから下のボタンを押しても何もしない
58820 case -1:
58830 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58840 case 8:
58850 No=5:sp_on 8,1:sp_on 7,0
58860 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58870 case 5:
58880 No=2:sp_on 9,1:sp_on 8,0
58890 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58900 case 2:
58910 No=0:sp_on 13,1:sp_on 9,0
58920 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58930 case 0:
58940 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58950 case 7:
58960 No=4:sp_on 5,1:sp_on 4,0
58970 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58980 case 4:
58990 No=1:sp_on 6,1:sp_on 5,0
59000 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59010 case 1:
59020 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59030 end select
59040 endif
59050 '左へボタン 十字キー　左　or 　カーソル左
59060 if ((y2 = -1) or (key$ = chr$(29))) then
59070 select case No
59080 'Ok ボタン  Okから　左　０に行く
59090 case -1:
59100 No=0:sp_on 13,1:sp_on 14,0
59110 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59120 '0 ボタン  左　何もしない
59130 case 0:
59140 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59150 case 3:
59160 No=2:sp_on 9,1:sp_on 12,0:
59170 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59180 case 2:
59190 No=1:sp_on 6,1:sp_on 9,0:
59200 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59210 case 1:
59220 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59230 case 6:
59240 No=5:sp_on 8,1:sp_on 11,0
59250 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59260 case 5:
59270 No=4:sp_on 5,1:sp_on 8,0
59280 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59290 case 4:
59300 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59310 case 9:
59320 No=8:sp_on 7,1:sp_on 10,0
59330 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59340 case 8:
59350 No=7:sp_on 4,1:sp_on 7,0
59360 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59370 case 7:
59380 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59390 end select
59400 endif
59410 '右  十字キー　右　or カーソル　右
59420 if ((y2 = 1) or (key$ = chr$(28))) then
59430 select case No
59440 '0ボタンからokボタン右に移動
59450 case 0:
59460 No=-1:sp_on 14,1:sp_on 13,0
59470 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59480 '0ボタンからokボタン 右に移動　ここまで
59490 'OKボタンで右を押して何もしない
59500 case -1:
59510 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59520 case 1:
59530 No=2:sp_on 9,1:sp_on 6,0
59540 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59550 case 2:
59560 No=3:sp_on 12,1:sp_on 9,0
59570 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59580 case 3:
59590 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59600 case 4:
59610 No=5:sp_on 8,1:sp_on 5,0
59620 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59630 case 5:
59640 No=6:sp_on 11,1:sp_on 8,0
59650 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59660 case 7:
59670 No=8:sp_on 7,1:sp_on 4,0
59680 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59690 case 8:
59700 No=9:sp_on 10,1:sp_on 7,0
59710 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59720 case 9:
59730 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59740 case 6:
59750 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59760 end select
59770 'Okから右ボタンを押して何もしない ここまで
59780 endif
59790 '十字キー　ここまで
59800 '右の丸ボタン + Enter key 決定キー
59810 if ((bg=2) or (key$=chr$(13))) then
59820 select case count
59830 case 0:
59840 if (No=-1) then No=0
59850 count = 1:buf_male_Month$ = "**":buf_male_Month$ = str$(No):buf_male_month = No:c=No
59860 if (buf_male_month > 1 and buf_male_month < 10)  then
59870 buf_male_Month$ = str$(buf_male_month)
59880 'buf_month=No
59890 endif
59900 if (buf_male_month = 1)  then
59910 buf_male_Month$ = str$(buf_male_month) + "*"
59920 'c=buf_month
59930 endif
59940 locate 1,3
59950 print "                                     "
59960 color RGB(255,255,255)
59970 locate 1,3
59980 print "男性の生まれた月(1月~12月):" + buf_male_Month$
59990 goto Danjyo_Aisyou_Input_Male_Born_Month2:
60000 case 1:
60010 count = 2:
60020 'c = val(buf_Month$)
60030 if (No = -1) then
60040 'count=0
60050 No=0
60060 month=buf_male_month
60070 buf_male_month=val(buf_male_Month$)
60080 month=buf_male_month
60090 buf_Jyoushi_Born_Day(1)=month
60100 '生まれた日に飛ぶ
60110 goto Danjyo_Aisyou_Input_Male_Born_Day:
60120 else
60130 buf_male_month = c*10 + No
60140 'if (buf_month = 1) then
60150 'buf_Month$ = str$(buf_month)
60160 'endif
60170 buf_male_Month$ = str$(buf_male_month)
60180 buf_Jyoushi_Born_Day(1) = buf_male_month
60190 locate 0,3
60200 print "                                           "
60210 locate 1,3
60220 color Rgb(255,255,255)
60230 print "男性の生まれた月(1月~12月):" + buf_male_Month$
60240 goto Danjyo_Aisyou_Input_Male_Born_Month2:
60250 endif
60260 case 2:
60270 '==================================
60280 '何もしない
60290 'coun = 2
60300 '==================================
60310 'c= val(buf_Month$)
60320 'buf_month = c*10 + No
60330 'buf_Month$ = str$(buf_month)
60340 'locate 2,3
60350 'print "上司の生まれた月(1月～12月):";buf_Month$
60360 'goto Jyoushi_Input_Born_Month2:
60370 'case 3:
60380 'count=4
60390 'b=val(buf_month$)
60400 'buf_month=c*10+No
60410 'buf_Month$=str$(buf_month)
60420 'locate 2,3
60430 'print "上司の生まれた月(1月～12月):";buf_Month$
60440 'buf_month=val(buf_Month$)
60450 'year=val(buf_year$)
60460 if (No=-1) then
60470 No=0
60480 goto Danjyo_Aisyou_Input_Male_Born_Day:
60490 else
60500 goto Danjyo_Aisyou_Input_Male_Born_Day2:
60510 endif
60520 'case 4:
60530 'bufyear=buf_year
60540 'if (No=-1) then
60550 'buf_month = val(buf_Month$)
60560 'month = buf_month
60570 'sp_on 14,0
60580 'goto Input_Born_Day:
60590 'else
60600 'goto Input_Born_Month2:
60610 'endif
60620 end select
60630 endif
60640 '左の丸ボタン　キャンセル
60650 if (bg2=2) then
60660 select case count2
60670 case 0:
60680 if (No = -1) then
60690 buf_male_month=0:buf_male_Month$="**"
60700 count=0
60710 'goto rewrite2:
60720 else
60730 if ((No >= 1 and No <= 9) or (No >= 10 and No <= 12)) then
60740 buf_male_month = 0:buf_male_Month$ = "**"
60750 locate 0,3
60760 color rgb(255,255,255)
60770 print "                                       "
60780 goto rewrite2:
60790 if (No>12) then
60800 ui_msg"値が範囲外です。"
60810 goto rewrite2:
60820 endif
60830 endif
60840 endif
60850 rewrite2:
60860 locate 2,3
60870 color rgb(255,255,255)
60880 print "                                      "
60890 locate 2,3
60900 print "男性の生まれた月(1月~12月):"+buf_male_Month$
60910 goto Danjyo_Aisyou_Input_Male_Born_Month2:
60920 end select
60930 'endif
60940 endif
60950 end
60960 '-------生まれた月　男性 ここまで-------------
60970 '-------生まれた日　男性 ここから-------------
60980 Danjyo_Aisyou_Input_Male_Born_Day:
60990 cls 3:play "":count=0:count2=0
61000 'No=-1:Okのとき
61010 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_male_Day$ = "**":buf_male_day = 0
61020 for i=0 to 1
61030 buf_day(i)=0
61040 next i
61050 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
61060 '****************************************************************************************************
61070 'WUXG(1920x1200)の時ここから
61080 '****************************************************************************************************
61090 gload Gazo$ + "Screen1.png",0,0,0
61100 gload Gazo$ + "downscreen.png",0,0,800
61110 '****************************************************************************************************
61120 'WUXG(1920x1200)の時ここまで
61130 '****************************************************************************************************
61140 'Init"kb:4"
61150 '音声ファイル再生 2023.06.07
61160 play Voice$ + "Input_Born_Month_Jyoushi_20230831.mp3"
61170 font 48
61180 locate 0,1
61190 '文字色：黒　 color rgb(0,0,0)
61200 '文字色:白
61210 color rgb(255,255,255)
61220 print "男性の生まれた日を入れて下さい" + chr$(13)
61230 '文字色:白
61240 color rgb(255,255,255)
61250 locate 1,3
61260 '文字色:白
61270 print "男性の生まれた日(1月~31月):" + buf_Day$
61280 color rgb(255,255,255)
61290 'locate 4,6:print ":7"
61300 'locate 9,6:print ":8"
61310 'locate 12,6:print ":9"
61320 locate 4,6
61330 '文字色:赤
61340 print ":7  :8  :9" + chr$(13)
61350 color rgb(255,255,255)
61360 locate 4,8
61370 print ":4  :5  :6" + chr$(13)
61380 color rgb(255,255,255)
61390 locate 4,10
61400 print ":1  :2  :3" + chr$(13)
61410 locate 4,12
61420 print "    :0"
61430 locate 12,12
61440 color rgb(0,0,255)
61450 print ":Ok"
61460 sp_on 4,0: sp_on 5,0:sp_on 6,0
61470 sp_on 7,0:sp_on 8,0:sp_on 9,0
61480 sp_on 10,0:sp_on 11,0:sp_on 12,0
61490 sp_on 13,0:sp_on 14,1
61500 '-------------------------------------------------
61510 Danjyo_Aisyou_Input_Male_Born_Day2:
61520 key$="":bg=0:y=0:y2=0:bg2=0
61530 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
61540 key$ = inkey$
61550 bg = strig(1)
61560 y = stick(1)
61570 y2 = stick(0)
61580 bg2 = strig(0)
61590 pause 200
61600 wend
61610 '十字キー　ここから
61620 '上の矢印　または、十字キー上
61630 if ((y = -1) or (key$ = chr$(30))) then
61640 select case No
61650 'No=-1:okのとき:初期の状態
61660 '0kボタンから３に移動
61670 '上に行く 処理
61680 case -1:
61690 No=3:sp_on 12,1:sp_on 14,0
61700 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61710 '選択肢:3
61720 '3ボタンから 6に移動
61730 case 3:
61740 No=6:sp_on 12,0:sp_on 11,1
61750 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61760 '6ボタンから ９に移動
61770 case 6:
61780 No=9:sp_on 10,1:sp_on 11,0
61790 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61800 '6ボタンから ９に移動　ここまで
61810 '9で上を押して何もしない
61820 case 9:
61830 '何もしない
61840 No=9
61850 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61860 '9で上を押しても何もしない　ここまで
61870 '上　 0ボタンから2ボタン
61880 'sp_on 6,1:1
61890 'sp_on 8,1:5
61900 'sp_on 7,1:7
61910 case 0:
61920 No=2:sp_on 13,0:sp_on 9,1:
61930 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61940 '上  0ボタンから2ボタン　ここまで
61950 '2から５になる 上
61960 case 2:
61970 No=5:sp_on 8,1:sp_on 9,0:
61980 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61990 case 5:
62000 No=8:sp_on 7,1:sp_on 8,0
62010 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62020 case 8:
62030 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62040 case 1:
62050 No=4:sp_on 5,1:sp_on 6,0
62060 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62070 case 4:
62080 No=7:sp_on 4,1:sp_on 5,0
62090 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62100 case 7:
62110 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62120 end select
62130 endif
62140 '左３　ここまで
62150 '下の矢印
62160 '中央 2
62170 if ((y=1) or (key$ = chr$(31))) then
62180 select case No
62190 '9から６に下げる
62200 case 9:
62210 No=6:sp_on 11,1:sp_on 10,0
62220 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62230 '6から３に下げる
62240 case 6:
62250 No=3:sp_on 12,1:sp_on 11,0
62260 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62270 '3から０ｋに変える
62280 case 3:
62290 No=-1:sp_on 14,1:sp_on 12,0
62300 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62310 'Okから下のボタンを押しても何もしない
62320 case -1:
62330 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62340 case 8:
62350 No=5:sp_on 8,1:sp_on 7,0
62360 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62370 case 5:
62380 No=2:sp_on 9,1:sp_on 8,0
62390 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62400 case 2:
62410 No=0:sp_on 13,1:sp_on 9,0
62420 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62430 case 0:
62440 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62450 case 7:
62460 No=4:sp_on 5,1:sp_on 4,0
62470 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62480 case 4:
62490 No=1:sp_on 6,1:sp_on 5,0
62500 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62510 case 1:
62520 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62530 end select
62540 endif
62550 '左へボタン 十字キー　左　or 　カーソル左
62560 if ((y2 = -1) or (key$ = chr$(29))) then
62570 select case No
62580 'Ok ボタン  Okから　左　０に行く
62590 case -1:
62600 No=0:sp_on 13,1:sp_on 14,0
62610 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62620 '0 ボタン  左　何もしない
62630 case 0:
62640 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62650 case 3:
62660 No=2:sp_on 9,1:sp_on 12,0:
62670 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62680 case 2:
62690 No=1:sp_on 6,1:sp_on 9,0:
62700 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62710 case 1:
62720 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62730 case 6:
62740 No=5:sp_on 8,1:sp_on 11,0
62750 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62760 case 5:
62770 No=4:sp_on 5,1:sp_on 8,0
62780 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62790 case 4:
62800 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62810 case 9:
62820 No=8:sp_on 7,1:sp_on 10,0
62830 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62840 case 8:
62850 No=7:sp_on 4,1:sp_on 7,0
62860 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62870 case 7:
62880 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62890 end select
62900 endif
62910 '右  十字キー　右　or カーソル　右
62920 if ((y2 = 1) or (key$ = chr$(28))) then
62930 select case No
62940 '0ボタンからokボタン右に移動
62950 case 0:
62960 No=-1:sp_on 14,1:sp_on 13,0
62970 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62980 '0ボタンからokボタン 右に移動　ここまで
62990 'OKボタンで右を押して何もしない
63000 case -1:
63010 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
63020 case 1:
63030 No=2:sp_on 9,1:sp_on 6,0
63040 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
63050 case 2:
63060 No=3:sp_on 12,1:sp_on 9,0
63070 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
63080 case 3:
63090 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
63100 case 4:
63110 No=5:sp_on 8,1:sp_on 5,0
63120 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
63130 case 5:
63140 No=6:sp_on 11,1:sp_on 8,0
63150 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
63160 case 7:
63170 No=8:sp_on 7,1:sp_on 4,0
63180 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
63190 case 8:
63200 No=9:sp_on 10,1:sp_on 7,0
63210 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
63220 case 9:
63230 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
63240 case 6:
63250 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
63260 end select
63270 'Okから右ボタンを押して何もしない ここまで
63280 endif
63290 '十字キー　ここまで
63300 '右の丸ボタン + Enter key 決定キー
63310 if ((bg=2) or (key$=chr$(13))) then
63320 select case count
63330 case 0:
63340 if (No=-1) then No=0
63350 count = 1:buf_male_Day$ = "**":buf_male_Day$ = str$(No):buf_male_day = No:c=No
63360 if (buf_male_day > 1 and buf_male_day < 10)  then
63370 buf_male_Day$ = str$(buf_male_day)
63380 'buf_month=No
63390 endif
63400 if (buf_male_day = 1)  then
63410 buf_male_Day$ = str$(buf_male_day) + "*"
63420 'c=buf_month
63430 endif
63440 locate 1,3
63450 print "                                     "
63460 color RGB(255,255,255)
63470 locate 1,3
63480 print "男性の生まれた日(1月~31月):" + buf_male_Day$
63490 goto Danjyo_Aisyou_Input_Male_Born_Day2:
63500 case 1:
63510 count = 2:
63520 'c = val(buf_Month$)
63530 if (No = -1) then
63540 'count=0
63550 No=0
63560 day=buf_male_Day
63570 buf_male_Day=val(buf_male_Day$)
63580 day=buf_male_Day
63590 buf_Jyoushi_Born_Day(2)=day
63600 '生まれた日に飛ぶ
63610 goto Danjyo_Aisyou_Input_Male_Born_Day:
63620 else
63630 buf_male_Day = c*10 + No
63640 'if (buf_month = 1) then
63650 'buf_Month$ = str$(buf_month)
63660 'endif
63670 buf_male_Day$ = str$(buf_male_Day)
63680 buf_male_Born_Day(2) = buf_male_Day:
63690 locate 0,3
63700 print "                                           "
63710 locate 1,3
63720 color Rgb(255,255,255)
63730 print "男性の生まれた月(1月~12月):" + buf_male_Day$
63740 goto Danjyo_Aisyou_Input_Male_Born_Day2:
63750 endif
63760 case 2:
63770 '==================================
63780 '何もしない
63790 'coun = 2
63800 '==================================
63810 'c= val(buf_Month$)
63820 'buf_month = c*10 + No
63830 'buf_Month$ = str$(buf_month)
63840 'locate 2,3
63850 'print "上司の生まれた月(1月～12月):";buf_Month$
63860 'goto Jyoushi_Input_Born_Month2:
63870 'case 3:
63880 'count=4
63890 'b=val(buf_month$)
63900 'buf_month=c*10+No
63910 'buf_Month$=str$(buf_month)
63920 'locate 2,3
63930 'print "上司の生まれた月(1月～12月):";buf_Month$
63940 'buf_month=val(buf_Month$)
63950 'year=val(buf_year$)
63960 if (No=-1) then
63970 No=0
63980 goto Danjyo_Aisyou_Input_Male_Born_Day:
63990 else
64000 goto Danjyo_Aisyou_Input_Male_Born_Day2:
64010 endif
64020 'case 4:
64030 'bufyear=buf_year
64040 'if (No=-1) then
64050 'buf_month = val(buf_Month$)
64060 'month = buf_month
64070 'sp_on 14,0
64080 'goto Input_Born_Day:
64090 'else
64100 'goto Input_Born_Month2:
64110 'endif
64120 end select
64130 endif
64140 '左の丸ボタン　キャンセル
64150 if (bg2=2) then
64160 select case count2
64170 case 0:
64180 if (No = -1) then
64190 buf_male_day=0:buf_male_Day$="**"
64200 count=0
64210 'goto rewrite2:
64220 else
64230 if ((No >= 1 and No <= 9) or (No >= 10 and No <= 12)) then
64240 buf_male_day = 0:buf_male_Day$ = "**"
64250 locate 0,3
64260 color rgb(255,255,255)
64270 print "                                       "
64280 goto rewrite2:
64290 if (No>12) then
64300 ui_msg"値が範囲外です。"
64310 goto rewrite2:
64320 endif
64330 endif
64340 endif
64350 rewrite2:
64360 locate 2,3
64370 color rgb(255,255,255)
64380 print "                                      "
64390 locate 2,3
64400 print "男性の生まれた日(1月~31月):"+buf_male_Day$
64410 goto Danjyo_Aisyou_Input_Male_Born_Day2:
64420 end select
64430 'endif
64440 endif
64450 end
64460 '-------生まれた日　女性　ここまで-------------
64470 '1-1.女性の名前を入力
64480 Danjyo_Aisyou_Input_Name_female:
64490 No=0:color RGB(255,255,255)
64500 '入力:キーボード
64510 cls 3:init "kb:2"
64520 '****************************************************************************************************
64530 'WUXG(1920x1200)の時ここから
64540 '****************************************************************************************************
64550 gload Gazo$ + "Screen1.png",0,0,0
64560 gload Gazo$ + "downscreen.png",0,0,800
64570 '****************************************************************************************************
64580 'WUXG(1920x1200)の時ここまで
64590 '****************************************************************************************************
64600 play "":color rgb(255,0,0):female_name$ = ""
64610 locate 0,1
64620 print "女性の相性" + chr$(13) + chr$(13)
64630 color rgb(255,255,255):
64640 locate 0,3
64650 print "女性の相性を求めます。男性の名前を" + chr$(13)
64660 print "入れてください" + chr$(13)
64670 locate 0,15:color rgb(0,0,0)
64680 Input "女性の名前:",female_name$
64690 '-------------------------------------------
64700 '-------生まれた年代　女性 ここから-------------
64710 Danjyo_Aisyou_Input_feMale_Born_Year:
64720 cls 3:play "":count=0:count2=0
64730 'No=-1:Okのとき
64740 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_female_Year$ = "****":buf_female_year = 0
64750 for i=0 to 1
64760 buf_day(i)=0
64770 next i
64780 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
64790 gload Gazo$ + "Screen1.png",0,0,0
64800 gload Gazo$ + "downscreen.png",0,0,800
64810 'Init"kb:4"
64820 '音声ファイル再生 2023.06.07
64830 play Voice$ + "Input_Born_Month_Jyoushi_20230831.mp3"
64840 '****************************************************************************************************
64850 'WUXG(1920x1200)の時ここから
64860 '****************************************************************************************************
64870 font 48
64880 '****************************************************************************************************
64890 'WUXG(1920x1200)の時ここまで
64900 '****************************************************************************************************
64910 locate 0,1
64920 '文字色：黒　 color rgb(0,0,0)
64930 '文字色:白
64940 color rgb(255,255,255)
64950 print "女性の生まれた年代を入れて下さい" + chr$(13)
64960 '文字色:白
64970 color rgb(255,255,255)
64980 locate 1,3
64990 '文字色:白
65000 print "女性の生まれた年代(西暦4桁):" + buf_female_Year$
65010 color rgb(255,255,255)
65020 'locate 4,6:print ":7"
65030 'locate 9,6:print ":8"
65040 'locate 12,6:print ":9"
65050 locate 4,6
65060 '文字色:赤
65070 print ":7  :8  :9" + chr$(13)
65080 color rgb(255,255,255)
65090 locate 4,8
65100 print ":4  :5  :6" + chr$(13)
65110 color rgb(255,255,255)
65120 locate 4,10
65130 print ":1  :2  :3" + chr$(13)
65140 locate 4,12
65150 print "    :0"
65160 locate 12,12
65170 color rgb(0,0,255)
65180 print ":Ok"
65190 sp_on 4,0: sp_on 5,0:sp_on 6,0
65200 sp_on 7,0:sp_on 8,0:sp_on 9,0
65210 sp_on 10,0:sp_on 11,0:sp_on 12,0
65220 sp_on 13,0:sp_on 14,1
65230 '---------------------------------------------
65240 Danjyo_Aisyou_Input_feMale_Born_Year2:
65250 key$="":bg=0:y=0:y2=0:bg2=0:
65260 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
65270 key$ = inkey$
65280 bg = strig(1)
65290 y = stick(1)
65300 y2 = stick(0)
65310 bg2=strig(0)
65320 pause 200
65330 wend
65340 '十字キー　ここから
65350 '上の矢印　または、十字キー上
65360 if ((y = -1) or (key$ = chr$(30))) then
65370 select case No
65380 'No=-1:okのとき:初期の状態
65390 '0kボタンから３に移動
65400 '上に行く 処理
65410 case -1:
65420 No=3:sp_on 12,1:sp_on 14,0
65430 pause 200:gotoDanjyo_Aisyou_Input_feMale_Born_Year2:
65440 '選択肢:3
65450 '3ボタンから 6に移動
65460 case 3:
65470 No=6:sp_on 12,0:sp_on 11,1
65480 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65490 '6ボタンから ９に移動
65500 case 6:
65510 No=9:sp_on 10,1:sp_on 11,0
65520 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65530 '6ボタンから ９に移動　ここまで
65540 '9で上を押して何もしない
65550 case 9:
65560 '何もしない
65570 No=9
65580 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65590 '9で上を押しても何もしない　ここまで
65600 '上　 0ボタンから2ボタン
65610 'sp_on 6,1:1
65620 'sp_on 8,1:5
65630 'sp_on 7,1:7
65640 case 0:
65650 No=2:sp_on 13,0:sp_on 9,1:
65660 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65670 '上  0ボタンから2ボタン　ここまで
65680 '2から５になる 上
65690 case 2:
65700 No=5:sp_on 8,1:sp_on 9,0:
65710 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65720 case 5:
65730 No=8:sp_on 7,1:sp_on 8,0
65740 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65750 case 8:
65760 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65770 case 1:
65780 No=4:sp_on 5,1:sp_on 6,0
65790 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65800 case 4:
65810 No=7:sp_on 4,1:sp_on 5,0
65820 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65830 case 7:
65840 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65850 end select
65860 endif
65870 '左３　ここまで
65880 '下の矢印
65890 '中央 2
65900 if ((y=1) or (key$ = chr$(31))) then
65910 select case No
65920 '9から６に下げる
65930 case 9:
65940 No=6:sp_on 11,1:sp_on 10,0
65950 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65960 '6から３に下げる
65970 case 6:
65980 No=3:sp_on 12,1:sp_on 11,0
65990 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66000 '3から０ｋに変える
66010 case 3:
66020 No=-1:sp_on 14,1:sp_on 12,0
66030 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66040 'Okから下のボタンを押しても何もしない
66050 case -1:
66060 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66070 case 8:
66080 No=5:sp_on 8,1:sp_on 7,0
66090 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66100 case 5:
66110 No=2:sp_on 9,1:sp_on 8,0
66120 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66130 case 2:
66140 No=0:sp_on 13,1:sp_on 9,0
66150 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66160 case 0:
66170 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66180 case 7:
66190 No=4:sp_on 5,1:sp_on 4,0
66200 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66210 case 4:
66220 No=1:sp_on 6,1:sp_on 5,0
66230 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66240 case 1:
66250 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66260 end select
66270 endif
66280 '左へボタン 十字キー　左　or 　カーソル左
66290 if ((y2 = -1) or (key$ = chr$(29))) then
66300 select case No
66310 'Ok ボタン  Okから　左　０に行く
66320 case -1:
66330 No=0:sp_on 13,1:sp_on 14,0
66340 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66350 '0 ボタン  左　何もしない
66360 case 0:
66370 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66380 case 3:
66390 No=2:sp_on 9,1:sp_on 12,0:
66400 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66410 case 2:
66420 No=1:sp_on 6,1:sp_on 9,0:
66430 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66440 case 1:
66450 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66460 case 6:
66470 No=5:sp_on 8,1:sp_on 11,0
66480 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66490 case 5:
66500 No=4:sp_on 5,1:sp_on 8,0
66510 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66520 case 4:
66530 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66540 case 9:
66550 No=8:sp_on 7,1:sp_on 10,0
66560 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66570 case 8:
66580 No=7:sp_on 4,1:sp_on 7,0
66590 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66600 case 7:
66610 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66620 end select
66630 endif
66640 '右  十字キー　右　or カーソル　右
66650 if ((y2 = 1) or (key$ = chr$(28))) then
66660 select case No
66670 '0ボタンからokボタン右に移動
66680 case 0:
66690 No=-1:sp_on 14,1:sp_on 13,0
66700 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66710 '0ボタンからokボタン 右に移動　ここまで
66720 'OKボタンで右を押して何もしない
66730 case -1:
66740 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66750 case 1:
66760 No=2:sp_on 9,1:sp_on 6,0
66770 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66780 case 2:
66790 No=3:sp_on 12,1:sp_on 9,0
66800 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66810 case 3:
66820 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66830 case 4:
66840 No=5:sp_on 8,1:sp_on 5,0
66850 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66860 case 5:
66870 No=6:sp_on 11,1:sp_on 8,0
66880 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66890 case 7:
66900 No=8:sp_on 7,1:sp_on 4,0
66910 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66920 case 8:
66930 No=9:sp_on 10,1:sp_on 7,0
66940 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66950 case 9:
66960 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66970 case 6:
66980 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66990 end select
67000 'Okから右ボタンを押して何もしない ここまで
67010 endif
67020 '十字キー　ここまで
67030 '==============================
67040 'ここから
67050 '==============================
67060 if ((bg = 2) or (key$ = chr$(13))) then
67070 select case count
67080 case 0:
67090 count = 1
67100 if (No = -1) then
67110 count = 0:No=0
67120 buf_feMale_Born_Day(0) = No
67130 'Okボタンを押したとき
67140 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67150 else
67160 'Okボタン以外が押されたとき
67170 if (No >= 1 and No <= 2) then
67180 buf_female_year$="":buf_female_year$ = str$(No) + "***"
67190 buf_female_year = No:a= No
67200 buf_Jyoushi_Born_Day(0) = No
67210 locate 1,3
67220 color rgb(255,255,255)
67230 print "女性の生まれた年代(西暦4桁):";buf_female_year$
67240 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67250 else
67260 count=0
67270 ui_msg"数字が範囲外になります。"
67280 buf_female_year$="":buf_female_year=0
67290 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67300 endif
67310 endif
67320 case 1:
67330 count = 2
67340 if (No = -1) then
67350 count = 1
67360 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67370 else
67380 buf_female_year = a * 10 + No
67390 b=buf_female_year
67400 buf_year$ = str$(buf_female_year) + "**"
67410 buf_Jyoushi_Born_Day(0)=buf_female_year
67420 locate 1,3
67430 color rgb(255,255,255)
67440 print "                                                                "
67450 locate 1,3
67460 print "女性の生まれた年代(西暦4桁):" + buf_female_year$
67470 'if (No = -1) then
67480 'count=1
67490 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67500 endif
67510 case 2:
67520 count=3
67530 if (No=-1) then
67540 count =2
67550 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67560 else
67570 buf_female_year = b * 10 + No
67580 c=buf_female_year
67590 buf_female_year$ = str$(buf_female_year) + "*"
67600 buf_Jyoushi_Born_Day(0) = buf_female_year
67610 locate 1,3
67620 color rgb(255,255,255)
67630 print "                                        "
67640 locate 1,3
67650 print "女性の生まれた年代(西暦4桁):";buf_female_year$
67660 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67670 endif
67680 case 3:
67690 count=4
67700 if (No = -1) then
67710 No=0
67720 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67730 else
67740 buf_female_year = c * 10 + No
67750 buf_female_year$ = str$(buf_female_year)
67760 buf_Jyoushi_Born_Day(0) = buf_female_year
67770 locate 1,3
67780 color RGB(255,255,255)
67790 print "                                      "
67800 locate 1,3
67810 print "女性の生まれた年代(西暦4桁):";buf_female_year$
67820 buf_female_year=val(buf_female_year$)
67830 'year=val(buf_year$)
67840 'if (No=-1) then
67850 'goto Input_Born_Month:
67860 'else
67870 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67880 endif
67890 case 4:
67900 'bufyear=buf_year
67910 if (No=-1) then
67920 buf_female_year = val(buf_female_year$)
67930 buf_Jyoushi_Born_Day(0)=buf_female_year
67940 sp_on 14,0:No=0
67950 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67960 else
67970 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67980 endif
67990 end select
68000 endif
68010 '===========================
68020 'ここまでを部下のところにコピーする.
68030 '===========================
68040 if (bg2 = 2) then
68050 select case count2
68060 case 0:
68070 if (No = -1) then
68080 buf_female_year=0:buf_female_year$=trim$(""):buf_female_year$=trim$("****")
68090 count=0
68100 locate 1,3
68110 color rgb(255,255,255)
68120 print "                                      "
68130 locate 1,3
68140 print "女性の生まれた年代（西暦4桁):" + buf_female_year$
68150 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
68160 else
68170 '(buf_year=0) then
68180 buf_female_year=0:buf_year$="****"
68190 locate 1,3
68200 print "                                       "
68210 locate 1,3
68220 print "女性の生まれた年代(西暦4桁):"+buf_female_year$
68230 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
68240 'endif
68250 endif
68260 end select
68270 endif
68280 '-------生まれた年代　女性 ここまで-------------
68290 '-------生まれた月　女性 ここまで--------------
68300 Danjyo_Aisyou_Input_feMale_Born_Month:
68310 cls 3:play "":count=0:count2=0
68320 'No=-1:Okのとき
68330 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_female_Month$ = "**":buf_female_month=0
68340 for i=0 to 1
68350 buf_month(i)=0
68360 next i
68370 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
68380 '****************************************************************************************************
68390 'WUXG(1920x1200)の時ここから
68400 '****************************************************************************************************
68410 gload Gazo$ + "Screen1.png",0,0,0
68420 gload Gazo$ + "downscreen.png",0,0,800
68430 '****************************************************************************************************
68440 'WUXG(1920x1200)の時ここから
68450 '****************************************************************************************************
68460 'Init"kb:4"
68470 '音声ファイル再生 2023.06.07
68480 play Voice$ + "Input_Born_Month_Jyoushi_20230831.mp3"
68490 font 48
68500 locate 0,1
68510 '文字色：黒　 color rgb(0,0,0)
68520 '文字色:白
68530 color rgb(255,255,255)
68540 print "女性の生まれた月を入れて下さい" + chr$(13)
68550 '文字色:白
68560 color rgb(255,255,255)
68570 locate 1,3
68580 '文字色:白
68590 print "女性の生まれた月(1月~12月):"+buf_female_Month$
68600 color rgb(255,255,255)
68610 'locate 4,6:print ":7"
68620 'locate 9,6:print ":8"
68630 'locate 12,6:print ":9"
68640 locate 4,6
68650 '文字色:赤
68660 print ":7  :8  :9" + chr$(13)
68670 color rgb(255,255,255)
68680 locate 4,8
68690 print ":4  :5  :6" + chr$(13)
68700 color rgb(255,255,255)
68710 locate 4,10
68720 print ":1  :2  :3" + chr$(13)
68730 locate 4,12
68740 print "    :0"
68750 locate 12,12
68760 color rgb(0,0,255)
68770 print ":Ok"
68780 sp_on 4,0: sp_on 5,0:sp_on 6,0
68790 sp_on 7,0:sp_on 8,0:sp_on 9,0
68800 sp_on 10,0:sp_on 11,0:sp_on 12,0
68810 sp_on 13,0:sp_on 14,1
68820 '---------------------------------------------
68830 Danjyo_Aisyou_Input_feMale_Born_Month2:
68840 key$="":bg=0:y=0:y2=0:bg2=0
68850 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
68860 key$ = inkey$
68870 bg = strig(1)
68880 y = stick(1)
68890 y2 = stick(0)
68900 bg2 = strig(0)
68910 pause 200
68920 wend
68930 '十字キー　ここから
68940 '上の矢印　または、十字キー上
68950 if ((y = -1) or (key$ = chr$(30))) then
68960 select case No
68970 'No=-1:okのとき:初期の状態
68980 '0kボタンから３に移動
68990 '上に行く 処理
69000 case -1:
69010 No=3:sp_on 12,1:sp_on 14,0
69020 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69030 '選択肢:3
69040 '3ボタンから 6に移動
69050 case 3:
69060 No=6:sp_on 12,0:sp_on 11,1
69070 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69080 '6ボタンから ９に移動
69090 case 6:
69100 No=9:sp_on 10,1:sp_on 11,0
69110 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69120 '6ボタンから ９に移動　ここまで
69130 '9で上を押して何もしない
69140 case 9:
69150 '何もしない
69160 No=9
69170 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69180 '9で上を押しても何もしない　ここまで
69190 '上　 0ボタンから2ボタン
69200 'sp_on 6,1:1
69210 'sp_on 8,1:5
69220 'sp_on 7,1:7
69230 case 0:
69240 No=2:sp_on 13,0:sp_on 9,1:
69250 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69260 '上  0ボタンから2ボタン　ここまで
69270 '2から５になる 上
69280 case 2:
69290 No=5:sp_on 8,1:sp_on 9,0:
69300 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69310 case 5:
69320 No=8:sp_on 7,1:sp_on 8,0
69330 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69340 case 8:
69350 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69360 case 1:
69370 No=4:sp_on 5,1:sp_on 6,0
69380 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69390 case 4:
69400 No=7:sp_on 4,1:sp_on 5,0
69410 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69420 case 7:
69430 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69440 end select
69450 endif
69460 '左３　ここまで
69470 '下の矢印
69480 '中央 2
69490 if ((y=1) or (key$ = chr$(31))) then
69500 select case No
69510 '9から６に下げる
69520 case 9:
69530 No=6:sp_on 11,1:sp_on 10,0
69540 pause 200:goto　Danjyo_Aisyou_Input_feMale_Born_Month2:
69550 '6から３に下げる
69560 case 6:
69570 No=3:sp_on 12,1:sp_on 11,0
69580 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69590 '3から０ｋに変える
69600 case 3:
69610 No=-1:sp_on 14,1:sp_on 12,0
69620 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69630 'Okから下のボタンを押しても何もしない
69640 case -1:
69650 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69660 case 8:
69670 No=5:sp_on 8,1:sp_on 7,0
69680 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69690 case 5:
69700 No=2:sp_on 9,1:sp_on 8,0
69710 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69720 case 2:
69730 No=0:sp_on 13,1:sp_on 9,0
69740 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69750 case 0:
69760 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69770 case 7:
69780 No=4:sp_on 5,1:sp_on 4,0
69790 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69800 case 4:
69810 No=1:sp_on 6,1:sp_on 5,0
69820 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69830 case 1:
69840 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69850 end select
69860 endif
69870 '左へボタン 十字キー　左　or 　カーソル左
69880 if ((y2 = -1) or (key$ = chr$(29))) then
69890 select case No
69900 'Ok ボタン  Okから　左　０に行く
69910 case -1:
69920 No=0:sp_on 13,1:sp_on 14,0
69930 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69940 '0 ボタン  左　何もしない
69950 case 0:
69960 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69970 case 3:
69980 No=2:sp_on 9,1:sp_on 12,0:
69990 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70000 case 2:
70010 No=1:sp_on 6,1:sp_on 9,0:
70020 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70030 case 1:
70040 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70050 case 6:
70060 No=5:sp_on 8,1:sp_on 11,0
70070 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70080 case 5:
70090 No=4:sp_on 5,1:sp_on 8,0
70100 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70110 case 4:
70120 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70130 case 9:
70140 No=8:sp_on 7,1:sp_on 10,0
70150 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70160 case 8:
70170 No=7:sp_on 4,1:sp_on 7,0
70180 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70190 case 7:
70200 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70210 end select
70220 endif
70230 '右  十字キー　右　or カーソル　右
70240 if ((y2 = 1) or (key$ = chr$(28))) then
70250 select case No
70260 '0ボタンからokボタン右に移動
70270 case 0:
70280 No=-1:sp_on 14,1:sp_on 13,0
70290 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70300 '0ボタンからokボタン 右に移動　ここまで
70310 'OKボタンで右を押して何もしない
70320 case -1:
70330 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70340 case 1:
70350 No=2:sp_on 9,1:sp_on 6,0
70360 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70370 case 2:
70380 No=3:sp_on 12,1:sp_on 9,0
70390 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70400 case 3:
70410 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70420 case 4:
70430 No=5:sp_on 8,1:sp_on 5,0
70440 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70450 case 5:
70460 No=6:sp_on 11,1:sp_on 8,0
70470 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70480 case 7:
70490 No=8:sp_on 7,1:sp_on 4,0
70500 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70510 case 8:
70520 No=9:sp_on 10,1:sp_on 7,0
70530 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70540 case 9:
70550 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70560 case 6:
70570 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70580 end select
70590 'Okから右ボタンを押して何もしない ここまで
70600 endif
70610 '十字キー　ここまで
70620 '右の丸ボタン + Enter key 決定キー
70630 if ((bg=2) or (key$=chr$(13))) then
70640 select case count
70650 case 0:
70660 if (No=-1) then No=0
70670 count = 1:buf_female_Month$ = "**":buf_female_Month$ = str$(No):buf_female_month = No:c=No
70680 if (buf_female_month > 1 and buf_female_month < 10)  then
70690 buf_female_Month$ = str$(buf_female_month)
70700 'buf_month=No
70710 endif
70720 if (buf_female_month = 1)  then
70730 buf_female_Month$ = str$(buf_female_month) + "*"
70740 'c=buf_month
70750 endif
70760 locate 1,3
70770 print "                                     "
70780 color RGB(255,255,255)
70790 locate 1,3
70800 print "女性の生まれた月(1月~12月):" + buf_female_Month$
70810 goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70820 case 1:
70830 count = 2:
70840 'c = val(buf_Month$)
70850 if (No = -1) then
70860 'count=0
70870 No=0
70880 month=buf_female_month
70890 buf_female_month=val(buf_female_Month$)
70900 month=buf_female_month
70910 buf_Jyoushi_Born_Day(1)=month
70920 '生まれた日に飛ぶ
70930 goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70940 else
70950 buf_female_month = c*10 + No
70960 'if (buf_month = 1) then
70970 'buf_Month$ = str$(buf_month)
70980 'endif
70990 buf_female_Month$ = str$(buf_female_month)
71000 buf_Jyoushi_Born_Day(1) = buf_female_month
71010 locate 0,3
71020 print "                                           "
71030 locate 1,3
71040 color Rgb(255,255,255)
71050 print "女性の生まれた月(1月~12月):" + buf_female_Month$
71060 goto Danjyo_Aisyou_Input_feMale_Born_Month2:
71070 endif
71080 case 2:
71090 '==================================
71100 '何もしない
71110 'coun = 2
71120 '==================================
71130 'c= val(buf_Month$)
71140 'buf_month = c*10 + No
71150 'buf_Month$ = str$(buf_month)
71160 'locate 2,3
71170 'print "上司の生まれた月(1月～12月):";buf_Month$
71180 'goto Jyoushi_Input_Born_Month2:
71190 'case 3:
71200 'count=4
71210 'b=val(buf_month$)
71220 'buf_month=c*10+No
71230 'buf_Month$=str$(buf_month)
71240 'locate 2,3
71250 'print "上司の生まれた月(1月～12月):";buf_Month$
71260 'buf_month=val(buf_Month$)
71270 'year=val(buf_year$)
71280 if (No=-1) then
71290 No=0
71300 goto Danjyo_Aisyou_Input_Male_Born_Day:
71310 else
71320 goto Danjyo_Aisyou_Input_Male_Born_Day2:
71330 endif
71340 'case 4:
71350 'bufyear=buf_year
71360 'if (No=-1) then
71370 'buf_month = val(buf_Month$)
71380 'month = buf_month
71390 'sp_on 14,0
71400 'goto Input_Born_Day:
71410 'else
71420 'goto Input_Born_Month2:
71430 'endif
71440 end select
71450 endif
71460 '左の丸ボタン　キャンセル
71470 if (bg2=2) then
71480 select case count2
71490 case 0:
71500 if (No = -1) then
71510 buf_female_month=0:buf_female_Month$="**"
71520 count=0
71530 'goto rewrite2:
71540 else
71550 if ((No >= 1 and No <= 9) or (No >= 10 and No <= 12)) then
71560 buf_female_month = 0:buf_female_Month$ = "**"
71570 locate 0,3
71580 color rgb(255,255,255)
71590 print "                                       "
71600 goto rewrite2:
71610 if (No>12) then
71620 ui_msg"値が範囲外です。"
71630 goto rewrite2:
71640 endif
71650 endif
71660 endif
71670 rewrite2:
71680 locate 2,3
71690 color rgb(255,255,255)
71700 print "                                      "
71710 locate 2,3
71720 print "女性の生まれた月(1月~12月):"+buf_female_Month$
71730 goto Danjyo_Aisyou_Input_feMale_Born_Month2:
71740 end select
71750 'endif
71760 endif
71770 end
71780 '-------生まれた月　女性 ここまで-------------
71790 '-------生まれた日　女性 ここまで-------------
71800 Danjyo_Aisyou_Input_feMale_Born_Day:
71810 cls 3:play "":count=0:count2=0
71820 'No=-1:Okのとき
71830 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_female_Day$ = "**":buf_female_day = 0
71840 for i=0 to 1
71850 buf_female_day(i)=0
71860 next i
71870 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
71880 '****************************************************************************************************
71890 'WUXG(1920x1200)の時ここから
71900 '****************************************************************************************************
71910 gload Gazo$ + "Screen1.png",0,0,0
71920 gload Gazo$ + "downscreen.png",0,0,800
71930 '****************************************************************************************************
71940 'WUXG(1920x1200)の時ここまで
71950 '****************************************************************************************************
71960 'Init"kb:4"
71970 '音声ファイル再生 2023.06.07
71980 play Voice$ + "Input_Born_Month_Jyoushi_20230831.mp3"
71990 font 48
72000 locate 0,1
72010 '文字色：黒　 color rgb(0,0,0)
72020 '文字色:白
72030 color rgb(255,255,255)
72040 print "女性の生まれた日を入れて下さい" + chr$(13)
72050 '文字色:白
72060 color rgb(255,255,255)
72070 locate 1,3
72080 '文字色:白
72090 print "女性の生まれた日(1月~31月):" + buf_female_Day$
72100 color rgb(255,255,255)
72110 'locate 4,6:print ":7"
72120 'locate 9,6:print ":8"
72130 'locate 12,6:print ":9"
72140 locate 4,6
72150 '文字色:赤
72160 print ":7  :8  :9" + chr$(13)
72170 color rgb(255,255,255)
72180 locate 4,8
72190 print ":4  :5  :6" + chr$(13)
72200 color rgb(255,255,255)
72210 locate 4,10
72220 print ":1  :2  :3" + chr$(13)
72230 locate 4,12
72240 print "    :0"
72250 locate 12,12
72260 color rgb(0,0,255)
72270 print ":Ok"
72280 sp_on 4,0: sp_on 5,0:sp_on 6,0
72290 sp_on 7,0:sp_on 8,0:sp_on 9,0
72300 sp_on 10,0:sp_on 11,0:sp_on 12,0
72310 sp_on 13,0:sp_on 14,1
72320 '---------------------------------------------
72330 Danjyo_Aisyou_Input_feMale_Born_Day2:
72340 key$="":bg=0:y=0:y2=0:bg2=0
72350 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
72360 key$ = inkey$
72370 bg = strig(1)
72380 y = stick(1)
72390 y2 = stick(0)
72400 bg2 = strig(0)
72410 pause 200
72420 wend
72430 '十字キー　ここから
72440 '上の矢印　または、十字キー上
72450 if ((y = -1) or (key$ = chr$(30))) then
72460 select case No
72470 'No=-1:okのとき:初期の状態
72480 '0kボタンから３に移動
72490 '上に行く 処理
72500 case -1:
72510 No=3:sp_on 12,1:sp_on 14,0
72520 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72530 '選択肢:3
72540 '3ボタンから 6に移動
72550 case 3:
72560 No=6:sp_on 12,0:sp_on 11,1
72570 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72580 '6ボタンから ９に移動
72590 case 6:
72600 No=9:sp_on 10,1:sp_on 11,0
72610 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72620 '6ボタンから ９に移動　ここまで
72630 '9で上を押して何もしない
72640 case 9:
72650 '何もしない
72660 No=9
72670 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72680 '9で上を押しても何もしない　ここまで
72690 '上　 0ボタンから2ボタン
72700 'sp_on 6,1:1
72710 'sp_on 8,1:5
72720 'sp_on 7,1:7
72730 case 0:
72740 No=2:sp_on 13,0:sp_on 9,1:
72750 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72760 '上  0ボタンから2ボタン　ここまで
72770 '2から５になる 上
72780 case 2:
72790 No=5:sp_on 8,1:sp_on 9,0:
72800 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72810 case 5:
72820 No=8:sp_on 7,1:sp_on 8,0
72830 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72840 case 8:
72850 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72860 case 1:
72870 No=4:sp_on 5,1:sp_on 6,0
72880 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72890 case 4:
72900 No=7:sp_on 4,1:sp_on 5,0
72910 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72920 case 7:
72930 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72940 end select
72950 endif
72960 '左３　ここまで
72970 '下の矢印
72980 '中央 2
72990 if ((y=1) or (key$ = chr$(31))) then
73000 select case No
73010 '9から６に下げる
73020 case 9:
73030 No=6:sp_on 11,1:sp_on 10,0
73040 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73050 '6から３に下げる
73060 case 6:
73070 No=3:sp_on 12,1:sp_on 11,0
73080 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73090 '3から０ｋに変える
73100 case 3:
73110 No=-1:sp_on 14,1:sp_on 12,0
73120 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73130 'Okから下のボタンを押しても何もしない
73140 case -1:
73150 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73160 case 8:
73170 No=5:sp_on 8,1:sp_on 7,0
73180 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73190 case 5:
73200 No=2:sp_on 9,1:sp_on 8,0
73210 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73220 case 2:
73230 No=0:sp_on 13,1:sp_on 9,0
73240 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73250 case 0:
73260 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73270 case 7:
73280 No=4:sp_on 5,1:sp_on 4,0
73290 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73300 case 4:
73310 No=1:sp_on 6,1:sp_on 5,0
73320 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73330 case 1:
73340 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73350 end select
73360 endif
73370 '左へボタン 十字キー　左　or 　カーソル左
73380 if ((y2 = -1) or (key$ = chr$(29))) then
73390 select case No
73400 'Ok ボタン  Okから　左　０に行く
73410 case -1:
73420 No=0:sp_on 13,1:sp_on 14,0
73430 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73440 '0 ボタン  左　何もしない
73450 case 0:
73460 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73470 case 3:
73480 No=2:sp_on 9,1:sp_on 12,0:
73490 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73500 case 2:
73510 No=1:sp_on 6,1:sp_on 9,0:
73520 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73530 case 1:
73540 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73550 case 6:
73560 No=5:sp_on 8,1:sp_on 11,0
73570 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73580 case 5:
73590 No=4:sp_on 5,1:sp_on 8,0
73600 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73610 case 4:
73620 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73630 case 9:
73640 No=8:sp_on 7,1:sp_on 10,0
73650 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73660 case 8:
73670 No=7:sp_on 4,1:sp_on 7,0
73680 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73690 case 7:
73700 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73710 end select
73720 endif
73730 '右  十字キー　右　or カーソル　右
73740 if ((y2 = 1) or (key$ = chr$(28))) then
73750 select case No
73760 '0ボタンからokボタン右に移動
73770 case 0:
73780 No=-1:sp_on 14,1:sp_on 13,0
73790 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73800 '0ボタンからokボタン 右に移動　ここまで
73810 'OKボタンで右を押して何もしない
73820 case -1:
73830 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73840 case 1:
73850 No=2:sp_on 9,1:sp_on 6,0
73860 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73870 case 2:
73880 No=3:sp_on 12,1:sp_on 9,0
73890 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73900 case 3:
73910 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73920 case 4:
73930 No=5:sp_on 8,1:sp_on 5,0
73940 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73950 case 5:
73960 No=6:sp_on 11,1:sp_on 8,0
73970 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73980 case 7:
73990 No=8:sp_on 7,1:sp_on 4,0
74000 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
74010 case 8:
74020 No=9:sp_on 10,1:sp_on 7,0
74030 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
74040 case 9:
74050 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
74060 case 6:
74070 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
74080 end select
74090 'Okから右ボタンを押して何もしない ここまで
74100 endif
74110 '十字キー　ここまで
74120 '右の丸ボタン + Enter key 決定キー
74130 if ((bg=2) or (key$=chr$(13))) then
74140 select case count
74150 case 0:
74160 if (No=-1) then No=0
74170 count = 1:buf_female_Day$ = "**":buf_female_Day$ = str$(No):buf_female_day = No:c=No
74180 if (buf_female_day > 1 and buf_female_day < 10)  then
74190 buf_female_Day$ = str$(buf_female_day)
74200 'buf_month=No
74210 endif
74220 if (buf_female_day = 1)  then
74230 buf_female_Day$ = str$(buf_female_day) + "*"
74240 'c=buf_month
74250 endif
74260 locate 1,3
74270 print "                                     "
74280 color RGB(255,255,255)
74290 locate 1,3
74300 print "女性の生まれた日(1月~31月):" + buf_female_Day$
74310 goto Danjyo_Aisyou_Input_feMale_Born_Day2:
74320 case 1:
74330 count = 2:
74340 'c = val(buf_Month$)
74350 if (No = -1) then
74360 'count=0
74370 No=0
74380 day=buf_female_day
74390 buf_female_day=val(buf_female_day$)
74400 day=bu_female_day
74410 buf_female_day(1)=day
74420 '生まれた日に飛ぶ
74430 goto Danjyo_Aisyou_Input_feMale_Born_Day2:
74440 else
74450 bu_female_day = c*10 + No
74460 'if (buf_month = 1) then
74470 'buf_Month$ = str$(buf_month)
74480 'endif
74490 buf_female_day$ = str$(buf_female_day)
74500 buf_female_day(1) = buf_female_day
74510 locate 0,3
74520 print "                                           "
74530 locate 1,3
74540 color Rgb(255,255,255)
74550 print "女性の生まれた日(1月~31月):" + buf_female_Day$
74560 goto Danjyo_Aisyou_Input_feMale_Born_Day2:
74570 endif
74580 case 2:
74590 '==================================
74600 '何もしない
74610 'coun = 2
74620 '==================================
74630 'c= val(buf_Month$)
74640 'buf_month = c*10 + No
74650 'buf_Month$ = str$(buf_month)
74660 'locate 2,3
74670 'print "上司の生まれた月(1月～12月):";buf_Month$
74680 'goto Jyoushi_Input_Born_Month2:
74690 'case 3:
74700 'count=4
74710 'b=val(buf_month$)
74720 'buf_month=c*10+No
74730 'buf_Month$=str$(buf_month)
74740 'locate 2,3
74750 'print "上司の生まれた月(1月～12月):";buf_Month$
74760 'buf_month=val(buf_Month$)
74770 'year=val(buf_year$)
74780 if (No=-1) then
74790 No=0
74800 goto Danjyo_Aisyou_Input_Male_Born_Day:
74810 else
74820 goto Danjyo_Aisyou_Input_feMale_Born_Day2:
74830 endif
74840 'case 4:
74850 'bufyear=buf_year
74860 'if (No=-1) then
74870 'buf_month = val(buf_Month$)
74880 'month = buf_month
74890 'sp_on 14,0
74900 'goto Input_Born_Day:
74910 'else
74920 'goto Input_Born_Month2:
74930 'endif
74940 end select
74950 endif
74960 '左の丸ボタン　キャンセル
74970 if (bg2=2) then
74980 select case count2
74990 case 0:
75000 if (No = -1) then
75010 buf_female_day=0:buf_female_Day$="**"
75020 count=0
75030 'goto rewrite2:
75040 else
75050 if ((No >= 1 and No <= 9) or (No >= 10 and No <= 12)) then
75060 buf_female_day = 0:buf_female_Day$ = "**"
75070 locate 0,3
75080 color rgb(255,255,255)
75090 print "                                       "
75100 goto rewrite2:
75110 if (No>12) then
75120 ui_msg"値が範囲外です。"
75130 goto rewrite2:
75140 endif
75150 endif
75160 endif
75170 rewrite2:
75180 locate 2,3
75190 color rgb(255,255,255)
75200 print "                                      "
75210 locate 2,3
75220 print "女性の生まれた日(1月~31月):"+buf_female_Day$
75230 goto Danjyo_Aisyou_Input_feMale_Born_Day2:
75240 end select
75250 'endif
75260 endif
75270 end
75280 '-------生まれた日　女性 ここまで-------------
75290 '1.男女の相性 ここまで
75300 '2.ビジネスの相性　
75310 '1.1人目のビジネスの相性　名前入力　1人目
75320 Business_Aishou_Input_1_parson:
75330 No=0:color RGB(255,255,255)
75340 cls 3:init "kb:2"
75350 '****************************************************************************************************
75360 'WUXG(1920x1200)の時ここから
75370 '****************************************************************************************************
75380 gload Gazo$ + "Screen1.png",0,0,0
75390 gload Gazo$ + "downscreen.png",0,0,800
75400 '****************************************************************************************************
75410 'WUXG(1920x1200)の時ここまで
75420 '****************************************************************************************************
75430 play "":color rgb(255,0,0):name$ = ""
75440 locate 0,1
75450 print "ビジネスの相性 1人目" + chr$(13) + chr$(13)
75460 color rgb(255,255,255):
75470 locate 0,3
75480 print "ビジネスの相性を求めます。1人目の名前を" + chr$(13)
75490 print "入れてください" + chr$(13)
75500 locate 0,15:color rgb(0,0,0)
75510 Input "1人目の名前:",name$
75520 'color rgb(0,0,0)
75530 'locate 0,13:print "                                     "
75540 'locate 0,13:print "1人目の名前を入力してエンターキー":
75550 'buffer_name$(0):1人目の名前
75560 buffer_name$(0) = name$:
75570 goto Business_Aishou_Input_2_Parson:
75580 '2.2人目のビジネスの相性 名前入力 2人目
75590 Business_Aishou_Input_2_Parson:
75600 cls 3:init "kb:2":name$ = "":No=0
75610 '****************************************************************************************************
75620 'WUXG(1920x1200)の時ここから
75630 '****************************************************************************************************
75640 gload Gazo$ + "Screen1.png",0,0,0
75650 gload Gazo$ + "downscreen.png",0,0,800
75660 '****************************************************************************************************
75670 'WUXG(1920x1200)の時ここまで
75680 '****************************************************************************************************
75690 color rgb(255,0,0)
75700 'Title
75710 locate 0,1
75720 print "ビジネスの相性　2人目"
75730 locate 0,3
75740 color rgb(255,255,255)
75750 print "ビジネスの相性を求めます。2人目の名前を" + chr$(13)
75760 print "入れてください" + chr$(13)
75770 locate 0,15:color rgb(0,0,0)
75780 Input "2人目の名前:",name$
75790 'color rgb(0,0,0)
75800 'locate 0,15:print "                                              "
75810 'locate 0,15:print "2人目の名前を入力してエンター ":
75820 '2人目
75830 '2人目の名前を入れるに代入
75840 buffer_name$(1) = name$:
75850 goto Select_jyoushi:
75860 '3.上司の選択
75870 Select_jyoushi:
75880 '****************************************************************************************************
75890 'WUXG(1920x1200)の時ここから
75900 '****************************************************************************************************
75910 cls 3:gload Gazo$ + "Screen1.png",0,0,0
75920 gload Gazo$ + "downscreen.png",0,0,800
75930 '****************************************************************************************************
75940 'WUXG(1920x1200)の時ここまで
75950 '****************************************************************************************************
75960 init "kb:4":No=0
75970 color rgb(0,0,255)
75980 locate 1,1
75990 print "上司の選択"
76000 color rgb(255,255,255)
76010 locate 0,4:print "名前から上司の方を選んでください"
76020 locate 0,6
76030 print " :";buffer_name$(0);"が上 司";chr$(13)
76040 locate 0,8
76050 print " :";buffer_name$(1);"が上 司";chr$(13)
76060 locate 0,15:
76070 print "                                     "
76080 locate 0,15:color rgb(0,0,0)
76090 print "上司の方を選んで右の丸ボタン"
76100 sp_on 0,1:sp_on 1,0:sp_on 2,0
76110 Select_jyoushi2:
76120 'ここでNo=0をおいてはいけない
76130 y=0:key$="":bg=0:
76140 while ((key$ <> chr$(13)) and (y <> 1) and (y <> -1) and (bg <> 2))
76150 y = stick(1)
76160 key$ = inkey$
76170 bg = strig(1)
76180 pause 5
76190 wend
76200 '1.カーソル下の処理　or 十字キーの下処理
76210 if ((key$ = chr$(31)) or (y = 1)) then
76220 select case No
76230 case 0:
76240 No=1:sp_on 1,1:sp_on 0,0:pause 200:goto Select_jyoushi2:'上司の方を選択
76250 case 1:
76260 No=0:sp_on 0,1:sp_on 1,0:pause 200:goto Select_jyoushi2:'上司の方を選択
76270 end select
76280 endif
76290 '2.カーソル上処理　or 十字キーの上の処理
76300 if ((key$ = chr$(30)) or (y = -1)) then
76310 select case No
76320 case 0:
76330 No=1:sp_on 1,1:sp_on 0,0:pause 200:goto Select_jyoushi2:
76340 case 1:
76350 No=0:sp_on 0,1:sp_on 1,0:pause 200:goto Select_jyoushi2:
76360 end select
76370 endif
76380 if ((key$ = chr$(13)) or (bg = 2)) then
76390 select case No
76400 case 0:
76410 '上司(name1)を配列に代入
76420 buffer_name$(2) = buffer_name$(0):cls 3:color rgb(255,255,255):print buffer_name$(2);chr$(13):sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:goto Jyoushi_Input_Seireki:
76430 case 1:
76440 '上司（name2)を配列に代入
76450 buffer_name$(2) = buffer_name$(1):print buffer_name$(2);chr$(13):sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:goto Jyoushi_Input_Seireki:
76460 end select
76470 endif
76480 '3.決定ボタン　Enter or 右の丸ボタン
76490 '1.誕生日入力
76500 '1-1.生まれた年を入力
76510 'Jyoushi_born_year:
76520 'cls 3:gload Gazo$ + "Screen1.png",0,0,0
76530 '---------------------------------------------'
76540 '誕生日入力(生れた年代)
76550 Jyoushi_Input_Seireki:
76560 'buf_Jyoushi_Born_Year:上司の生まれた年代
76570 'buf_Jyoushi_Born_Day(0) = born_year
76580 cls 3:play "":count=0:count2=0
76590 init"kb:4"
76600 'No=-1:Okのとき
76610 :key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_year$ = "****"
76620 for i=0 to 3
76630 buf_Jyoushi_Born_Day(i)=0
76640 next i
76650 '****************************************************************************************************
76660 'WUXG(1920x1200)の時ここから
76670 '****************************************************************************************************
76680 gload Gazo$ + "Screen2.png",0,0,0
76690 gload Gazo$ + "downscreen.png",0,0,800
76700 '****************************************************************************************************
76710 'WUXG(1920x1200)の時ここまで
76720 '****************************************************************************************************
76730 'Init"kb:2"
76740 '音声ファイル再生 2023.06.07
76750 play Voice$ + "Input_Born_Year_Jyoushi_20230831.mp3"
76760 font 48
76770 locate 0,1
76780 '文字色：黒　 color rgb(0,0,0)
76790 color rgb(255,255,255)
76800 print "上司の生まれた年代を入れて下さい" + chr$(13)
76810 color rgb(255,255,255)
76820 locate 1,3
76830 print "上司の生まれた年代(西暦4桁):";buf_year$
76840 color rgb(255,255,255)
76850 'locate 4,6:print ":7"
76860 'locate 9,6:print ":8"
76870 'locate 12,6:print ":9"
76880 'locate 4,6
76890 'print ":7  :8  :9" + chr$(13)
76900 'color rgb(255,255,255)
76910 'locate 4,8
76920 'print ":4  :5  :6" + chr$(13)
76930 'color rgb(255,255,255)
76940 'locate 4,10
76950 'print ":1  :2  :3" + chr$(13)
76960 'locate 4,12
76970 'print "    :0"
76980 'locate 12,12
76990 'color rgb(0,0,255)
77000 'print ":Ok"
77010 sp_on 4,0: sp_on 5,0:sp_on 6,0
77020 sp_on 7,0:sp_on 8,0:sp_on 9,0
77030 sp_on 10,0:sp_on 11,0:sp_on 12,0
77040 sp_on 13,0:sp_on 14,1
77050 Jyoushi_Input_Seireki2:
77060 key$="":bg=0:y=0:y2=0:bg2=0:
77070 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
77080 key$ = inkey$
77090 bg = strig(1)
77100 y = stick(1)
77110 y2 = stick(0)
77120 bg2=strig(0)
77130 pause 200
77140 wend
77150 '十字キー　ここから
77160 '上の矢印　または、十字キー上
77170 if ((y = -1) or (key$ = chr$(30))) then
77180 select case No
77190 'No=-1:okのとき:初期の状態
77200 '0kボタンから３に移動
77210 '上に行く 処理
77220 case -1:
77230 No=3:sp_on 12,1:sp_on 14,0
77240 pause 200:goto Jyoushi_Input_Seireki2:
77250 '選択肢:3
77260 '3ボタンから 6に移動
77270 case 3:
77280 No=6:sp_on 12,0:sp_on 11,1
77290 pause 200:goto Jyoushi_Input_Seireki2:
77300 '6ボタンから ９に移動
77310 case 6:
77320 No=9:sp_on 10,1:sp_on 11,0
77330 pause 200:goto Jyoushi_Input_Seireki2:
77340 '6ボタンから ９に移動　ここまで
77350 '9で上を押して何もしない
77360 case 9:
77370 '何もしない
77380 No=9
77390 pause 200:goto Jyoushi_Input_Seireki2:
77400 '9で上を押しても何もしない　ここまで
77410 '上　 0ボタンから2ボタン
77420 'sp_on 6,1:1
77430 'sp_on 8,1:5
77440 'sp_on 7,1:7
77450 case 0:
77460 No=2:sp_on 13,0:sp_on 9,1:
77470 pause 200:goto Jyoushi_Input_Seireki2:
77480 '上  0ボタンから2ボタン　ここまで
77490 '2から５になる 上
77500 case 2:
77510 No=5:sp_on 8,1:sp_on 9,0:
77520 pause 200:goto Jyoushi_Input_Seireki2:
77530 case 5:
77540 No=8:sp_on 7,1:sp_on 8,0
77550 pause 200:goto Jyoushi_Input_Seireki2:
77560 case 8:
77570 pause 200:goto Jyoushi_Input_Seireki2:
77580 case 1:
77590 No=4:sp_on 5,1:sp_on 6,0
77600 pause 200:goto Jyoushi_Input_Seireki2:
77610 case 4:
77620 No=7:sp_on 4,1:sp_on 5,0
77630 pause 200:goto Jyoushi_Input_Seireki2:
77640 case 7:
77650 pause 200:goto Jyoushi_Input_Seireki2:
77660 end select
77670 endif
77680 '左３　ここまで
77690 '下の矢印
77700 '中央 2
77710 if ((y=1) or (key$ = chr$(31))) then
77720 select case No
77730 '9から６に下げる
77740 case 9:
77750 No=6:sp_on 11,1:sp_on 10,0
77760 pause 200:goto Jyoushi_Input_Seireki2:
77770 '6から３に下げる
77780 case 6:
77790 No=3:sp_on 12,1:sp_on 11,0
77800 pause 200:goto Jyoushi_Input_Seireki2:
77810 '3から０ｋに変える
77820 case 3:
77830 No=-1:sp_on 14,1:sp_on 12,0
77840 pause 200:goto Jyoushi_Input_Seireki2:
77850 'Okから下のボタンを押しても何もしない
77860 case -1:
77870 pause 200:goto Jyoushi_Input_Seireki2:
77880 case 8:
77890 No=5:sp_on 8,1:sp_on 7,0
77900 pause 200:goto Jyoushi_Input_Seireki2:
77910 case 5:
77920 No=2:sp_on 9,1:sp_on 8,0
77930 pause 200:goto Jyoushi_Input_Seireki2:
77940 case 2:
77950 No=0:sp_on 13,1:sp_on 9,0
77960 pause 200:goto Jyoushi_Input_Seireki2:
77970 case 0:
77980 pause 200:goto Jyoushi_Input_Seireki2:
77990 case 7:
78000 No=4:sp_on 5,1:sp_on 4,0
78010 pause 200:goto Jyoushi_Input_Seireki2:
78020 case 4:
78030 No=1:sp_on 6,1:sp_on 5,0
78040 pause 200:goto Jyoushi_Input_Seireki2:
78050 case 1:
78060 pause 200:goto Jyoushi_Input_Seireki2:
78070 end select
78080 endif
78090 '左へボタン 十字キー　左　or 　カーソル左
78100 if ((y2 = -1) or (key$ = chr$(29))) then
78110 select case No
78120 'Ok ボタン  Okから　左　０に行く
78130 case -1:
78140 No=0:sp_on 13,1:sp_on 14,0
78150 pause 200:goto Jyoushi_Input_Seireki2:
78160 '0 ボタン  左　何もしない
78170 case 0:
78180 pause 200:goto Jyoushi_Input_Seireki2:
78190 case 3:
78200 No=2:sp_on 9,1:sp_on 12,0:
78210 pause 200:goto Jyoushi_Input_Seireki2:
78220 case 2:
78230 No=1:sp_on 6,1:sp_on 9,0:
78240 pause 200:goto Jyoushi_Input_Seireki2:
78250 case 1:
78260 pause 200:goto Jyoushi_Input_Seireki2:
78270 case 6:
78280 No=5:sp_on 8,1:sp_on 11,0
78290 pause 200:goto Jyoushi_Input_Seireki2:
78300 case 5:
78310 No=4:sp_on 5,1:sp_on 8,0
78320 pause 200:goto Jyoushi_Input_Seireki2:
78330 case 4:
78340 pause 200:goto Jyoushi_Input_Seireki2:
78350 case 9:
78360 No=8:sp_on 7,1:sp_on 10,0
78370 pause 200:goto Jyoushi_Input_Seireki2:
78380 case 8:
78390 No=7:sp_on 4,1:sp_on 7,0
78400 pause 200:goto Jyoushi_Input_Seireki2:
78410 case 7:
78420 pause 200:goto Jyoushi_Input_Seireki2:
78430 end select
78440 endif
78450 '右  十字キー　右　or カーソル　右
78460 if ((y2 = 1) or (key$ = chr$(28))) then
78470 select case No
78480 '0ボタンからokボタン右に移動
78490 case 0:
78500 No=-1:sp_on 14,1:sp_on 13,0
78510 pause 200:goto Jyoushi_Input_Seireki2:
78520 '0ボタンからokボタン 右に移動　ここまで
78530 'OKボタンで右を押して何もしない
78540 case -1:
78550 pause 200:goto Jyoushi_Input_Seireki2:
78560 case 1:
78570 No=2:sp_on 9,1:sp_on 6,0
78580 pause 200:goto Jyoushi_Input_Seireki2:
78590 case 2:
78600 No=3:sp_on 12,1:sp_on 9,0
78610 pause 200:goto Jyoushi_Input_Seireki2:
78620 case 3:
78630 pause 200:goto Jyoushi_Input_Seireki2:
78640 case 4:
78650 No=5:sp_on 8,1:sp_on 5,0
78660 pause 200:goto Jyoushi_Input_Seireki2:
78670 case 5:
78680 No=6:sp_on 11,1:sp_on 8,0
78690 pause 200:goto Jyoushi_Input_Seireki2:
78700 case 7:
78710 No=8:sp_on 7,1:sp_on 4,0
78720 pause 200:goto Jyoushi_Input_Seireki2:
78730 case 8:
78740 No=9:sp_on 10,1:sp_on 7,0
78750 pause 200:goto Jyoushi_Input_Seireki2:
78760 case 9:
78770 pause 200:goto Jyoushi_Input_Seireki2:
78780 case 6:
78790 pause 200:goto Jyoushi_Input_Seireki2:
78800 end select
78810 'Okから右ボタンを押して何もしない ここまで
78820 endif
78830 '十字キー　ここまで
78840 '==============================
78850 'ここから
78860 '==============================
78870 if ((bg = 2) or (key$ = chr$(13))) then
78880 select case count
78890 case 0:
78900 count = 1
78910 if (No = -1) then
78920 count = 0:No=0
78930 buf_Jyoushi_Born_Day(0) = No
78940 'Okボタンを押したとき
78950 goto Jyoushi_Input_Seireki2:
78960 else
78970 'Okボタン以外が押されたとき
78980 if (No >= 1 and No <= 2) then
78990 buf_year$="":buf_year$ = str$(No) + "***"
79000 buf_year = No:a= No
79010 buf_Jyoushi_Born_Day(0) = No
79020 locate 1,3
79030 color rgb(255,255,255)
79040 print "上司の生まれた年代(西暦4桁):";buf_year$
79050 goto Jyoushi_Input_Seireki2:
79060 else
79070 count=0
79080 ui_msg"数字が範囲外になります。"
79090 buf_year$="":buf_year=0
79100 goto Jyoushi_Input_Seireki2:
79110 endif
79120 endif
79130 case 1:
79140 count = 2
79150 if (No = -1) then
79160 count = 1
79170 goto Jyoushi_Input_Seireki2:
79180 else
79190 buf_year = a * 10 + No
79200 b=buf_year
79210 buf_year$ = str$(buf_year) + "**"
79220 buf_Jyoushi_Born_Day(0)=buf_year
79230 locate 1,3
79240 color rgb(255,255,255)
79250 print "                                                                "
79260 locate 1,3
79270 print "上司の生まれた年代(西暦4桁):" + buf_year$
79280 'if (No = -1) then
79290 'count=1
79300 goto Jyoushi_Input_Seireki2:
79310 endif
79320 case 2:
79330 count=3
79340 if (No=-1) then
79350 count =2
79360 goto Jyoushi_Input_Seireki2:
79370 else
79380 buf_year = b * 10 + No
79390 c=buf_year
79400 buf_year$ = str$(buf_year) + "*"
79410 buf_Jyoushi_Born_Day(0) = buf_year
79420 locate 1,3
79430 color rgb(255,255,255)
79440 print "                                        "
79450 locate 1,3
79460 print "上司の生まれた年代(西暦4桁):";buf_year$
79470 goto Jyoushi_Input_Seireki2:
79480 endif
79490 case 3:
79500 count=4
79510 if (No = -1) then
79520 No=0
79530 goto Jyoushi_Input_Seireki2:
79540 else
79550 buf_year = c * 10 + No
79560 buf_year$ = str$(buf_year)
79570 buf_Jyoushi_Born_Day(0) = buf_year
79580 locate 1,3
79590 color RGB(255,255,255)
79600 print "                                      "
79610 locate 1,3
79620 print "上司の生まれた年代(西暦4桁):";buf_year$
79630 buf_year=val(buf_year$)
79640 'year=val(buf_year$)
79650 'if (No=-1) then
79660 'goto Input_Born_Month:
79670 'else
79680 goto Jyoushi_Input_Seireki2:
79690 endif
79700 case 4:
79710 'bufyear=buf_year
79720 if (No=-1) then
79730 buf_year = val(buf_year$)
79740 buf_Jyoushi_Born_Day(0)=buf_year
79750 sp_on 14,0:No=0
79760 goto Jyoushi_Input_Born_Month:
79770 else
79780 goto Jyoushi_Input_Seireki2:
79790 endif
79800 end select
79810 endif
79820 '===========================
79830 'ここまでを部下のところにコピーする.
79840 '===========================
79850 if (bg2 = 2) then
79860 select case count2
79870 case 0:
79880 if (No = -1) then
79890 buf_year=0:buf_year$=trim$(""):buf_year$=trim$("****")
79900 count=0
79910 locate 1,3
79920 color rgb(255,255,255)
79930 print "                                      "
79940 locate 1,3
79950 print "上司の生まれた年代（西暦4桁):" + buf_year$
79960 goto Jyoushi_Input_Seireki2:
79970 else
79980 '(buf_year=0) then
79990 buf_year=0:buf_year$="****"
80000 locate 1,3
80010 print "                                       "
80020 locate 1,3
80030 print "上司の生まれた年代(西暦4桁):"+buf_year$
80040 goto Jyoushi_Input_Seireki2:
80050 'endif
80060 endif
80070 end select
80080 endif
80090 'Input"上司の生れた年代(4桁,〜2025年):",year
80100 'if year > 2025 then goto Jyoushi_Input_Seireki:
80110 'if year = 123 then cls 3:cls 4:goto Main_Screen:
80120 '"4桁目"
80130 'bufyear4 = fix(year / 1000)
80140 '"3桁目"
80150 'bufyear3 = fix((year - (bufyear4 * 1000)) / 100)
80160 '"2桁目"
80170 'bufyear2 = fix((year - ((bufyear4 * 1000)+(bufyear3*100)))/10)
80180 '"1桁目"
80190 'bufyear1 = fix((year - ((bufyear4*
80200 'bufyear = bufyear1+bufyear2+bufyear3+bufyear4
80210 '2.生まれた月を入力
80220 Jyoushi_Input_Born_Month:
80230 cls 3:play "":count=0:count2=0
80240 'No=-1:Okのとき
80250 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_Month$ = "**":buf_month=0
80260 for i=0 to 1
80270 buf_month(i)=0
80280 next i
80290 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
80300 '****************************************************************************************************
80310 'WUXG(1920x1200)の時ここから
80320 '****************************************************************************************************
80330 gload Gazo$ + "Screen2.png",0,0,0
80340 gload Gazo$ + "downscreen.png",0,0,800
80350 '****************************************************************************************************
80360 'WUXG(1920x1200)の時ここまで
80370 '****************************************************************************************************
80380 'Init"kb:4"
80390 '音声ファイル再生 2023.06.07
80400 play Voice$ + "Input_Born_Month_Jyoushi_20230831.mp3"
80410 font 48
80420 locate 0,1
80430 '文字色：黒　 color rgb(0,0,0)
80440 '文字色:白
80450 color rgb(255,255,255)
80460 print "上司の生まれた月を入れて下さい" + chr$(13)
80470 '文字色:白
80480 color rgb(255,255,255)
80490 locate 1,3
80500 '文字色:白
80510 print "上司の生まれた月(1月~12月):"+buf_Month$
80520 color rgb(255,255,255)
80530 'locate 4,6:print ":7"
80540 'locate 9,6:print ":8"
80550 'locate 12,6:print ":9"
80560 'locate 4,6
80570 '文字色:赤
80580 'print ":7  :8  :9" + chr$(13)
80590 'color rgb(255,255,255)
80600 'locate 4,8
80610 'print ":4  :5  :6" + chr$(13)
80620 'color rgb(255,255,255)
80630 'locate 4,10
80640 'print ":1  :2  :3" + chr$(13)
80650 'locate 4,12
80660 'print "    :0"
80670 'locate 12,12
80680 'color rgb(0,0,255)
80690 'print ":Ok"
80700 sp_on 4,0: sp_on 5,0:sp_on 6,0
80710 sp_on 7,0:sp_on 8,0:sp_on 9,0
80720 sp_on 10,0:sp_on 11,0:sp_on 12,0
80730 sp_on 13,0:sp_on 14,1
80740 Jyoushi_Input_Born_Month2:
80750 key$="":bg=0:y=0:y2=0:bg2=0
80760 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
80770 key$ = inkey$
80780 bg = strig(1)
80790 y = stick(1)
80800 y2 = stick(0)
80810 bg2 = strig(0)
80820 pause 200
80830 wend
80840 '十字キー　ここから
80850 '上の矢印　または、十字キー上
80860 if ((y = -1) or (key$ = chr$(30))) then
80870 select case No
80880 'No=-1:okのとき:初期の状態
80890 '0kボタンから３に移動
80900 '上に行く 処理
80910 case -1:
80920 No=3:sp_on 12,1:sp_on 14,0
80930 pause 200:goto Jyoushi_Input_Born_Month2:
80940 '選択肢:3
80950 '3ボタンから 6に移動
80960 case 3:
80970 No=6:sp_on 12,0:sp_on 11,1
80980 pause 200:goto Jyoushi_Input_Born_Month2:
80990 '6ボタンから ９に移動
81000 case 6:
81010 No=9:sp_on 10,1:sp_on 11,0
81020 pause 200:goto Jyoushi_Input_Born_Month2:
81030 '6ボタンから ９に移動　ここまで
81040 '9で上を押して何もしない
81050 case 9:
81060 '何もしない
81070 No=9
81080 pause 200:goto Jyoushi_Input_Born_Month2:
81090 '9で上を押しても何もしない　ここまで
81100 '上　 0ボタンから2ボタン
81110 'sp_on 6,1:1
81120 'sp_on 8,1:5
81130 'sp_on 7,1:7
81140 case 0:
81150 No=2:sp_on 13,0:sp_on 9,1:
81160 pause 200:goto Jyoushi_Input_Born_Month2:
81170 '上  0ボタンから2ボタン　ここまで
81180 '2から５になる 上
81190 case 2:
81200 No=5:sp_on 8,1:sp_on 9,0:
81210 pause 200:goto Jyoushi_Input_Born_Month2:
81220 case 5:
81230 No=8:sp_on 7,1:sp_on 8,0
81240 pause 200:goto Jyoushi_Input_Born_Month2:
81250 case 8:
81260 pause 200:goto Input_Born_Month2:
81270 case 1:
81280 No=4:sp_on 5,1:sp_on 6,0
81290 pause 200:goto Jyoushi_Input_Born_Month2:
81300 case 4:
81310 No=7:sp_on 4,1:sp_on 5,0
81320 pause 200:goto Jyoushi_Input_Born_Month2:
81330 case 7:
81340 pause 200:goto Input_Born_Month2:
81350 end select
81360 endif
81370 '左３　ここまで
81380 '下の矢印
81390 '中央 2
81400 if ((y=1) or (key$ = chr$(31))) then
81410 select case No
81420 '9から６に下げる
81430 case 9:
81440 No=6:sp_on 11,1:sp_on 10,0
81450 pause 200:goto Jyoushi_Input_Born_Month2:
81460 '6から３に下げる
81470 case 6:
81480 No=3:sp_on 12,1:sp_on 11,0
81490 pause 200:goto Jyoushi_Input_Born_Month2:
81500 '3から０ｋに変える
81510 case 3:
81520 No=-1:sp_on 14,1:sp_on 12,0
81530 pause 200:goto Jyoushi_Input_Born_Month2:
81540 'Okから下のボタンを押しても何もしない
81550 case -1:
81560 pause 200:goto Jyoushi_Input_Born_Month2:
81570 case 8:
81580 No=5:sp_on 8,1:sp_on 7,0
81590 pause 200:goto Jyoushi_Input_Born_Month2:
81600 case 5:
81610 No=2:sp_on 9,1:sp_on 8,0
81620 pause 200:goto Jyoushi_Input_Born_Month2:
81630 case 2:
81640 No=0:sp_on 13,1:sp_on 9,0
81650 pause 200:goto Jyoushi_Input_Born_Month2:
81660 case 0:
81670 pause 200:goto Jyoushi_Input_Born_Month2:
81680 case 7:
81690 No=4:sp_on 5,1:sp_on 4,0
81700 pause 200:goto Jyoushi_Input_Born_Month2:
81710 case 4:
81720 No=1:sp_on 6,1:sp_on 5,0
81730 pause 200:goto Jyoushi_Input_Born_Month2:
81740 case 1:
81750 pause 200:goto Jyoushi_Input_Born_Month2:
81760 end select
81770 endif
81780 '左へボタン 十字キー　左　or 　カーソル左
81790 if ((y2 = -1) or (key$ = chr$(29))) then
81800 select case No
81810 'Ok ボタン  Okから　左　０に行く
81820 case -1:
81830 No=0:sp_on 13,1:sp_on 14,0
81840 pause 200:goto Jyoushi_Input_Born_Month2:
81850 '0 ボタン  左　何もしない
81860 case 0:
81870 pause 200:goto Jyoushi_Input_Born_Month2:
81880 case 3:
81890 No=2:sp_on 9,1:sp_on 12,0:
81900 pause 200:goto Jyoushi_Input_Born_Month2:
81910 case 2:
81920 No=1:sp_on 6,1:sp_on 9,0:
81930 pause 200:goto Jyoushi_Input_Born_Month2:
81940 case 1:
81950 pause 200:goto Jyoushi_Input_Born_Month2:
81960 case 6:
81970 No=5:sp_on 8,1:sp_on 11,0
81980 pause 200:goto Jyoushi_Input_Born_Month2:
81990 case 5:
82000 No=4:sp_on 5,1:sp_on 8,0
82010 pause 200:goto Jyoushi_Input_Born_Month2:
82020 case 4:
82030 pause 200:goto Jyoushi_Input_Born_Month2:
82040 case 9:
82050 No=8:sp_on 7,1:sp_on 10,0
82060 pause 200:goto Input_Born_Month2:
82070 case 8:
82080 No=7:sp_on 4,1:sp_on 7,0
82090 pause 200:goto Jyoushi_Input_Born_Month2:
82100 case 7:
82110 pause 200:goto Jyoushi_Input_Born_Month2:
82120 end select
82130 endif
82140 '右  十字キー　右　or カーソル　右
82150 if ((y2 = 1) or (key$ = chr$(28))) then
82160 select case No
82170 '0ボタンからokボタン右に移動
82180 case 0:
82190 No=-1:sp_on 14,1:sp_on 13,0
82200 pause 200:goto Jyoushi_Input_Born_Month2:
82210 '0ボタンからokボタン 右に移動　ここまで
82220 'OKボタンで右を押して何もしない
82230 case -1:
82240 pause 200:goto Jyoushi_Input_Born_Month2:
82250 case 1:
82260 No=2:sp_on 9,1:sp_on 6,0
82270 pause 200:goto Jyoushi_Input_Born_Month2:
82280 case 2:
82290 No=3:sp_on 12,1:sp_on 9,0
82300 pause 200:goto Jyoushi_Input_Born_Month2:
82310 case 3:
82320 pause 200:goto Jyoushi_Input_Born_Month2:
82330 case 4:
82340 No=5:sp_on 8,1:sp_on 5,0
82350 pause 200:goto Jyoushi_Input_Born_Month2:
82360 case 5:
82370 No=6:sp_on 11,1:sp_on 8,0
82380 pause 200:goto Jyoushi_Input_Born_Month2:
82390 case 7:
82400 No=8:sp_on 7,1:sp_on 4,0
82410 pause 200:goto Jyoushi_Input_Born_Month2:
82420 case 8:
82430 No=9:sp_on 10,1:sp_on 7,0
82440 pause 200:goto Jyoushi_Input_Born_Month2:
82450 case 9:
82460 pause 200:goto Jyoushi_Input_Born_Month2:
82470 case 6:
82480 pause 200:goto Jyoushi_Input_Born_Month2:
82490 end select
82500 'Okから右ボタンを押して何もしない ここまで
82510 endif
82520 '十字キー　ここまで
82530 '右の丸ボタン + Enter key 決定キー
82540 if ((bg=2) or (key$=chr$(13))) then
82550 select case count
82560 case 0:
82570 if (No=-1) then No=0
82580 count = 1:buf_Month$ = "**":buf_Month$ = str$(No):buf_month = No:c=No
82590 if (buf_month > 1 and buf_month < 10)  then
82600 buf_Month$ = str$(buf_month)
82610 'buf_month=No
82620 endif
82630 if (buf_month = 1)  then
82640 buf_Month$ = str$(buf_month) + "*"
82650 'c=buf_month
82660 endif
82670 locate 1,3
82680 print "                                     "
82690 color RGB(255,255,255)
82700 locate 1,3
82710 print "上司の生まれた月(1月~12月):" + buf_Month$
82720 goto Jyoushi_Input_Born_Month2:
82730 case 1:
82740 count = 2:
82750 'c = val(buf_Month$)
82760 if (No = -1) then
82770 'count=0
82780 No=0
82790 month=buf_month
82800 buf_month=val(buf_Month$)
82810 month=buf_month
82820 buf_Jyoushi_Born_Day(1)=month
82830 '生まれた日に飛ぶ
82840 goto Jyoushi_Input_Born_Day:
82850 else
82860 buf_month = c*10 + No
82870 'if (buf_month = 1) then
82880 'buf_Month$ = str$(buf_month)
82890 'endif
82900 buf_Month$ = str$(buf_month)
82910 buf_Jyoushi_Born_Day(1) = buf_month
82920 locate 0,3
82930 print "                                           "
82940 locate 1,3
82950 color Rgb(255,255,255)
82960 print "上司の生まれた月(1月~12月):" + buf_Month$
82970 goto Jyoushi_Input_Born_Month2:
82980 endif
82990 case 2:
83000 '==================================
83010 '何もしない
83020 'coun = 2
83030 '==================================
83040 'c= val(buf_Month$)
83050 'buf_month = c*10 + No
83060 'buf_Month$ = str$(buf_month)
83070 'locate 2,3
83080 'print "上司の生まれた月(1月～12月):";buf_Month$
83090 'goto Jyoushi_Input_Born_Month2:
83100 'case 3:
83110 'count=4
83120 'b=val(buf_month$)
83130 'buf_month=c*10+No
83140 'buf_Month$=str$(buf_month)
83150 'locate 2,3
83160 'print "上司の生まれた月(1月～12月):";buf_Month$
83170 'buf_month=val(buf_Month$)
83180 'year=val(buf_year$)
83190 if (No=-1) then
83200 No=0
83210 goto Jyoushi_Input_Born_Day:
83220 else
83230 goto Jyoushi_Input_Born_Month2:
83240 endif
83250 'case 4:
83260 'bufyear=buf_year
83270 'if (No=-1) then
83280 'buf_month = val(buf_Month$)
83290 'month = buf_month
83300 'sp_on 14,0
83310 'goto Input_Born_Day:
83320 'else
83330 'goto Input_Born_Month2:
83340 'endif
83350 end select
83360 endif
83370 '左の丸ボタン　キャンセル
83380 if (bg2=2) then
83390 select case count2
83400 case 0:
83410 if (No = -1) then
83420 buf_month=0:buf_Month$="**"
83430 count=0
83440 'goto rewrite2:
83450 else
83460 if ((No >= 1 and No <= 9) or (No >= 10 and No <= 12)) then
83470 buf_month = 0:buf_Month$ = "**"
83480 locate 0,3
83490 color rgb(255,255,255)
83500 print "                                       "
83510 goto rewrite2:
83520 if (No>12) then
83530 ui_msg"値が範囲外です。"
83540 goto rewrite2:
83550 endif
83560 endif
83570 endif
83580 rewrite2:
83590 locate 2,3
83600 color rgb(255,255,255)
83610 print "                                      "
83620 locate 2,3
83630 print "上司の生まれた月(1月~12月):"+buf_Month$
83640 goto Jyoushi_Input_Born_Month2:
83650 end select
83660 'endif
83670 endif
83680 end
83690 'end
83700 '生れた日を入力
83710 Jyoushi_Input_Born_Day:
83720 '生まれた日入力
83730 cls 3:play ""
83740 'No=-1:Okのとき
83750 init"kb:4":key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_Day$ = "**":count=0:bg2=0:count2=0
83760 for i=0 to 1
83770 buf_day(i)=0
83780 next i
83790 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
83800 '****************************************************************************************************
83810 'WUXG(1920x1200)の時ここから
83820 '****************************************************************************************************
83830 gload Gazo$ + "Screen2.png",0,0,0
83840 gload Gazo$ + "downscreen.png",0,0,800
83850 '****************************************************************************************************
83860 'WUXG(1920x1200)の時ここまで
83870 '****************************************************************************************************
83880 'Init"kb:2"
83890 '音声ファイル再生 2023.06.07
83900 play Voice$ + "Input_Born_Day_Jyoushi_20230831.mp3"
83910 font 48
83920 locate 1,1
83930 '文字色：黒　 color rgb(0,0,0)
83940 color rgb(255,255,255)
83950 print "上司の生まれた日を入れて下さい" + chr$(13)
83960 locate 1,3
83970 color rgb(255,255,255)
83980 print "                                      "
83990 locate 1,3
84000 print "上司の生まれた日(1日~31日):"+buf_Day$
84010 color rgb(255,255,255)
84020 'locate 4,6:print ":7"
84030 'locate 9,6:print ":8"
84040 'locate 12,6:print ":9"
84050 'locate 4,6
84060 'print ":7  :8  :9" + chr$(13)
84070 'color rgb(255,255,255)
84080 'locate 4,8
84090 'print ":4  :5  :6" + chr$(13)
84100 'color rgb(255,255,255)
84110 'locate 4,10
84120 'print ":1  :2  :3" + chr$(13)
84130 'locate 4,12
84140 'print "    :0"
84150 'locate 12,12
84160 'color rgb(0,0,255)
84170 'print ":Ok"
84180 sp_on 4,0: sp_on 5,0:sp_on 6,0
84190 sp_on 7,0:sp_on 8,0:sp_on 9,0
84200 sp_on 10,0:sp_on 11,0:sp_on 12,0
84210 sp_on 13,0:sp_on 14,1
84220 Jyoushi_Input_Born_Day2:
84230 key$="":bg=0:y=0:y2=0:bg2=0:
84240 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
84250 key$ = inkey$
84260 bg = strig(1)
84270 y = stick(1)
84280 y2 = stick(0)
84290 bg2 = strig(0)
84300 pause 200
84310 wend
84320 '十字キー　ここから
84330 '上の矢印　または、十字キー上
84340 if ((y = -1) or (key$ = chr$(30))) then
84350 select case No
84360 'No=-1:okのとき:初期の状態
84370 '0kボタンから３に移動
84380 '上に行く 処理
84390 case -1:
84400 No=3:sp_on 12,1:sp_on 14,0
84410 pause 200:goto Jyoushi_Input_Born_Day2:
84420 '選択肢:3
84430 '3ボタンから 6に移動
84440 case 3:
84450 No=6:sp_on 12,0:sp_on 11,1
84460 pause 200:goto Jyoushi_Input_Born_Day2:
84470 '6ボタンから ９に移動
84480 case 6:
84490 No=9:sp_on 10,1:sp_on 11,0
84500 pause 200:goto Jyoushi_Input_Born_Day2:
84510 '6ボタンから ９に移動　ここまで
84520 '9で上を押して何もしない
84530 case 9:
84540 '何もしない
84550 No=9
84560 pause 200:goto Jyoushi_Input_Born_Day2:
84570 '9で上を押しても何もしない　ここまで
84580 '上　 0ボタンから2ボタン
84590 'sp_on 6,1:1
84600 'sp_on 8,1:5
84610 'sp_on 7,1:7
84620 case 0:
84630 No=2:sp_on 13,0:sp_on 9,1:
84640 pause 200:goto Jyoushi_Input_Born_Day2:
84650 '上  0ボタンから2ボタン　ここまで
84660 '2から５になる 上
84670 case 2:
84680 No=5:sp_on 8,1:sp_on 9,0:
84690 pause 200:goto Jyoushi_Input_Born_Day2:
84700 case 5:
84710 No=8:sp_on 7,1:sp_on 8,0
84720 pause 200:goto Jyoushi_Input_Born_Day2:
84730 case 8:
84740 pause 200:goto Jyoushi_Input_Born_Day2:
84750 case 1:
84760 No=4:sp_on 5,1:sp_on 6,0
84770 pause 200:goto Jyoushi_Input_Born_Day2:
84780 case 4:
84790 No=7:sp_on 4,1:sp_on 5,0
84800 pause 200:goto Jyoushi_Input_Born_Day2:
84810 case 7:
84820 pause 200:goto Jyoushi_Input_Born_Day2:
84830 end select
84840 endif
84850 '左３　ここまで
84860 '下の矢印
84870 '中央 2
84880 if ((y=1) or (key$ = chr$(31))) then
84890 select case No
84900 '9から６に下げる
84910 case 9:
84920 No=6:sp_on 11,1:sp_on 10,0
84930 pause 200:goto Jyoushi_Input_Born_Day2:
84940 '6から３に下げる
84950 case 6:
84960 No=3:sp_on 12,1:sp_on 11,0
84970 pause 200:goto Jyoushi_Input_Born_Day2:
84980 '3から０ｋに変える
84990 case 3:
85000 No=-1:sp_on 14,1:sp_on 12,0
85010 pause 200:goto Jyoushi_Input_Born_Day2:
85020 'Okから下のボタンを押しても何もしない
85030 case -1:
85040 pause 200:goto Jyoushi_Input_Born_Day2:
85050 case 8:
85060 No=5:sp_on 8,1:sp_on 7,0
85070 pause 200:goto Jyoushi_Input_Born_Day2:
85080 case 5:
85090 No=2:sp_on 9,1:sp_on 8,0
85100 pause 200:goto Jyoushi_Input_Born_Day2:
85110 case 2:
85120 No=0:sp_on 13,1:sp_on 9,0
85130 pause 200:goto Jyoushi_Input_Born_Day2:
85140 case 0:
85150 pause 200:goto Jyoushi_Input_Born_Day2:
85160 case 7:
85170 No=4:sp_on 5,1:sp_on 4,0
85180 pause 200:goto Jyoushi_Input_Born_Day2:
85190 case 4:
85200 No=1:sp_on 6,1:sp_on 5,0
85210 pause 200:goto Jyoushi_Input_Born_Day2:
85220 case 1:
85230 pause 200:goto Jyoushi_Input_Born_Day2:
85240 end select
85250 endif
85260 '左へボタン 十字キー　左　or 　カーソル左
85270 if ((y2 = -1) or (key$ = chr$(29))) then
85280 select case No
85290 'Ok ボタン  Okから　左　０に行く
85300 case -1:
85310 No=0:sp_on 13,1:sp_on 14,0
85320 pause 200:goto Jyoushi_Input_Born_Day2:
85330 '0 ボタン  左　何もしない
85340 case 0:
85350 pause 200:goto Jyoushi_Input_Born_Day2:
85360 case 3:
85370 No=2:sp_on 9,1:sp_on 12,0:
85380 pause 200:goto Jyoushi_Input_Born_Day2:
85390 case 2:
85400 No=1:sp_on 6,1:sp_on 9,0:
85410 pause 200:goto Jyoushi_Input_Born_Day2:
85420 case 1:
85430 pause 200:goto Jyoushi_Input_Born_Day2:
85440 case 6:
85450 No=5:sp_on 8,1:sp_on 11,0
85460 pause 200:goto Jyoushi_Input_Born_Day2:
85470 case 5:
85480 No=4:sp_on 5,1:sp_on 8,0
85490 pause 200:goto Jyoushi_Input_Born_Day2:
85500 case 4:
85510 pause 200:goto Jyoushi_Input_Born_Day2:
85520 case 9:
85530 No=8:sp_on 7,1:sp_on 10,0
85540 pause 200:goto Jyoushi_Input_Born_Day2:
85550 case 8:
85560 No=7:sp_on 4,1:sp_on 7,0
85570 pause 200:goto Jyoushi_Input_Born_Day2:
85580 case 7:
85590 pause 200:goto Jyoushi_Input_Born_Day2:
85600 end select
85610 endif
85620 '右  十字キー　右　or カーソル　右
85630 if ((y2 = 1) or (key$ = chr$(28))) then
85640 select case No
85650 '0ボタンからokボタン右に移動
85660 case 0:
85670 No=-1:sp_on 14,1:sp_on 13,0
85680 pause 200:goto Jyoushi_Input_Born_Day2:
85690 '0ボタンからokボタン 右に移動　ここまで
85700 'OKボタンで右を押して何もしない
85710 case -1:
85720 pause 200:goto Jyoushi_Input_Born_Day2:
85730 case 1:
85740 No=2:sp_on 9,1:sp_on 6,0
85750 pause 200:goto Jyoushi_Input_Born_Day2:
85760 case 2:
85770 No=3:sp_on 12,1:sp_on 9,0
85780 pause 200:goto Jyoushi_Input_Born_Day2:
85790 case 3:
85800 pause 200:goto Jyoushi_Input_Born_Day2:
85810 case 4:
85820 No=5:sp_on 8,1:sp_on 5,0
85830 pause 200:goto Jyoushi_Input_Born_Day2:
85840 case 5:
85850 No=6:sp_on 11,1:sp_on 8,0
85860 pause 200:goto Jyoushi_Input_Born_Day2:
85870 case 7:
85880 No=8:sp_on 7,1:sp_on 4,0
85890 pause 200:goto Jyoushi_Input_Born_Day2:
85900 case 8:
85910 No=9:sp_on 10,1:sp_on 7,0
85920 pause 200:goto Jyoushi_Input_Born_Day2:
85930 case 9:
85940 pause 200:goto Jyoushi_Input_Born_Day2:
85950 case 6:
85960 pause 200:goto Jyoushi_Input_Born_Day2:
85970 end select
85980 'Okから右ボタンを押して何もしない ここまで
85990 endif
86000 '十字キー　ここまで
86010 '右の丸ボタンを押したとき
86020 if ((bg = 2) or (key$ = chr$(13))) then
86030 'count :決定ボタンを押した回数
86040 select case (count)
86050 '1桁目入力
86060 case 0:
86070 count = 1:
86080 if (No = -1) then
86090 '1桁目　OKでは何もしない
86100 No=c
86110 'goto Jyoushi_Input_Born_Day2:
86120 else
86130 'ok以外のボタンを押したとき
86140 buf_day = No:buf_Day$ = str$(No)
86150 buf_Jyoushi_Born_Day(2)=buf_day
86160 c=No
86170 locate 1,3
86180 print "                                      "
86190 color RGB(255,255,255)
86200 locate 1,3
86210 print "上司の生まれた日(1日~31日):" + buf_Day$
86220 endif
86230 'check2:
86240 'if (buf_day >= 1 and buf_day <= 9) then
86250 'sp_on 14,0
86260 'goto complate_jyoushi:
86270 'else
86280 'sp_on 14,0
86290 goto Jyoushi_Input_Born_Day2:
86300 'end
86310 'endif
86320 case 1:
86330 '10未満の数字ボタン+okボタン or 2桁目の数字ボタン
86340 count = 2:
86350 'locate 2,3
86360 'color RGB(255,255,255)
86370 'print "生まれた日(1日~31日):";buf_Day$
86380 'Okボタンを押したときの処理
86390 '入力値　10未満のとき
86400 'buf_day = c * 10 + No
86410 if (No = -1) then
86420 c=buf_day:No=0
86430 'buf_day = c
86440 buf_Day$ = str$(buf_day)
86450 '10以下のとき
86460 'if (buf_day < 10) then
86470 sp_on 14,0
86480 goto complate_jyoushi:
86490 'end
86500 'endif
86510 else
86520 'c=No
86530 buf_day = c * 10 + No
86540 buf_Day$ = str$(buf_day)
86550 'buf_day = c:buf_Day$=str$(buf_day)
86560 buf_Jyoushi_Born_Day(2)=buf_day
86570 locate 1,3
86580 print "                                           "
86590 locate 1,3
86600 color Rgb(255,255,255)
86610 print "上司の生まれた日(1日~31日):" + buf_Day$
86620 goto Jyoushi_Input_Born_Day2:
86630 'goto
86640 endif
86650 'endif
86660 '生まれた日　2桁目の数字　or 1桁の数字 + ok
86670 case 2:
86680 'buf_day = c * 10 + No
86690 'buf_Jyoushi_Born_Day(2)=buf_day
86700 'locate 1,3
86710 'print "                                      "
86720 'locate 1,3
86730 'locate 2,3
86740 'print "生まれた日(1日〜31日):";buf_Day
86750 'No=-1:ok ボタンを押したとき
86760 if (No = -1) then
86770 'if ((buf_day > 0) and (buf_day < 32)) then
86780 No=0
86790 sp_on 14,0
86800 goto complate_jyoushi:
86810 'end
86820 else
86830 goto Jyoushi_Input_Born_Day2:
86840 'endif
86850 'Okボタン以外を押したとき
86860 'else
86870 'c=val(buf_Day$)
86880 'buf_day = c * 10 + No
86890 'buf_Jyoushi_Born_Day(2) = buf_day
86900 'buf_Day$ = str$(buf_day)
86910 'locate 1,3
86920 'print "上司の生まれた日(1日~31日):";buf_Day$
86930 'goto Jyoushi_Input_Born_Day2:
86940 endif
86950 'case 3:
86960 'count=4
86970 'c=val(buf_day$)
86980 'buf_day=c*10+No
86990 'buf_day$=str$(buf_day)
87000 'locate 2,3
87010 'print "生まれた日を入れてください:";buf_day$
87020 'year=val(buf_year$)
87030 'if (No = -1) then
87040 'goto Jyoushi_Input_Born_Day:
87050 'sp_on 14,0:
87060 'goto complate_jyoushi:
87070 'else
87080 'goto Jyoushi_Input_Born_Month2:
87090 'endif
87100 'case 4:
87110 'bufyear=buf_year
87120 'if (No=-1) then
87130 'buf_day = val(buf_day$)
87140 'bufday = buf_day
87150 'sp_on 14,0
87160 'goto Jyoushi_Input_Born_Day2:
87170 'else
87180 'goto Jyoushi_Input_Born_Day2:
87190 'endif
87200 end select
87210 endif
87220 if (bg2=2) then
87230 select case count2
87240 case 0:
87250 if (No=-1) then
87260 buf_day=0:buf_Day$="**":No=0
87270 if (buf_day >= 1 and buf_day <= 31) then
87280 count=0
87290 buf_day=0:buf_Day$ = "**"
87300 goto rewrite_day3:
87310 else
87320 buf_day=0:buf_Day$ = "**"
87330 ui_msg"値が範囲外です"
87340 endif
87350 goto rewrite_day3:
87360 else
87370 goto rewrite_day3:
87380 endif
87390 rewrite_day3:
87400 locate 2,3
87410 color rgb(255,255,255)
87420 print "                                      "
87430 locate 2,3
87440 print "生まれた日(1日~31日):" + buf_Day$
87450 goto Jyoushi_Input_Born_Day2:
87460 end select
87470 endif
87480 '--------------------------------------------'
87490 'locate 2,0:color rgb(255,0,0)
87500 'print "上司の生まれた年代を入力"
87510 'color rgb(255,255,255)
87520 'locate 2,3:print "生まれた年代を西暦4桁で入れてください"
87530 'locate 2,4:Input "上司の生まれた年:",born_year
87540 '誕生日データーを配列に代入
87550 'buf_Jyoushi_Born_Year:上司の生まれた年代
87560 'buf_Jyoushi_Born_Day(0) = born_year
87570 'born_year = 0
87580 '---------------------------------------------'
87590 'goto Jyoushi_born_month:
87600 '1-2.生まれた月を入力
87610 'Jyoushi_born_month:
87620 'cls 3:gload Gazo$ + "Screen1.png",0,0,0
87630 'init "kb:4"
87640 'locate 2,1:
87650 'color rgb(255,0,0)
87660 'print "上司の生まれた月入力"
87670 'color rgb(255,255,255)
87680 'locate 2,4:print "生まれた月を入力してください"
87690 'locate 2,5
87700 'Input "上司の生まれ月:",born_month
87710 'buf_Jyoushi_Born_Day(1) = born_month
87720 'born_month = 0
87730 'goto Jyoushi_born_day:
87740 'buf_Jyoushi_Born_day
87750 '1-3.生まれた日を入力
87760 'Jyoushi_born_day:
87770 'cls 3:gload Gazo$ + "Screen1.png",0,0,0
87780 'init "kb:4"
87790 'locate 2,1:color rgb(255,0,0)
87800 'print "上司の生まれた日　入力"
87810 'locate 2,4:color rgb(255,255,255)
87820 'print "生まれた日を入力してください"
87830 'locate 2,5
87840 'Input "上司の生まれた日:",born_day
87850 'buf_Jyoushi_Born_Day(2) = born_day
87860 'born_day = 0
87870 'goto buka_born_year:
87880 '2.部下の誕生日入力
87890 '2-1.生まれた年を入力
87900 'buka_born_year:
87910 'cls 3:gload Gazo$+"Screen1.png",0,0,0
87920 'init "kb:2"
87930 'locate 1,1:color rgb(255,0,0)
87940 'print "部下の生まれた年代入力"
87950 'locate 0,4:color rgb(255,255,255)
87960 'print "部下の生まれた年（西暦4桁）を入れてください"
87970 'locate 0,5
87980 'Input "部下の生まれた年(西暦4桁):",born_year
87990 'buf_Buka_Born_Day(0) = born_year
88000 'born_year = 0
88010 '2-2.生まれた月を入力
88020 'buka_born_month:
88030 'cls 3:gload Gazo$+"Screen1.png",0,0,0
88040 'init "kb:2"
88050 'locate 2,1:color rgb(255,0,0)
88060 'print "部下の生まれた月 入力"
88070 'locate 2,4:color rgb(255,255,255)
88080 'print "部下の生まれた月を入力してください"
88090 'locate 2,5:Input "部下の生まれた月:",born_month
88100 'buf_Buka_Born_Day(1) = born_month
88110 '2-3.生まれた日を入力
88120 'buka_born_day:
88130 'cls 3:gload Gazo$ + "Screen1.png",0,0,0
88140 'init "kb:2"
88150 'locate 2,1:color rgb(255,0,0)
88160 'print "生まれた日入力"
88170 'color rgb(255,255,255)
88180 'locate 2,4:print "生まれた日を入力してください"
88190 'locate 2,5:Input "部下の生まれた日:",born_day
88200 'buf_Buka_Born_Day(2) = born_day
88210 'born_day=0:goto Result_Business_Aisyou:
88220 '--------------------------------------------'
88230 complate_jyoushi:
88240 a = buf_Jyoushi_Born_Day(0):b = buf_Jyoushi_Born_Day(1):c = buf_Jyoushi_Born_Day(2)
88250 buf_Jyoushi = Kabara_Num(a,b,c)
88260 a_1=buf_Jyoushi
88270 goto Buka_Input_Seireki:
88280 '--------------------------------------------'
88290 '部下'
88300 '1.部下の生まれた年代'
88310 Buka_Input_Seireki:
88320 cls 3:play "":count=0:count2=0
88330 init"kb:4"
88340 'No=-1:Okのとき
88350 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_buka_year$ = "****":buf_buka_year=0
88360 for i=0 to 3
88370 buf_Buka_Born_Day(i)=0
88380 next i
88390 '****************************************************************************************************
88400 'WUXG(1920x1200)の時ここから
88410 '****************************************************************************************************
88420 gload Gazo$ + "Screen2.png",0,0,0
88430 gload Gazo$ + "downscreen.png",0,0,800
88440 '****************************************************************************************************
88450 'WUXG(1920x1200)の時ここまで
88460 '****************************************************************************************************
88470 'Init"kb:2"
88480 '音声ファイル再生 2023.06.07
88490 play Voice$ + "Input_Born_Year_Buka_20230831.mp3"
88500 font 48
88510 locate 0,1
88520 '文字色：黒　 color rgb(0,0,0)
88530 color rgb(255,255,255)
88540 print "部下の生まれた年代を入れて下さい" + chr$(13)
88550 color rgb(255,255,255)
88560 locate 1,3
88570 print "部下の生まれた年代(西暦4桁):"+buf_buka_year$
88580 color rgb(255,255,255)
88590 'locate 4,6:print ":7"
88600 'locate 9,6:print ":8"
88610 'locate 12,6:print ":9"
88620 'locate 4,6
88630 'print ":7  :8  :9" + chr$(13)
88640 'color rgb(255,255,255)
88650 'locate 4,8
88660 'print ":4  :5  :6" + chr$(13)
88670 'color rgb(255,255,255)
88680 'locate 4,10
88690 'print ":1  :2  :3" + chr$(13)
88700 'locate 4,12
88710 'print "    :0"
88720 'locate 12,12
88730 'color rgb(0,0,255)
88740 'print ":Ok"
88750 sp_on 4,0: sp_on 5,0:sp_on 6,0
88760 sp_on 7,0:sp_on 8,0:sp_on 9,0
88770 sp_on 10,0:sp_on 11,0:sp_on 12,0
88780 sp_on 13,0:sp_on 14,1
88790 Buka_Input_Seireki2:
88800 key$="":bg=0:y=0:y2=0:bg2=0:
88810 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
88820 key$ = inkey$
88830 bg = strig(1)
88840 y = stick(1)
88850 y2 = stick(0)
88860 bg2=strig(0)
88870 pause 200
88880 wend
88890 '十字キー　ここから
88900 '上の矢印　または、十字キー上
88910 if ((y = -1) or (key$ = chr$(30))) then
88920 select case No
88930 'No=-1:okのとき:初期の状態
88940 '0kボタンから３に移動
88950 '上に行く 処理
88960 case -1:
88970 No=3:sp_on 12,1:sp_on 14,0
88980 pause 200:goto Buka_Input_Seireki2:
88990 '選択肢:3
89000 '3ボタンから 6に移動
89010 case 3:
89020 No=6:sp_on 12,0:sp_on 11,1
89030 pause 200:goto Buka_Input_Seireki2:
89040 '6ボタンから ９に移動
89050 case 6:
89060 No=9:sp_on 10,1:sp_on 11,0
89070 pause 200:goto Buka_Input_Seireki2:
89080 '6ボタンから ９に移動　ここまで
89090 '9で上を押して何もしない
89100 case 9:
89110 '何もしない
89120 No=9
89130 pause 200:goto Buka_Input_Seireki2:
89140 '9で上を押しても何もしない　ここまで
89150 '上　 0ボタンから2ボタン
89160 'sp_on 6,1:1
89170 'sp_on 8,1:5
89180 'sp_on 7,1:7
89190 case 0:
89200 No=2:sp_on 13,0:sp_on 9,1:
89210 pause 200:goto Buka_Input_Seireki2:
89220 '上  0ボタンから2ボタン　ここまで
89230 '2から５になる 上
89240 case 2:
89250 No=5:sp_on 8,1:sp_on 9,0:
89260 pause 200:goto Buka_Input_Seireki2:
89270 case 5:
89280 No=8:sp_on 7,1:sp_on 8,0
89290 pause 200:goto Buka_Input_Seireki2:
89300 case 8:
89310 pause 200:goto Buka_Input_Seireki2:
89320 case 1:
89330 No=4:sp_on 5,1:sp_on 6,0
89340 pause 200:goto Buka_Input_Seireki2:
89350 case 4:
89360 No=7:sp_on 4,1:sp_on 5,0
89370 pause 200:goto Buka_Input_Seireki2:
89380 case 7:
89390 pause 200:goto Buka_Input_Seireki2:
89400 end select
89410 endif
89420 '左３　ここまで
89430 '下の矢印
89440 '中央 2
89450 if ((y=1) or (key$ = chr$(31))) then
89460 select case No
89470 '9から６に下げる
89480 case 9:
89490 No=6:sp_on 11,1:sp_on 10,0
89500 pause 200:goto Buka_Input_Seireki2:
89510 '6から３に下げる
89520 case 6:
89530 No=3:sp_on 12,1:sp_on 11,0
89540 pause 200:goto Buka_Input_Seireki2:
89550 '3から０ｋに変える
89560 case 3:
89570 No=-1:sp_on 14,1:sp_on 12,0
89580 pause 200:goto Buka_Input_Seireki2:
89590 'Okから下のボタンを押しても何もしない
89600 case -1:
89610 pause 200:goto Buka_Input_Seireki2:
89620 case 8:
89630 No=5:sp_on 8,1:sp_on 7,0
89640 pause 200:goto Buka_Input_Seireki2:
89650 case 5:
89660 No=2:sp_on 9,1:sp_on 8,0
89670 pause 200:goto Buka_Input_Seireki2:
89680 case 2:
89690 No=0:sp_on 13,1:sp_on 9,0
89700 pause 200:goto Buka_Input_Seireki2:
89710 case 0:
89720 pause 200:goto Buka_Input_Seireki2:
89730 case 7:
89740 No=4:sp_on 5,1:sp_on 4,0
89750 pause 200:goto Buka_Input_Seireki2:
89760 case 4:
89770 No=1:sp_on 6,1:sp_on 5,0
89780 pause 200:goto Buka_Input_Seireki2:
89790 case 1:
89800 pause 200:goto Buka_Input_Seireki2:
89810 end select
89820 endif
89830 '左へボタン 十字キー　左　or 　カーソル左
89840 if ((y2 = -1) or (key$ = chr$(29))) then
89850 select case No
89860 'Ok ボタン  Okから　左　０に行く
89870 case -1:
89880 No=0:sp_on 13,1:sp_on 14,0
89890 pause 200:goto Buka_Input_Seireki2:
89900 '0 ボタン  左　何もしない
89910 case 0:
89920 pause 200:goto Buka_Input_Seireki2:
89930 case 3:
89940 No=2:sp_on 9,1:sp_on 12,0:
89950 pause 200:goto Buka_Input_Seireki2:
89960 case 2:
89970 No=1:sp_on 6,1:sp_on 9,0:
89980 pause 200:goto Buka_Input_Seireki2:
89990 case 1:
90000 pause 200:goto Buka_Input_Seireki2:
90010 case 6:
90020 No=5:sp_on 8,1:sp_on 11,0
90030 pause 200:goto Buka_Input_Seireki2:
90040 case 5:
90050 No=4:sp_on 5,1:sp_on 8,0
90060 pause 200:goto Buka_Input_Seireki2:
90070 case 4:
90080 pause 200:goto Buka_Input_Seireki2:
90090 case 9:
90100 No=8:sp_on 7,1:sp_on 10,0
90110 pause 200:goto Buka_Input_Seireki2:
90120 case 8:
90130 No=7:sp_on 4,1:sp_on 7,0
90140 pause 200:goto Buka_Input_Seireki2:
90150 case 7:
90160 pause 200:goto Buka_Input_Seireki2:
90170 end select
90180 endif
90190 '右  十字キー　右　or カーソル　右
90200 if ((y2 = 1) or (key$ = chr$(28))) then
90210 select case No
90220 '0ボタンからokボタン右に移動
90230 case 0:
90240 No=-1:sp_on 14,1:sp_on 13,0
90250 pause 200:goto Buka_Input_Seireki2:
90260 '0ボタンからokボタン 右に移動　ここまで
90270 'OKボタンで右を押して何もしない
90280 case -1:
90290 pause 200:goto Buka_Input_Seireki2:
90300 case 1:
90310 No=2:sp_on 9,1:sp_on 6,0
90320 pause 200:goto Buka_Input_Seireki2:
90330 case 2:
90340 No=3:sp_on 12,1:sp_on 9,0
90350 pause 200:goto Buka_Input_Seireki2:
90360 case 3:
90370 pause 200:goto Buka_Input_Seireki2:
90380 case 4:
90390 No=5:sp_on 8,1:sp_on 5,0
90400 pause 200:goto Buka_Input_Seireki2:
90410 case 5:
90420 No=6:sp_on 11,1:sp_on 8,0
90430 pause 200:goto Buka_Input_Seireki2:
90440 case 7:
90450 No=8:sp_on 7,1:sp_on 4,0
90460 pause 200:goto Buka_Input_Seireki2:
90470 case 8:
90480 No=9:sp_on 10,1:sp_on 7,0
90490 pause 200:goto Buka_Input_Seireki2:
90500 case 9:
90510 pause 200:goto Buka_Input_Seireki2:
90520 case 6:
90530 pause 200:goto Buka_Input_Seireki2:
90540 end select
90550 'Okから右ボタンを押して何もしない ここまで
90560 endif
90570 '十字キー　ここまで
90580 '＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝
90590 'ここからコメント
90600 '右の丸ボタン決定を押した数:count
90610 'if ((bg=2) or (key$=chr$(13))) then
90620 'select case count
90630 'case 0:
90640 'count=1
90650 'if (No = -1) then
90660 'count = 0
90670 'Okボタンを押したとき
90680 '
90690 'goto Buka_Input_Seireki2:
90700 'else
90710 'Okボタン以外が押されたとき
90720 'if (No >= 1 and No <= 2) then
90730 'buf_buka_year$ = "":buf_buka_year$ = str$(No)
90740 'buf_buka_year = No
90750 'buf_Buka_Born_Day(0) = bufyear
90760 'locate 2,3
90770 'color rgb(255,255,255)
90780 'print "部下の生まれた年代(西暦4桁):";buf_buka_year$
90790 'goto Buka_Input_Seireki2:
90800 'else
90810 'count=0
90820 'ui_msg"数字が範囲外になります。"
90830 'buf_buka_year$ ="":buf_buka_year=0
90840 'goto Buka_Input_Seireki2:
90850 'endif
90860 'endif
90870 'case 1:
90880 'count = 2
90890 'if (No = -1) then
90900 'count = 1
90910 'goto Buka_Input_Seireki2:
90920 'else
90930 'b = val(buf_buka_year$)
90940 'buf_buka_year = b * 10 + No
90950 'buf_buka_year$ = str$(buf_buka_year)
90960 'buf_Buka_Born_Day(0) = bufyear
90970 'locate 1,3
90980 'color rgb(255,255,255)
90990 'print "                                                                "
91000 'locate 1,3
91010 'print "部下の生まれた年代(西暦4桁):";buf_buka_year$
91020 'if (No = -1) then
91030 'count=1
91040 'goto Buka_Input_Seireki2:
91050 'endif
91060 'case 2:
91070 'count = 3
91080 'if (No = -1) then
91090 'count = 2
91100 'buf_Buka_Born_Day(0)=bufyear
91110 'goto Buka_Input_Seireki2:
91120 'else
91130 'b = val(buf_buka_year$)
91140 'buf_buka_year = b*10 + No
91150 'buf_buka_year$ = str$(buf_buka_year)
91160 'locate 1,3
91170 'color rgb(255,255,255)
91180 'print "                                        "
91190 'locate 1,3
91200 'print "部下の生まれた年代(西暦4桁):"+buf_buka_year$
91210 'goto Buka_Input_Seireki2:
91220 'endif
91230 'case 3:
91240 'count=4
91250 'if (No = -1) then
91260 'count=3
91270 'goto Buka_Input_Seireki2:
91280 'else
91290 'b = buf_buka_year
91300 'buf_buka_year = b * 10 + No
91310 'buf_buka_year$=str$(buf_buka_year)
91320 'locate 1,3
91330 'color RGB(255,255,255)
91340 'print "                                      "
91350 'locate 1,3
91360 'print "部下の生まれた年代(西暦4桁):";buf_buka_year$
91370 'buf_year=val(buf_year$)
91380 'year=val(buf_year$)
91390 'if (No=-1) then
91400 'goto Input_Born_Month:
91410 'else
91420 'goto Buka_Input_Seireki2:
91430 'endif
91440 'case 4:
91450 'bufyear=buf_year
91460 'if (No=-1) then
91470 'buf_year = val(buf_year$)
91480 'bufyear = buf_year
91490 'sp_on 14,0
91500 'goto Buka_Input_Born_Month:
91510 'else
91520 'goto Buka_Input_Seireki2:
91530 'endif
91540 'end select
91550 'endif
91560 'if (bg2 = 2) then
91570 'select case count2
91580 'case 0:
91590 'if (No = -1) then
91600 'buf_buka_year=0:buf_buka_year$=trim$(""):buf_buka_year$=trim$("****")
91610 'count=0
91620 'locate 1,3
91630 'color rgb(255,255,255)
91640 'print "                                      "
91650 'locate 1,3
91660 'print "部下の生まれた年代（西暦4桁):";buf_buka_year$
91670 'goto Buka_Input_Seireki2:
91680 'else
91690 '(buf_year=0) then
91700 'buf_buka_year=0:buf_buka_year$="****"
91710 'goto Buka_Input_Seireki2:
91720 'endif
91730 'endif
91740 'end select
91750 'endif
91760 'end
91770 'ここまでコメント
91780 '================================================================
91790 if ((bg=2) or (key$=chr$(13))) then
91800 select case count
91810 case 0:
91820 count = 1
91830 if (No=-1) then
91840 count = 0
91850 buf_Buka_Born_Day(0) = No
91860 'Okボタンを押したとき
91870 goto Buka_Input_Seireki2:
91880 else
91890 'Okボタン以外が押されたとき
91900 if (No>=1 and No<=2) then
91910 buf_buka_year$="":buf_buka_year$=str$(No) + "***":a = No
91920 buf_buka_year = No
91930 buf_Buka_Born_Day(0) = No
91940 locate 1,3
91950 color rgb(255,255,255)
91960 print "部下の生まれた年代(西暦4桁):";buf_buka_year$
91970 goto Buka_Input_Seireki2:
91980 else
91990 count=0
92000 ui_msg"数字が範囲外になります。"
92010 buf_buka_year$="":buf_buka_year=0
92020 goto Buka_Input_Seireki2:
92030 endif
92040 endif
92050 case 1:
92060 count = 2
92070 if (No = -1) then
92080 count = 1
92090 goto Buka_Input_Seireki2:
92100 else
92110 'b = val(buf_buka_year$)
92120 buf_buka_year = a * 10 + No
92130 b=buf_buka_year
92140 buf_buka_year$ = str$(buf_buka_year)+"**"
92150 buf_Buka_Born_Day(0)=buf_buka_year
92160 locate 1,3
92170 color rgb(255,255,255)
92180 print "                                                                "
92190 locate 1,3
92200 print "部下の生まれた年代(西暦4桁):"+buf_buka_year$
92210 'if (No = -1) then
92220 'count=1
92230 goto Buka_Input_Seireki2:
92240 endif
92250 case 2:
92260 count=3
92270 if (No=-1) then
92280 count =2:No=0
92290 goto Buka_Input_Seireki2:
92300 else
92310 'b = val(buf_buka_year$)
92320 buf_buka_year = b * 10 + No
92330 c = buf_buka_year
92340 buf_buka_year$ = str$(buf_buka_year) + "*"
92350 buf_Buka_Born_Day(0) = buf_buka_year
92360 locate 1,3
92370 color rgb(255,255,255)
92380 print "                                        "
92390 locate 1,3
92400 print "部下の生まれた年代(西暦4桁):";buf_buka_year$
92410 goto Buka_Input_Seireki2:
92420 endif
92430 case 3:
92440 count=4
92450 if (No = -1) then
92460 'count=3:No=0
92470 goto Buka_Input_Seireki2:
92480 else
92490 'b = val(buf_buka_year$)
92500 buf_buka_year=c * 10 + No
92510 buf_buka_year$=str$(buf_buka_year)
92520 buf_Buka_Born_Day(0)=buf_buka_year
92530 locate 1,3
92540 color RGB(255,255,255)
92550 print "                                      "
92560 locate 1,3
92570 print "部下の生まれた年代(西暦4桁):";buf_buka_year$
92580 buf_buka_year=val(buf_buka_year$)
92590 'year=val(buf_year$)
92600 'if (No=-1) then
92610 'goto Input_Born_Month:
92620 'else
92630 goto Buka_Input_Seireki2:
92640 endif
92650 case 4:
92660 'bufyear=buf_year
92670 if (No = -1) then
92680 buf_buka_year = val(buf_buka_year$)
92690 buf_Buka_Born_Day(0)=buf_buka_year
92700 sp_on 14,0
92710 goto Buka_Input_Born_Month:
92720 else
92730 goto Buka_Input_Seireki2:
92740 endif
92750 end select
92760 endif
92770 '================================================================
92780 'ここにコピーする。
92790 '================================================================
92800 'Input"部下の生れた年代(4桁,〜2025年):",year
92810 'if year > 2025 then goto Jyoushi_Input_Seireki:
92820 'if year = 123 then cls 3:cls 4:goto Main_Screen:
92830 '"4桁目"
92840 'bufyear4 = fix(year / 1000)
92850 '"3桁目"
92860 'bufyear3 = fix((year - (bufyear4 * 1000)) / 100)
92870 '"2桁目"
92880 'bufyear2 = fix((year - ((bufyear4 * 1000)+(bufyear3*100)))/10)
92890 '"1桁目"
92900 'bufyear1 = fix((year - ((bufyear4*
92910 'bufyear = bufyear1+bufyear2+bufyear3+bufyear4
92920 '1.部下の生まれた年代'
92930 '2.部下の生まれた月'
92940 Buka_Input_Born_Month:
92950 cls 3:play "":count=0:count2=0
92960 'No=-1:Okのとき
92970 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_buka_Month$ = "**":buf_buka_month=0
92980 for i=0 to 1
92990 buf_month(i)=0
93000 next i
93010 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
93020 '****************************************************************************************************
93030 'WUXG(1920x1200)の時ここから
93040 '****************************************************************************************************
93050 gload Gazo$ + "Screen2.png",0,0,0
93060 gload Gazo$ + "downscreen.png",0,0,800
93070 '****************************************************************************************************
93080 'WUXG(1920x1200)の時ここから
93090 '****************************************************************************************************
93100 'Init"kb:4"
93110 '音声ファイル再生 2023.06.07
93120 play Voice$ + "Input_Born_Month_Buka_20230831.mp3"
93130 '****************************************************************************************************
93140 'WUXG(1920x1200)の時ここから
93150 '****************************************************************************************************
93160 font 48
93170 '****************************************************************************************************
93180 'WUXG(1920x1200)の時ここまで
93190 '****************************************************************************************************
93200 locate 0,1
93210 '文字色：黒　 color rgb(0,0,0)
93220 '文字色:白
93230 color rgb(255,255,255)
93240 print "部下の生まれた月を入れて下さい" + chr$(13)
93250 '文字色:白
93260 color rgb(255,255,255)
93270 locate 1,3
93280 '文字色:白
93290 print "部下の生まれた月(1月~12月):" + buf_buka_Month$
93300 color rgb(255,255,255)
93310 'locate 4,6:print ":7"
93320 'locate 9,6:print ":8"
93330 'locate 12,6:print ":9"
93340 'locate 4,6
93350 '文字色:赤
93360 'print ":7  :8  :9" + chr$(13)
93370 'color rgb(255,255,255)
93380 'locate 4,8
93390 'print ":4  :5  :6" + chr$(13)
93400 'color rgb(255,255,255)
93410 'locate 4,10
93420 'print ":1  :2  :3" + chr$(13)
93430 'locate 4,12
93440 'print "    :0"
93450 'locate 12,12
93460 'color rgb(0,0,255)
93470 'print ":Ok"
93480 sp_on 4,0: sp_on 5,0:sp_on 6,0
93490 sp_on 7,0:sp_on 8,0:sp_on 9,0
93500 sp_on 10,0:sp_on 11,0:sp_on 12,0
93510 sp_on 13,0:sp_on 14,1
93520 Buka_Input_Born_Month2:
93530 key$="":bg=0:y=0:y2=0:bg2=0
93540 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
93550 key$ = inkey$
93560 bg = strig(1)
93570 y = stick(1)
93580 y2 = stick(0)
93590 bg2 = strig(0)
93600 pause 200
93610 wend
93620 '十字キー　ここから
93630 '上の矢印　または、十字キー上
93640 if ((y = -1) or (key$ = chr$(30))) then
93650 select case No
93660 'No=-1:okのとき:初期の状態
93670 '0kボタンから３に移動
93680 '上に行く 処理
93690 case -1:
93700 No=3:sp_on 12,1:sp_on 14,0
93710 pause 200:goto Buka_Input_Born_Month2:
93720 '選択肢:3
93730 '3ボタンから 6に移動
93740 case 3:
93750 No=6:sp_on 12,0:sp_on 11,1
93760 pause 200:goto Buka_Input_Born_Month2:
93770 '6ボタンから ９に移動
93780 case 6:
93790 No=9:sp_on 10,1:sp_on 11,0
93800 pause 200:goto Buka_Input_Born_Month2:
93810 '6ボタンから ９に移動　ここまで
93820 '9で上を押して何もしない
93830 case 9:
93840 '何もしない
93850 No=9
93860 pause 200:goto Buka_Input_Born_Month2:
93870 '9で上を押しても何もしない　ここまで
93880 '上　 0ボタンから2ボタン
93890 'sp_on 6,1:1
93900 'sp_on 8,1:5
93910 'sp_on 7,1:7
93920 case 0:
93930 No=2:sp_on 13,0:sp_on 9,1:
93940 pause 200:goto Buka_Input_Born_Month2:
93950 '上  0ボタンから2ボタン　ここまで
93960 '2から５になる 上
93970 case 2:
93980 No=5:sp_on 8,1:sp_on 9,0:
93990 pause 200:goto Buka_Input_Born_Month2:
94000 case 5:
94010 No=8:sp_on 7,1:sp_on 8,0
94020 pause 200:goto Buka_Input_Born_Month2:
94030 case 8:
94040 pause 200:goto Buka_Input_Born_Month2:
94050 case 1:
94060 No=4:sp_on 5,1:sp_on 6,0
94070 pause 200:goto Buka_Input_Born_Month2:
94080 case 4:
94090 No=7:sp_on 4,1:sp_on 5,0
94100 pause 200:goto Buka_Input_Born_Month2:
94110 case 7:
94120 pause 200:goto Buka_Input_Born_Month2:
94130 end select
94140 endif
94150 '左３　ここまで
94160 '下の矢印
94170 '中央 2
94180 if ((y=1) or (key$ = chr$(31))) then
94190 select case No
94200 '9から６に下げる
94210 case 9:
94220 No=6:sp_on 11,1:sp_on 10,0
94230 pause 200:goto Buka_Input_Born_Month2:
94240 '6から３に下げる
94250 case 6:
94260 No=3:sp_on 12,1:sp_on 11,0
94270 pause 200:goto Buka_Input_Born_Month2:
94280 '3から０ｋに変える
94290 case 3:
94300 No=-1:sp_on 14,1:sp_on 12,0
94310 pause 200:goto Buka_Input_Born_Month2:
94320 'Okから下のボタンを押しても何もしない
94330 case -1:
94340 pause 200:goto Buka_Input_Born_Month2:
94350 case 8:
94360 No=5:sp_on 8,1:sp_on 7,0
94370 pause 200:goto Buka_Input_Born_Month2:
94380 case 5:
94390 No=2:sp_on 9,1:sp_on 8,0
94400 pause 200:goto Buka_Input_Born_Month2:
94410 case 2:
94420 No=0:sp_on 13,1:sp_on 9,0
94430 pause 200:goto Buka_Input_Born_Month2:
94440 case 0:
94450 pause 200:goto Buka_Input_Born_Month2:
94460 case 7:
94470 No=4:sp_on 5,1:sp_on 4,0
94480 pause 200:goto Buka_Input_Born_Month2:
94490 case 4:
94500 No=1:sp_on 6,1:sp_on 5,0
94510 pause 200:goto Buka_Input_Born_Month2:
94520 case 1:
94530 pause 200:goto Buka_Input_Born_Month2:
94540 end select
94550 endif
94560 '左へボタン 十字キー　左　or 　カーソル左
94570 if ((y2 = -1) or (key$ = chr$(29))) then
94580 select case No
94590 'Ok ボタン  Okから　左　０に行く
94600 case -1:
94610 No=0:sp_on 13,1:sp_on 14,0
94620 pause 200:goto Buka_Input_Born_Month2:
94630 '0 ボタン  左　何もしない
94640 case 0:
94650 pause 200:goto Buka_Input_Born_Month2:
94660 case 3:
94670 No=2:sp_on 9,1:sp_on 12,0:
94680 pause 200:goto Buka_Input_Born_Month2:
94690 case 2:
94700 No=1:sp_on 6,1:sp_on 9,0:
94710 pause 200:goto Buka_Input_Born_Month2:
94720 case 1:
94730 pause 200:goto Buka_Input_Born_Month2:
94740 case 6:
94750 No=5:sp_on 8,1:sp_on 11,0
94760 pause 200:goto Buka_Input_Born_Month2:
94770 case 5:
94780 No=4:sp_on 5,1:sp_on 8,0
94790 pause 200:goto Buka_Input_Born_Month2:
94800 case 4:
94810 pause 200:goto Buka_Input_Born_Month2:
94820 case 9:
94830 No=8:sp_on 7,1:sp_on 10,0
94840 pause 200:goto Buka_Input_Born_Month2:
94850 case 8:
94860 No=7:sp_on 4,1:sp_on 7,0
94870 pause 200:goto Buka_Input_Born_Month2:
94880 case 7:
94890 pause 200:goto Buka_Input_Born_Month2:
94900 end select
94910 endif
94920 '右  十字キー　右　or カーソル　右
94930 if ((y2 = 1) or (key$ = chr$(28))) then
94940 select case No
94950 '0ボタンからokボタン右に移動
94960 case 0:
94970 No=-1:sp_on 14,1:sp_on 13,0
94980 pause 200:goto Buka_Input_Born_Month2:
94990 '0ボタンからokボタン 右に移動　ここまで
95000 'OKボタンで右を押して何もしない
95010 case -1:
95020 pause 200:goto Buka_Input_Born_Month2:
95030 case 1:
95040 No=2:sp_on 9,1:sp_on 6,0
95050 pause 200:goto Buka_Input_Born_Month2:
95060 case 2:
95070 No=3:sp_on 12,1:sp_on 9,0
95080 pause 200:goto Buka_Input_Born_Month2:
95090 case 3:
95100 pause 200:goto Buka_Input_Born_Month2:
95110 case 4:
95120 No=5:sp_on 8,1:sp_on 5,0
95130 pause 200:goto Buka_Input_Born_Month2:
95140 case 5:
95150 No=6:sp_on 11,1:sp_on 8,0
95160 pause 200:goto Buka_Input_Born_Month2:
95170 case 7:
95180 No=8:sp_on 7,1:sp_on 4,0
95190 pause 200:goto Buka_Input_Born_Month2:
95200 case 8:
95210 No=9:sp_on 10,1:sp_on 7,0
95220 pause 200:goto Buka_Input_Born_Month2:
95230 case 9:
95240 pause 200:goto Buka_Input_Born_Month2:
95250 case 6:
95260 pause 200:goto Buka_Input_Born_Month2:
95270 end select
95280 'Okから右ボタンを押して何もしない ここまで
95290 endif
95300 '十字キー　ここまで
95310 '右の丸ボタン　決定キー
95320 if ((bg=2) or (key$=chr$(13))) then
95330 select case count
95340 case 0:
95350 count=1:buf_buka_Month$="*":buf_buka_Month$=str$(No)+"*":buf_buka_month=No
95360 buf_Buka_Born_Day(1)=buf_buka_month:a=buf_buka_month
95370 locate 1,3
95380 color RGB(255,255,255)
95390 print "部下の生まれた月(1月~12月):"+buf_buka_Month$
95400 goto Buka_Input_Born_Month2:
95410 case 1:
95420 count = 2:buf_buka_month=a*10+No
95430 if (No = -1) then
95440 'count=0
95450 month=buf_buka_month
95460 buf_buka_month=val(buf_buka_Month$)
95470 month=buf_buka_month
95480 '生まれた日に飛ぶ
95490 goto Buka_Input_Born_Day:
95500 else
95510 buf_buka_month = a * 10 + No
95520 buf_buka_Month$ = str$(buf_buka_month)
95530 buf_Buka_Born_Day(1) = buf_buka_month
95540 locate 1,3
95550 color Rgb(255,255,255)
95560 print "部下の生まれた月(1月~12月):" + buf_buka_Month$
95570 goto Buka_Input_Born_Month2:
95580 endif
95590 case 2:
95600 count=3
95610 'c= val(buf_Month$)
95620 'buf_month = c*10 + No
95630 'buf_Month$ = str$(buf_month)
95640 'locate 2,3
95650 'print "部下の生まれた月(1月～12月):";buf_Month$
95660 'goto Buka_Input_Born_Month2:
95670 'case 3:
95680 'count=4
95690 'b=val(buf_month$)
95700 'buf_month=c*10+No
95710 'buf_Month$=str$(buf_month)
95720 'locate 2,3
95730 'print "部下の生まれた月(1月～12月):";buf_Month$
95740 'buf_month=val(buf_Month$)
95750 'year=val(buf_year$)
95760 if (No=-1) then
95770 goto Buka_Input_Born_Day:
95780 else
95790 goto Input_Born_Month2:
95800 endif
95810 'case 4:
95820 'bufyear=buf_year
95830 'if (No=-1) then
95840 'buf_month = val(buf_Month$)
95850 'month = buf_month
95860 'sp_on 14,0
95870 'goto Input_Born_Day:
95880 'else
95890 'goto Input_Born_Month2:
95900 'endif
95910 end select
95920 endif
95930 '左の丸ボタン　キャンセル
95940 if (bg2=2) then
95950 select case count2
95960 case 0:
95970 if (No = -1) then
95980 buf_buka_month=0:buf_buka_Month$="**"
95990 count=0
96000 goto rewrite2:
96010 else
96020 if ((No>=1 and No<=9) or (No>=10 and No <=12)) then
96030 buf_month=0:buf_Month$="**"
96040 locate 2,3
96050 color rgb(255,255,255)
96060 print "                                       "
96070 goto rewrite2:
96080 if (No>12) then
96090 ui_msg"値が範囲外です。"
96100 goto rewrite2:
96110 endif
96120 endif
96130 endif
96140 rewrite2:
96150 locate 2,3
96160 color rgb(255,255,255)
96170 print "                                      "
96180 locate 2,3
96190 print "部下の生まれた月(1月~12月):";buf_buka_Month$
96200 goto Buka_Input_Born_Month2:
96210 end select
96220 'endif
96230 endif
96240 end
96250 '2.部下の生まれた月'
96260 '3.部下の生まれた日'
96270 '生れた日を入力
96280 Buka_Input_Born_Day:
96290 '生まれた日入力
96300 cls 3:play ""
96310 'No=-1:Okのとき
96320 init"kb:4":key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_Day$ = "**":count=0:bg2=0
96330 for i=0 to 1
96340 buf_day(i)=0
96350 next i
96360 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
96370 '****************************************************************************************************
96380 'WUXG(1920x1200)の時ここから
96390 '****************************************************************************************************
96400 gload Gazo$ + "Screen2.png",0,0,0
96410 gload Gazo$ + "downscreen.png",0,0,800
96420 '****************************************************************************************************
96430 'WUXG(1920x1200)の時ここまで
96440 '****************************************************************************************************
96450 'Init"kb:2"
96460 '音声ファイル再生 2023.06.07
96470 play Voice$ + "Input_Born_Day_Buka_20230831.mp3"
96480 font 48
96490 locate 0,1
96500 '文字色：黒　 color rgb(0,0,0)
96510 color rgb(255,255,255)
96520 print "部下の生まれた日を入れて下さい" + chr$(13)
96530 color rgb(255,255,255)
96540 locate 1,3
96550 print "部下の生まれた日(1日~31日):";buf_Day$
96560 color rgb(255,255,255)
96570 'locate 4,6:print ":7"
96580 'locate 9,6:print ":8"
96590 'locate 12,6:print ":9"
96600 'locate 4,6
96610 'print ":7  :8  :9" + chr$(13)
96620 'color rgb(255,255,255)
96630 'locate 4,8
96640 'print ":4  :5  :6" + chr$(13)
96650 'color rgb(255,255,255)
96660 'locate 4,10
96670 'print ":1  :2  :3" + chr$(13)
96680 'locate 4,12
96690 'print "    :0"
96700 'locate 12,12
96710 'color rgb(0,0,255)
96720 'print ":Ok"
96730 sp_on 4,0: sp_on 5,0:sp_on 6,0
96740 sp_on 7,0:sp_on 8,0:sp_on 9,0
96750 sp_on 10,0:sp_on 11,0:sp_on 12,0
96760 sp_on 13,0:sp_on 14,1
96770 Buka_Input_Born_Day2:
96780 '
96790 key$="":bg=0:y=0:y2=0:bg2=0
96800 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
96810 key$ = inkey$
96820 bg = strig(1)
96830 y = stick(1)
96840 y2 = stick(0)
96850 bg2 = strig(0)
96860 pause 200
96870 wend
96880 '十字キー　ここから
96890 '上の矢印　または、十字キー上
96900 if ((y = -1) or (key$ = chr$(30))) then
96910 select case No
96920 'No=-1:okのとき:初期の状態
96930 '0kボタンから３に移動
96940 '上に行く 処理
96950 case -1:
96960 No=3:sp_on 12,1:sp_on 14,0
96970 pause 200:goto Buka_Input_Born_Day2:
96980 '選択肢:3
96990 '3ボタンから 6に移動
97000 case 3:
97010 No=6:sp_on 12,0:sp_on 11,1
97020 pause 200:goto Buka_Input_Born_Day2:
97030 '6ボタンから ９に移動
97040 case 6:
97050 No=9:sp_on 10,1:sp_on 11,0
97060 pause 200:goto Buka_Input_Born_Day2:
97070 '6ボタンから ９に移動　ここまで
97080 '9で上を押して何もしない
97090 case 9:
97100 '何もしない
97110 No=9
97120 pause 200:goto Buka_Input_Born_Day2:
97130 '9で上を押しても何もしない　ここまで
97140 '上　 0ボタンから2ボタン
97150 'sp_on 6,1:1
97160 'sp_on 8,1:5
97170 'sp_on 7,1:7
97180 case 0:
97190 No=2:sp_on 13,0:sp_on 9,1:
97200 pause 200:goto Buka_Input_Born_Day2:
97210 '上  0ボタンから2ボタン　ここまで
97220 '2から５になる 上
97230 case 2:
97240 No=5:sp_on 8,1:sp_on 9,0:
97250 pause 200:goto Buka_Input_Born_Day2:
97260 case 5:
97270 No=8:sp_on 7,1:sp_on 8,0
97280 pause 200:goto Buka_Input_Born_Day2:
97290 case 8:
97300 pause 200:goto Buka_Input_Born_Day2:
97310 case 1:
97320 No=4:sp_on 5,1:sp_on 6,0
97330 pause 200:goto Buka_Input_Born_Day2:
97340 case 4:
97350 No=7:sp_on 4,1:sp_on 5,0
97360 pause 200:goto Buka_Input_Born_Day2:
97370 case 7:
97380 pause 200:goto Buka_Input_Born_Day2:
97390 end select
97400 endif
97410 '左３　ここまで
97420 '下の矢印
97430 '中央 2
97440 if ((y=1) or (key$ = chr$(31))) then
97450 select case No
97460 '9から６に下げる
97470 case 9:
97480 No=6:sp_on 11,1:sp_on 10,0
97490 pause 200:goto Buka_Input_Born_Day2:
97500 '6から３に下げる
97510 case 6:
97520 No=3:sp_on 12,1:sp_on 11,0
97530 pause 200:goto Buka_Input_Born_Day2:
97540 '3から０ｋに変える
97550 case 3:
97560 No=-1:sp_on 14,1:sp_on 12,0
97570 pause 200:goto Buka_Input_Born_Day2:
97580 'Okから下のボタンを押しても何もしない
97590 case -1:
97600 pause 200:goto Buka_Input_Born_Day2:
97610 case 8:
97620 No=5:sp_on 8,1:sp_on 7,0
97630 pause 200:goto Buka_Input_Born_Day2:
97640 case 5:
97650 No=2:sp_on 9,1:sp_on 8,0
97660 pause 200:goto Buka_Input_Born_Day2:
97670 case 2:
97680 No=0:sp_on 13,1:sp_on 9,0
97690 pause 200:goto Buka_Input_Born_Day2:
97700 case 0:
97710 pause 200:goto Buka_Input_Born_Day2:
97720 case 7:
97730 No=4:sp_on 5,1:sp_on 4,0
97740 pause 200:goto Buka_Input_Born_Day2:
97750 case 4:
97760 No=1:sp_on 6,1:sp_on 5,0
97770 pause 200:goto Buka_Input_Born_Day2:
97780 case 1:
97790 pause 200:goto Buka_Input_Born_Day2:
97800 end select
97810 endif
97820 '左へボタン 十字キー　左　or 　カーソル左
97830 if ((y2 = -1) or (key$ = chr$(29))) then
97840 select case No
97850 'Ok ボタン  Okから　左　０に行く
97860 case -1:
97870 No=0:sp_on 13,1:sp_on 14,0
97880 pause 200:goto Buka_Input_Born_Day2:
97890 '0 ボタン  左　何もしない
97900 case 0:
97910 pause 200:goto Buka_Input_Born_Day2:
97920 case 3:
97930 No=2:sp_on 9,1:sp_on 12,0:
97940 pause 200:goto Buka_Input_Born_Day2:
97950 case 2:
97960 No=1:sp_on 6,1:sp_on 9,0:
97970 pause 200:goto Buka_Input_Born_Day2:
97980 case 1:
97990 pause 200:goto Buka_Input_Born_Day2:
98000 case 6:
98010 No=5:sp_on 8,1:sp_on 11,0
98020 pause 200:goto Buka_Input_Born_Day2:
98030 case 5:
98040 No=4:sp_on 5,1:sp_on 8,0
98050 pause 200:goto Buka_Input_Born_Day2:
98060 case 4:
98070 pause 200:goto Buka_Input_Born_Day2:
98080 case 9:
98090 No=8:sp_on 7,1:sp_on 10,0
98100 pause 200:goto Buka_Input_Born_Day2:
98110 case 8:
98120 No=7:sp_on 4,1:sp_on 7,0
98130 pause 200:goto Buka_Input_Born_Day2:
98140 case 7:
98150 pause 200:goto Buka_Input_Born_Day2:
98160 end select
98170 endif
98180 '右  十字キー　右　or カーソル　右
98190 if ((y2 = 1) or (key$ = chr$(28))) then
98200 select case No
98210 '0ボタンからokボタン右に移動
98220 case 0:
98230 No=-1:sp_on 14,1:sp_on 13,0
98240 pause 200:goto Buka_Input_Born_Day2:
98250 '0ボタンからokボタン 右に移動　ここまで
98260 'OKボタンで右を押して何もしない
98270 case -1:
98280 pause 200:goto Buka_Input_Born_Day2:
98290 case 1:
98300 No=2:sp_on 9,1:sp_on 6,0
98310 pause 200:goto Buka_Input_Born_Day2:
98320 case 2:
98330 No=3:sp_on 12,1:sp_on 9,0
98340 pause 200:goto Buka_Input_Born_Day2:
98350 case 3:
98360 pause 200:goto Buka_Input_Born_Day2:
98370 case 4:
98380 No=5:sp_on 8,1:sp_on 5,0
98390 pause 200:goto Buka_Input_Born_Day2:
98400 case 5:
98410 No=6:sp_on 11,1:sp_on 8,0
98420 pause 200:goto Buka_Input_Born_Day2:
98430 case 7:
98440 No=8:sp_on 7,1:sp_on 4,0
98450 pause 200:goto Buka_Input_Born_Day2:
98460 case 8:
98470 No=9:sp_on 10,1:sp_on 7,0
98480 pause 200:goto Buka_Input_Born_Day2:
98490 case 9:
98500 pause 200:goto Buka_Input_Born_Day2:
98510 case 6:
98520 pause 200:goto Buka_Input_Born_Day2:
98530 end select
98540 'Okから右ボタンを押して何もしない ここまで
98550 endif
98560 '十字キー　ここまで
98570 '右の丸ボタンを押したとき
98580 if ((bg = 2) or (key$ = chr$(13))) then
98590 'count :決定ボタンを押した回数
98600 select case (count)
98610 '1桁目入力
98620 case 0:
98630 count = 1:
98640 if (No = -1) then
98650 '1桁目　OKでは何もしない
98660 'goto check:
98670 No=0
98680 else
98690 'ok以外のボタンを押したとき
98700 buf_buka_day = No:buf_buka_Day$ = str$(No)
98710 if (buf_buka_day = 1 or buf_buka_day=2 or buf_buka_buka_day=3 ) then
98720 buf_buka_Day$ = str$(No) + "*"
98730 endif
98740 a=No
98750 buf_Buka_Born_Day(2) = buf_buka_day
98760 locate 1,3
98770 print"                                      "
98780 color RGB(255,255,255)
98790 locate 1,3
98800 print "部下の生まれた日(1日~31日):" + buf_buka_Day$
98810 endif
98820 check2:
98830 if (No >= 1 and No <= 9) then
98840 sp_on 14,0
98850 goto Buka_Input_Born_Day2:
98860 else
98870 sp_on 14,0
98880 goto Result_Business_Aisyou:
98890 end
98900 endif
98910 case 1:
98920 '10未満の数字ボタン+okボタン or 2桁目の数字ボタン
98930 count = 2:
98940 'locate 2,3
98950 'color RGB(255,255,255)
98960 'print "生まれた日(1日~31日):";buf_Day$
98970 'Okボタンを押したときの処理
98980 '入力値　10未満のとき
98990 'c = buf_day
99000 if (No = -1) then
99010 'c=buf_day
99020 ' buf_day = c
99030 'buf_Day$ = str$(buf_day)
99040 '10以下のとき
99050 No=0
99060 if (buf_day < 10) then
99070 sp_on 14,0
99080 goto Result_Business_Aisyou:
99090 end
99100 endif
99110 else
99120 sp_on 14,0
99130 'c=No
99140 buf_buka_day = a * 10 + No
99150 buf_buka_Day$ = str$(buf_buka_day)
99160 buf_Buka_Born_Day(2) = buf_buka_day
99170 locate 0,3
99180 color Rgb(255,255,255)
99190 print "                                       "
99200 locate 1,3
99210 print "部下の生まれた日(1日~31日):" + buf_buka_Day$
99220 goto Buka_Input_Born_Day2:
99230 endif
99240 '生まれた日　2桁目の数字　or 1桁の数字 + ok
99250 case 2:
99260 count=0
99270 'c=val(buf_Day$)
99280 'buf_day=c*10+No
99290 'buf_Day$=str$(buf_day)
99300 'day=buf_day
99310 'locate 2,3
99320 'print "生まれた日(1日〜31日):";buf_Day$
99330 'No=-1:ok ボタンを押したとき
99340 if (No = -1) then No=0
99350 if ((buf_buka_day > 0) and (buf_buka_day < 32)) then
99360 sp_on 14,0
99370 goto Result_Business_Aisyou:
99380 else
99390 goto Buka_Input_Born_Day2:
99400 endif
99410 'Okボタン以外を押したとき
99420 else
99430 c=val(buf_buka_Day$)
99440 buf_buka_day = c * 10 + No
99450 buf_buka_Day$ = str$(buf_buka_day)
99460 locate 1,3
99470 print "                "
99480 locate 1,3
99490 print "生まれた日(1日~31日):"+buf_buka_Day$
99500 goto Buka_Input_Born_Day2:
99510 'endif
99520 case 3:
99530 count=4
99540 'c=val(buf_day$)
99550 'buf_day=c*10+No
99560 'buf_day$=str$(buf_day)
99570 'locate 2,3
99580 'print "生まれた日を入れてください:";buf_day$
99590 'year=val(buf_year$)
99600 if (No = -1) then
99610 'goto Buka_Input_Born_Day:
99620 sp_on 14,0:
99630 goto complate_jyoushi:
99640 else
99650 goto Buka_Input_Born_Month2:
99660 endif
99670 'case 4:
99680 'bufyear=buf_year
99690 'if (No=-1) then
99700 'buf_day = val(buf_day$)
99710 'bufday = buf_day
99720 'sp_on 14,0
99730 goto complate_jyoushi:
99740 'else
99750 'goto Buka_Input_Born_Day2:
99760 'endif
99770 end select
99780 endif
99790 if (bg2=2) then
99800 select case count2
99810 case 0:
99820 if (No=-1) then
99830 'buf_day=0:buf_Day$="**"
99840 if (buf_buka_day >= 1 and buf_buka_day <= 31) then
99850 count=0
99860 buf_buka_day=0:buf_buka_Day$="**"
99870 goto rewrite_day3:
99880 else
99890 buf_buka_day=0:buf_buka_Day$="**"
99900 ui_msg"値が範囲外です"
99910 endif
99920 goto rewrite_day3:
99930 else
99940 goto rewrite_day3:
99950 endif
99960 rewrite_day3:
99970 locate 2,3
99980 color rgb(255,255,255)
99990 print "                                      "
100000 locate 1,3
100010 print "生まれた日(1日~31日):"+buf_buka_Day$
100020 goto Buka_Input_Born_Day2:
100030 end select
100040 endif
100050 '3.部下の生まれた日'
100060 '部下'
100070 '--------------------------------------------'
100080 'ビジネの相性　結果表示
100090 Result_Business_Aisyou:
100100 cls 3:init "kb:4"
100110 a=0:b=0:c=0:d=0:e=0:f=0
100120 bg=0:key$=""
100130 '****************************************************************************************************
100140 'WUXG(1920x1200)の時ここから
100150 '****************************************************************************************************
100160 gload Gazo$ + "Screen1.png",0,0,0
100170 gload Gazo$ + "downscreen.png",0,0,800
100180 '****************************************************************************************************
100190 'WUXG(1920x1200)の時ここから
100200 '****************************************************************************************************
100210 sp_on 14,0
100220 d = buf_Buka_Born_Day(0):e = buf_Buka_Born_Day(1):f = buf_Buka_Born_Day(2)
100230 buf_Buka = Kabara_Num(d,e,f)
100240 a_2 = buf_Buka
100250 Result_Aisyou$ = Kabara_Aisyou$(a_1,a_2)
100260 locate 0,1
100270 color rgb(255,0,0)
100280 print "●.相性診断結果１"
100290 locate 0,4:
100300 color rgb(255,255,255)
100310 print "1.上司の名前:";buffer_name$(0)
100320 locate 0,6
100330 print buf_Jyoushi_Born_Day(0) ;"." ;buf_Jyoushi_Born_Day(1);"." ;buf_Jyoushi_Born_Day(2);",数秘:";buf_Jyoushi
100340 locate 0,8
100350 print "2.部下の名前:";buffer_name$(1)
100360 locate 0,10
100370 print buf_Buka_Born_Day(0);".";buf_Buka_Born_Day(1);".";buf_Buka_Born_Day(2); ",";"数秘:";buf_Buka
100380 locate 0,12
100390 print "3.上司と部下の相性:";Result_Aisyou$
100400 locate 1,15
100410 color rgb(0,0,0)
100420 print "丸ボタン右:相性の説明,丸ボタン左:再診断"
100430 while ((bg <> 2) and (key$ <> chr$(13)) and bg2<>2 )
100440 bg = strig(1)
100450 key$ = inkey$
100460 bg2 = strig(0)
100470 pause 5
100480 wend
100490 if ((bg = 2) or (key$ = chr$(13))) then goto Result_Business_Aisyou2:
100500 if (bg2 = 2) then
100510 cls 3:goto Business_Aishou_Input_1_parson:
100520 endif
100530 'ビジネスの相性占い　結果2　説明
100540 Result_Business_Aisyou2:
100550 cls 3:bg=0:bg2=0:key$="":buf$=read_explain$(Result_Aisyou$):init "kb:4"
100560 gload Gazo$ + "Screen1.png",0,0,0
100570 locate 0,1
100580 color rgb(255,0,0)
100590 print "●.相性の説明"
100600 color rgb(255,255,255)
100610 locate 0,4
100620 print "相性:";Result_Aisyou$
100630 locate 0,6:
100640 print "相性の説明:";buf$
100650 locate 0,15
100660 color rgb(0,0,0)
100670 print "右の丸ボタン:トップ,左のボタン:前の画面"
100680 while ((bg <> 2) and (key$ <> chr$(13)) and (bg2<>2))
100690 bg = strig(1)
100700 bg2 = strig(0)
100710 key$ = inkey$
100720 pause 200
100730 wend
100740 if ((bg = 2) or (key$ = chr$(13))) then goto Main_Screen:
100750 if ((bg2 = 2)) then goto Result_Business_Aisyou:
100760 'Birds Eye Menu List
100770 Result_Birtheye_List1:
100780 'dim List$(4) Topに定義
100790 List$(0) = "1.バーズアイグリッドをもう一度診断"
100800 List$(1) = "2.診断結果"
100810 List$(2) = "3.データーを保存"
100820 List$(3) = "4.トップ画面に戻る"
100830 Birds_List1 = ui_select("List$","Menu")
100840 select case (Birds_List1)
100850 case 0: '1.もう一度診断
100860 for i=0 to 8
100870 buffer(i)=0
100880 next i
100890 goto Input_name1_Birdseye:
100900 case 1: '2.次へ行く
100910 gosub BirdsEye_Result2:
100920 case 2: '3.データーを保存
100930 ui_msg "データーを保存します"
100940 goto BirdsEye_Save_data:
100950 case 3: '4.トップに戻る
100960 for i=0 to 8
100970 buffer(i)=0
100980 next i
100990 goto Main_Screen:
101000 end select
101010 'BirdsEye Data Save
101020 BirdsEye_Save_data:
101030 if dir$(Save_data_Birdseye$) = "" then
101040 Mkdir Save_data_Birdseye$
101050 endif
101060 open Save_data_Birdseye$ + "BirdsEyedata_List.dat" for append as #1
101070 print #1,ucase$(name1$) + "," + ucase$(name2$) + "," + str$(buffer(0))+ "," + str$(buffer(1)) + "," + str$(buffer(2))+"," + str$(buffer(3)) + "," + str$(buffer(4)) + "," + str$(buffer(5)) + "," + str$(buffer(6)) + "," + str$(buffer(7)) + "," + str$(buffer(8))
101080 close #1
101090 ui_msg "データーを保存しました"
101100 goto Result_Birtheye_List1:
101110 'return
101120 '自作関数 ここから
101130 BirdsEyeGrid_Entry:
101140 cls 3:init "kb:4":key$="":bg=0:flag=0:bg2=0:play""
101150 '****************************************************************************************************
101160 'WUXG(1920x1200)の時 1280x 800の時共通　ここから
101170 '****************************************************************************************************
101180 gload Gazo$ + "BirdsEyeGrid_Entry_1080x240_20231220.png",0,0,0
101190 '****************************************************************************************************
101200 'WUXG(1920x1200)の時 1280x 800の時共通 ここまで
101210 '****************************************************************************************************
101220 font FONT
101230 if dir$(Save_data_Birdseye$ + "BirdsEyedata_List.dat") = "" then
101240 locate 1,2:print "登録件数は0件です。" + chr$(13):flag=0
101250 locate 1,4:print "右の丸:メイン画面へ行く"
101260 else
101270 flag=1
101280 open Save_data_Birdseye$ + "BirdsEyedata_List.dat" for input as #1
101290 while (eof(1)=0)
101300 line input #1,a$
101310 n = n + 1
101320 wend
101330 close #1
101340 'endif
101350 talk "登録件数は"+str$(n)+"件です。"
101360 if ((size(0)<=1280) and (size(1)<=800)) then
101370 '*****************************************************************************************************
101380 '1280x800の時　ここから
101390 '*****************************************************************************************************
101400 locate 1,3:print "登録件数は";str$(n);"件です"
101410 locate 1,6:print "左の丸：メイン画面へ行く"
101420 '*****************************************************************************************************
101430 '1280x800の時　ここまで
101440 '*****************************************************************************************************
101450 else
101460 '*****************************************************************************************************
101470 'WUXG(1920x1280)の時　ここから
101480 '*****************************************************************************************************
101490 locate 1,2:print "登録件数は";str$(n);"件です"
101500 locate 1,4:print "左の丸：メイン画面へ行く"
101510 '*****************************************************************************************************
101520 'WUXG(1920x1280)の時　ここまで
101530 '*****************************************************************************************************
101540 endif
101550 endif
101560 Entry_Count:
101570 while (bg <> 2 and key$ <> chr$(13) and bg2 <> 2)
101580 key$ = inkey$
101590 bg = strig(1)
101600 bg2 = strig(0)
101610 pause 200
101620 wend
101630 if ((bg = 2) or (key$ = chr$(13))) then
101640 if (n = 0) then
101650 '登録件数　０件のとき　メイン画面に行く
101660 goto Main_Screen:
101670 else
101680 '登録件数1件以上　次へ行く
101690 'ここを変更する
101700 goto Entry_List:
101710 endif
101720 endif
101730 if (bg2 = 2) then
101740 if (n > 0) then
101750 goto Main_Screen:
101760 else
101770 goto Entry_Count:
101780 endif
101790 endif
101800 Entry_List:
101810 cls 3:play"":color rgb(255,255,255):init "kb:4"
101820 if ((size(0)<=1280) and (size(1)<=800)) then
101830 gload Gazo$ + Gazo_WXGA$ + "Result_Birtheye1_907x680_20240222.png",0,0,0
101840 else
101850 gload Gazo$ + "Result_Birtheye1_20230630.png",0,0,0
101860 endif
101870 dim buffer_List$(11,n)
101880 'ファイル読み込み ここから
101890 open Save_data_Birdseye$ + "BirdsEyedata_List.dat" for input as #1
101900 for i=0 to 10
101910 for j=0 to n-1
101920 input #1,a$
101930 buffer_List$(i,j)=a$
101940 next j
101950 next i
101960 close #1
101970 'erase buffer_List$
101980 'color rgb(255,255,255)
101990 i=0:key$="":bg=0:init"kb:4":bg2=0
102000 while (key$ <> chr$(13) and bg <> 2 and bg2 <> 2)
102010 key$ = inkey$
102020 bg = strig(1)
102030 bg2=strig(0)
102040 pause 200
102050 wend
102060 color rgb(0,0,0)
102070 locate 1,15:print "次へ"
102080 'show_ListData:
102090 'j=0
102100 repeat (j=0)
102110 show_ListData:
102120 cls
102130 color rgb(255,255,255)
102140 locate 6,3:print buffer_List$(0,j) + buffer_List$(1,j)
102150 '1の文字データー
102160 locate 4,14:print buffer_List$(2,j)
102170 '2の文字データー
102180 locate 4,9:print buffer_List$(3,j)
102190 '3の文字データー
102200 locate 4,5:print buffer_List$(4,j)
102210 '4の文字データー
102220 locate 11,14:print buffer_List$(5,j)
102230 '5の文字データー
102240 locate 11,9:PRINT buffer_List$(6,j)
102250 '6の文字データー
102260 locate 11,5:print buffer_List$(7,j)
102270 '7の文字データー
102280 locate 16,14:print buffer_List$(8,j)
102290 '8の文字データー
102300 locate 16,9:print buffer_List$(9,j)
102310 '9の文字データー
102320 locate 16,5:print buffer_List$(10,j)
102330 color rgb(0,0,0)
102340 locate 1,15:print "右の丸：次へ"
102350 if (bg=2 or key$=chr$(13)) then
102360 j=j+1
102370 endif
102380 if (bg2=2) then
102390 goto Main_Screen:
102400 endif
102410 until (j=n)
102420 'erase buffer_List$:
102430 goto show_ListData:
102440 'ファイル読み込み　ここまで
102450 func read_explain$(ba$)
102460 d$=""
102470 buf_String$=""
102480 if ba$="A" then
102490 open Business_Aisyou_Explain$ + "Business_Result_Explain_A.dat" for input as #1
102500 line input #1,a$
102510 a1$=mid$(a$,1,12)
102520 a2$=mid$(a$,13,17)
102530 a3$=mid$(a$,30,17)
102540 a4$=mid$(a$,47,18)
102550 a5$ = a1$ + chr$(13) + a2$ + chr$(13) + a3$+chr$(13)+a4$
102560 buf_String$ = a5$
102570 close #1
102580 endif
102590 if ba$="B"  then
102600 open Business_Aisyou_Explain$ + "Business_Result_Explain_B.dat" for input as #1
102610 line input #1,b$
102620 b1$=mid$(b$,1,15)
102630 b2$=mid$(b$,16,21)
102640 'b3$=mid$(b$,33,3)
102650 b4$ = b1$ + chr$(13) + b2$ + chr$(13)
102660 buf_String$ = b4$
102670 close #1
102680 endif
102690 if ba$="C"  then
102700 open Business_Aisyou_Explain$ + "Business_Result_Explain_C.dat" for input as #1
102710 line input #1,c$
102720 c1$ = Mid$(c$,1,15)
102730 c2$ = Mid$(c$,16,33)
102740 c3$ = c1$ + chr$(13) + c2$
102750 buf_String$ = c3$
102760 close #1
102770 endif
102780 if ba$="D" then
102790 open Business_Aisyou_Explain$ + "Business_Result_Explain_D.dat" for input as #1
102800 line input #1,d$
102810 d1$=mid$(d$,1,15)
102820 d2$=mid$(d$,16,22)
102830 d3$=mid$(d$,38,7)
102840 d4$ = d1$ + chr$(13) + d2$ + chr$(13) + d3$
102850 buf_String$ = d4$
102860 close #1
102870 endif
102880 if ba$="E"  then
102890 open Business_Aisyou_Explain$ + "Business_Result_Explain_E.dat" for input as #1
102900 line input #1,e$
102910 e1$=Mid$(e$,1,16)
102920 e2$=Mid$(e$,17,16)
102930 e3$=Mid$(e$,33,12)
102940 e4$=Mid$(e$,45,17)
102950 e5$=Mid$(e$,62,17)
102960 e6$ = e1$ +chr$(13) + e2$ + chr$(13) + e3$ + chr$(13) + e4$ + chr$(13) + e5$
102970 buf_String$ = e6$
102980 close #1
102990 endif
103000 if ba$="F" then
103010 '改行を追加して表示を調整
103020 open Business_Aisyou_Explain$ + "Business_Result_Explain_F.dat" for input as #1
103030 line input #1,f$
103040 f1$=Mid$(f$,1,15)
103050 f2$=Mid$(f$,16,12)
103060 buf_String$ = f1$+chr$(13)+f2$
103070 close #1
103080 endif
103090 if ba$="G" then
103100 open Business_Aisyou_Explain$ + "Business_Result_Explain_G.dat" for input as #1
103110 line input #1,g$
103120 g1$ = mid$(g$,1,16)
103130 g2$ = mid$(g$,17,18)
103140 g3$ = mid$(g$,36,21)
103150 g4$ = mid$(g$,56,6)
103160 g5$ = g1$ + chr$(13) + g2$ + chr$(13) + g3$ + chr$(13) +g4$
103170 buf_String$ = g5$
103180 close #1
103190 endif
103200 if ba$="H" then
103210 open Business_Aisyou_Explain$ + "Business_Result_Explain_H.dat" for input as #1
103220 line input #1,h$
103230 h1$=Mid$(h$,1,17)
103240 h2$=Mid$(h$,18,21)
103250 h3$=Mid$(h$,39,20)
103260 h$ = chr$(13) + h1$ + chr$(13) + h2$ + chr$(13) + h3$
103270 buf_String$ = h$
103280 close #1
103290 endif
103300 if ba$ = "I" then
103310 open Business_Aisyou_Explain$ + "Business_Result_Explain_I.dat" for input as #1
103320 line input #1,i$
103330 i1$=Mid$(i$,1,10)
103340 i2$=Mid$(i$,11,13)
103350 i3$=Mid$(i$,25,16)
103360 i$=i1$+chr$(13)+i2$+chr$(13)+i3$
103370 buf_String$ = i$
103380 close #1
103390 endif
103400 buffer$ = buf_String$
103410 endfunc buffer$
103420 'カバラ数（数秘番号を求める）
103430 func Kabara_Num(buffer_Year,month,day)
103440 '=============================
103450 'a1:4桁のうちの1桁目を求める
103460 '例 a1:1234の4が1桁目
103470 'a2:4桁のうちの2桁目を求める
103480 '例:a2:1234の3が2桁目
103490 'a3:4桁のうちの3桁目を求める
103500 '例 a3:1234の2が3桁目
103510 'a4:4桁のうちの4桁目を求める
103520 '例 a4:1234の1が4桁目
103530 '==============================
103540 a1=0:a2=0:a3=0:a4=0:a_=0:buffer=0
103550 Year = buffer_Year
103560 '処理1　整数部分を取り出す。
103570 a4 = fix(Year / 1000)
103580 a3 = fix(Year / 100) - (a4 * 10)
103590 a2 = fix(Year / 10) - (a4 * 100 + a3 * 10)
103600 a1 = fix(Year - (a4 * 1000 + a3 * 100 + a2 * 10))
103610 '処理　２　取り出した整数部分を足す。
103620 a_ = a1 + a2 + a3 + a4 +month + day
103630 'a1=0:a2=0:a3=0:a4=0
103640 if ((a_ = 11) or (a_ > 1 and a _< 9)) then
103650 buffer = a_
103660 'else
103670 goto recomp2:
103680 'if (a_ = 10) then
103690 '  buffer = 1
103700 endif
103710 recomp2:
103720 a5=0:a6=0
103730 a5 = fix(a_ / 10)
103740 a6 = (a_) - (a5 * 10)
103750 a_ = a5 + a6
103760 if ((a_>0 and a_<10) or (a_=11) or (a_=22)) then
103770 '結果に行く
103780 goto Res2:
103790 '  if ((a_>11) and (a_<99)) then
103800 else
103810 '再度計算
103820 goto recomp2:
103830 endif
103840 '     a1 = fix(a_ / 10)
103850 '     a2 = a_ - (a1 * 10)
103860 '     a_ = a1 + a2
103870 '     buffer = a_
103880 'endif
103890 'else
103900 '    bffer = a_
103910 'endif
103920 'endif
103930 'else
103940 'talk "プログラムを終了します。"
103950 'end
103960 'endif
103970 'kabara = 10
103980 Res2:
103990 kabara = a_
104000 endfunc kabara
104010 func Kabara_Aisyou$(buff1,buff2)
104020 a=0:b=0
104030 '範囲　1~9
104040 if ((buff1 > 0 and buff1 < 10)) then
104050 a = buff1
104060 else
104070 Select case buff1
104080 case 11:
104090 buff1=9:a=buff1
104100 case 22:
104110 buff1=10:a=buff1
104120 end select
104130 endif
104140 '範囲　１~９
104150 if ((buff2 > 0 and buff2 < 10)) then
104160 b = buff2
104170 else
104180 select case buff2
104190 case 11:
104200 buff2=9:b=buff2
104210 case 12:
104220 buff2=10:b=buff2
104230 end select
104240 endif
104250 Aisyou$ = Buffer_Business_Aisyou$(a,b)
104260 endfunc Aisyou$
104270 '**********************************************************
104280 '0-0.Top Screen Recheck: ここから
104290 '**********************************************************
104300 TopScreenRecheck:
104310 color rgb(217,255,212)
104320 locate 1,3:print  "                            "
104330 locate 1,4:print  "                            "
104340 locate 1,5
104350 print "番号を選んでください"
104360 locate 1,6:print  "                            "
104370 locate 1,7:print  " :1.数秘術占い"
104380 locate 1,8:print  "                            "
104390 locate 1,9:print  "                            "
104400 locate 1,10:print  "                            "
104410 locate 1,10:print  " :2.設 定"
104420 locate 1,11:print  "                            "
104430 locate 1,12:print  "                            "
104440 locate 1,13:print  " :3.ヘルプ"
104450 locate 1,14:print  "                            "
104460 locate 1,15:print  "                            "
104470 locate 1,16:print  "                            "
104480 locate 1,16:print  " :4.(プログラムを)終了する"
104490 locate 1,17:print  "                            "
104500 locate 1,18:print  "                            "
104510 return
104520 '**********************************************************
104530 '0-0.Top Screen Recheck:　ここまで
104540 '**********************************************************
104550 '***********************************************************
104560 '1-1.数秘術トップ画面 ここから
104570 '**********************************************************
104580 Kabara_TopScreen_Recheck:
104590 color rgb(255,255,255):font FONT
104600 locate 1,5
104610 print "番号を選んでください" + chr$(13)
104620 locate 1,7
104630 print " :1.数秘術占い" + chr$(13)
104640 locate 1,10
104650 print " :2.バーズアイグリット" + chr$(13)
104660 locate 1,13
104670 print " :3.相性占い" + chr$(13)
104680 locate 1,16
104690 print " :4.トップ画面に戻る" + chr$(13)
104700 return
104710 '***************************************************************
104720 '1-1.数秘術トップ画面　ここまで
104730 '*************************************************************
104740 '**********************************************************
104750 '2-1 Setting Top Screen ここから
104760 '**********************************************************
104770 Setting_Recheck:
104780 cls:color rgb(255,255,255)
104790 locate 1,3:print  "                            "
104800 locate 1,4:print  "                            "
104810 locate 1,5:
104820 print "番号を選んでください"
104830 locate 1,6:print  "                            "
104840 locate 1,7:
104850 print " :1.トップ画面に戻る"
104860 locate 1,8:print  "                            "
104870 locate 1,9:print  "                            "
104880 locate 1,10:
104890 print " :2.バーズアイグリッドデーターリスト"
104900 locate 1,11:print  "                            "
104910 locate 1,12:print  "                            "
104920 locate 1,13:
104930 print " :3.未実装" + chr$(13)
104940 locate 1,14:print  "                            "
104950 locate 1,15:print  "                            "
104960 locate 1,16:
104970 print " :4.未実装" + chr$(13)
104980 locate 1,17:print  "                            "
104990 locate 1,18:print  "                            "
105000 return
105010 '**********************************************************
105020 '2-1 Setting Top Screen ここまで
105030 '**********************************************************
105040 '**********************************************************
105050 '3-1Help Top ReCheck ここから
105060 '**********************************************************
105070 Help_Top_ReCheck:
105080 font FONT
105090 color rgb(217,255,212)
105100 locate 1,3:print  "                       "
105110 locate 1,4:print  "                       "
105120 locate 1,5:print "番号を選んでください"
105130 locate 1,6:print  "                       "
105140 '0
105150 locate 1,7:print " :1.ルールの説明"
105160 '1
105170 locate 1,8:print  "                       "
105180 locate 1,9:print  "                       "
105190 locate 1,10:print " :2.バージョンの表示"
105200 locate 1,11:print  "                      "
105210 locate 1,12:print  "                      "
105220 '2
105230 locate 1,13:print " :3.参考文献"
105240 locate 1,14:print  "                      "
105250 locate 1,15:print  "                      "
105260 '3
105270 locate 1,16:print " :4.トップ画面に戻る"
105280 return
105290 '**********************************************************
105300 '3-1.Help Top ReCheckここまで
105310 '**********************************************************
105320 '***********************************************************
105330 '**********************************************************
105340 Suhi_Rule_Screen_Recheck:
105350 color rgb(255,255,255)
105360 font FONT
105370 locate 1,3:print  "                       "
105380 locate 1,4:print  "                       "
105390 locate 1,5
105400 print "番号を選んでください"
105410 locate 1,6:print  "                       "
105420 locate 1,7:    '〇
105430 print " :1.数秘術のやり方"
105440 locate 1,8:print  "                       "
105450 locate 1,9:print  "                       "
105460 locate 1,10:   '〇
105470 print " :2.バーズアイグリットの説明"
105480 locate 1,11:print  "                       "
105490 locate 1,12:print  "                       "
105500 locate 1,13:    '〇
105510 print " :3.トップ画面に戻る"
105520 locate 1,14:print  "                       "
105530 locate 1,15:print  "                       "
105540 return
105550 '=============================
105560 '自作関数 ここまで
105570 '1.数秘術　トップ画面
105580 '
105590 'Data_erase:を一番最後に持ってくる
105600 '=============================
105610 Data_erase:
105620 'メモリー削除
105630 erase buf_male_year
105640 erase buf_male_month
105650 erase buf_male_Born_Day
105660 erase buf_feMale_Born_Day
105670 erase buf_female_day
105680 erase buf_name1$
105690 erase buf_name2$
105700 erase buffer
105710 erase buf_chart$
105720 erase Buffer_Business_Aisyou$
105730 erase buffer_name$
105740 '上司の誕生日
105750 erase buf_Jyoushi_Born_Day
105760 '部下の誕生日
105770 erase buf_Buka_Born_Day
105780 erase buf_year
105790 erase buf_month
105800 erase buf_day
105810 'フォーカスライン
105820 erase Forcus1_buffer$
105830 erase Forcus2_buffer$
105840 erase Forcus3_buffer$
105850 'erase buffer_List$
105860 'Birds eye List Data 配列
105870 erase List$
105880 buffer$ = ""
105890 buf$ = ""
105900 buf_year$ = ""
105910 buf_Jyoushi_Kabara_Num = 0
105920 buf_Buka_Kabara_Num = 0
105930 count = 0
105940 buf_Month$ = ""
105950 buf_Day$ = ""
105960 b=0
105970 c=0
105980 No=0
105990 count=0
106000 return
