100 '(プログラムを)終了するを選択
110 cls 3
120 'AC.2019
130 '数秘術占い 2019.08.16
140 '改変履歴
150 'AC.2021
160 '"2021.03.31 α版 画面背景アップデート"
170 '"2021.04.02 β版 更にアップデート音声追加"
180 '"2021.04.03 β2版 画面表示拡張"
190 'AC.2023
200 '"2023.05.20 β3版　入力方式拡張"
210 'Version 更新履歴
220 '2023.06.04:Ver100_20230604
230 '2023.06.11:Ver101_20230611
240 '2023.06.18:Ver102_20230618
250 '2023.06.25:Ver103_20230625
260 '2023.07.02:Ver104_20230702
270 '2023.07.09:Ver105_20230709
280 '2023.07.16:Ver106_20230716
290 '2023.07.23:Ver107_20230723
300 '2023.07.30:Ver108_20230730
310 '2023.08.06:Ver109_20230806
320 '2023.08.13:Ver110_20230813
330 '2023.08.20:Ver111_20230820
340 '2023.08.27:Ver112_20230827
350 '2023.09.03:Ver113_20230903
360 '2023.09.10:Ver114_20230910
370 '2023.09.17:Ver115_20230917
380 '2023.09.24:Ver116_20230924
390 '2023.10.01:Ver117_20231001
400 '2023.10.08:Ver118_20231008
410 '2023.10.15:Ver119_20231015
420 '2023.10.22:Ver120_20231022
430 '2023.10.29:Ver121_20231029
440 '2023.11.05:Ver122_20231105
450 '2023.11.12:Ver123_20231112
460 '2023.11.19:Ver124_20231119
470 '2023.11.26:Ver125_20231126
480 '2023.12.03:Ver126_20231203
490 '2023.12.10:Ver127_20231210
500 '2023.12.17:Ver128_20231217
510 '2023.12.24:Ver129_20231224
520 '2023.12.31:Ver130_20231231
530 'AC.2024.01(Jan)
540 '2024.01.07:Ver131_20240107
550 '2024.01.14:Ver132_20240114
560 '2024.01.21:Ver133_20240121
570 '2024.01.28:Ver134_20240128
580 'AC.2024.02(Feb)
590 '2024.02.04:Ver135_20240204
600 '2024.02.11:Ver136_20240211
610 '2024.02.18:Ver137_20240218
620 '2024.02.25:Ver138_20240225
630 'AC.2024.03 (March)
640 '2024.03.03:Ver139_20240303
650 '2024.03.11:Ver140_20240311
660 '2024.03.18:Ver141_20240317
670 '2024.03.24:Ver142_20240324
680 Version$ = "Ver:1.4.2_20240324b"
690 'Gazo Folder Japan
700 Gazo$ = "./data/Picture/"
710 'Gazo Size folder
720 Gazo_1920x1200$ = "./1920x1200/"
730 Gazo_WXGA$ = "./907x680/"
740 'Gazo Folder English
750 Gazo_Eng$ = "./data/Picture/English/"
760 'Voice Folder 2023
770 Voice$ = "./data/Voice/Voice/"
780 'BirtheyeChart Data:20230626
790 Birth_eye_chart$ = "./data/chart_data/"
800 'Data Folder
810 Data$ = "./data/data/"
820 'Business Aisyou 結果説明保存フォルダ
830 Business_Aisyou_Explain$ = "./data/data/Business_Aisyou/"
840 'Save BirdsEyeGrit List Folder
850 Save_data_Birdseye$ = "./data/Parsonal_data/"
860 '変数定義 パート
870 b=0:c=0:n=0:count=0
880 '***********************************************************
890 '1.WXGAの時
900 '(1200 x 800)
910 '***********************************************************
920 if (((size(1) <= 1200) and (size(1) <= 800))) then
930 X=5:Y=200
940 FONT=32
950 '***********************************************************
960 '1.WXGAの時
970 '(1200 x 800)
980 '***********************************************************
990 else
1000 '***********************************************************
1010 '2.WUXGAの時(WXGA以外の時)
1020 '(1920 gload Gazo$ + "Selection.png",1,60,240
1030 '***********************************************************
1040 X=5:Y=300
1050 FONT=48
1060 '***********************************************************
1070 '2.WUXGAの時(WXGA以外の時)
1080 '(1920 x 1200)
1090 '***********************************************************
1100 endif
1110 'dim buffer_List$(11,1)
1120 dim buf_name1$(10),buf_name2$(10)
1130 dim buffer(9),buf_chart$(26,2)
1140 'ビジネスの相性　データー
1150 dim Buffer_Business_Aisyou$(12,12)
1160 '男女の相性
1170 dim Buffer_Bitween_sexes_Aisyou$(12,12)
1180 '生れた年代
1190 dim buf_year(4):buf_year$ = ""
1200 dim buf_month(2)
1210 dim buf_day(2)
1220 'フォーカスライン　配列
1230 dim Forcus1_buffer$(3)
1240 dim Forcus2_buffer$(3)
1250 dim Forcus3_buffer$(2)
1260 '生れた月
1270 buf_Month$ = ""
1280 '生れた日
1290 buf_Day$ = ""
1300 'buffer_name$(3):Name Data x 2 & 上司の名前 (文字データー)
1310 dim buffer_name$(3)
1320 '1-1.上司の誕生日(数値データー)
1330 dim buf_Jyoushi_Born_Day(3)
1340 '1-2.上司の数秘ナンバー(数値データー)
1350 buf_Jyoushi_Kabara_Num = 0
1360 '2-1.部下の誕生日(数値データー)
1370 dim buf_Buka_Born_Day(3)
1380 '2-2.部下の数秘ナンバー(数秘データー)
1390 buf_Buka_Kabara_Num = 0
1400 dim buf_male_year(4)
1410 dim buf_male_month(2)
1420 dim buf_male_Born_Day(2)
1430 dim buf_feMale_Born_Day(2)
1440 dim buf_female_day(2)
1450 count=0
1460 'Birds Eye List 配列
1470 dim List$(6)
1480 '部下の数秘ナンバー
1490 'File 読み込み
1500 '1.ビジネスの相性占い
1510 open Data$ + "Kabara_Business_Aisyou.csv" for input as #1
1520 for i=0 to 11
1530 for j=0 to 11
1540 input #1,a$
1550 Buffer_Business_Aisyou$(j,i) = a$
1560 next j
1570 next i
1580 close #1
1590 '2.男女の相性占い
1600 open Data$ + "Kabara_bitween_sexes_Aisyou.csv" for input as #1
1610 for i=0 to 11
1620 for j=0 to 11
1630 input #1,a$
1640 Buffer_Bitween_sexes_Aisyou$(j,i) = a$
1650 next j
1660 next i
1670 close #1
1680 '2.Birth Eye chart$
1690 '2.バーズアイグリッドを読み込む
1700 open Birth_eye_chart$ + "Birtheyechart.dat" for input as #1
1710 for j=0 to 25
1720 for i=0 to 1
1730 input #1,a$
1740 buf_chart$(j,i) = a$
1750 next i
1760 next j
1770 close #1
1780 'File 読み込み　ここまで
1790 'Main画面
1800 screen 1,1,1,1
1810 Main_Screen:
1820 cls 3:
1830 No=0
1840 '***********************************************************
1850 '1.WXGAの時
1860 '(1200 x 800)
1870 '***********************************************************
1880 if ((size(0) <= 1280) and (size(1) <= 800)) then
1890 gload Gazo$ + "Selection.png",1,5,220
1900 gload Gazo$ + "Selection.png",1,5,320
1910 gload Gazo$ + "Selection.png",1,5,420
1920 gload Gazo$ + "Selection.png",1,5,520
1930 '***********************************************************
1940 '1(4)
1950 gload Gazo$ + "Selection.png",1,130,420
1960 '2(5)
1970 gload Gazo$ + "Selection.png",1,280,420
1980 '3(6)
1990 gload Gazo$ + "Selection.png",1,430,420
2000 '4(7)
2010 gload Gazo$ + "Selection.png",1,130,330
2020 '5(8)
2030 gload Gazo$ + "Selection.png",1,280,330
2040 '6(9)
2050 'gload Gazo$ + "Selection.png",1,70,500
2060 gload Gazo$ + "Selection.png",1,430,330
2070 '7(10)
2080 gload Gazo$ + "Selection.png",1,130,250
2090 '8(11)
2100 gload Gazo$ + "Selection.png",1,280,250
2110 '9(12)
2120 gload Gazo$ + "Selection.png",1,430,250
2130 '0(13)
2140 gload Gazo$ + "Selection.png",1,280,495
2150 '14:(-1)OK ボタン
2160 gload Gazo$ + "Selection.png",1,430,495
2170 '***********************************************************
2180 '1.WXGAの時
2190 '(1200 x 800)
2200 '***********************************************************
2210 else
2220 '***********************************************************
2230 '2.WXGA(1200 x 800)以外の時
2240 '(1920 x 1200)のサイズ
2250 '***********************************************************
2260 gload Gazo$ + "Selection.png",1,5,200
2270 gload Gazo$ + "Selection.png",1,5,300
2280 gload Gazo$ + "Selection.png",1,5,400
2290 gload Gazo$ + "Selection.png",1,5,500
2300 '4:1
2310 gload Gazo$ + "Selection.png",1,35,300
2320 '5:2
2330 gload Gazo$ + "Selection.png",1,35,400
2340 '6:3
2350 gload Gazo$ + "Selection.png",1,35,500
2360 '7:4
2370 gload Gazo$ + "Selection.png",1,70,300
2380 '8:5
2390 gload Gazo$ + "Selection.png",1,70,400
2400 '9:6
2410 gload Gazo$ + "Selection.png",1,70,500
2420 '10:7
2430 gload Gazo$ + "Selection.png",1,540,300
2440 '11:8
2450 gload Gazo$ + "Selection.png",1,540,400
2460 '12:9
2470 gload Gazo$ + "Selection.png",1,540,500
2480 '13:0
2490 gload Gazo$ + "Selection.png",1,150,400
2500 '-1:Ok
2510 gload Gazo$ + "Selection.png",1,200,400
2520 '***********************************************************
2530 '2.WXGA(1200 x 800)以外の時
2540 '(1920 x 1200)のサイズ
2550 '***********************************************************
2560 endif
2570 if ex_info$(1) <> "JP" then
2580 '英語　トップ画面
2590 gload Gazo_Eng$ + "Kabara_TopScreen_Eng_20240110.png",0,0,0
2600 'put@(0,0),1280,800,(1080,800)
2610 else
2620 '**********************************************************
2630 '［機能］　グラフィックバッファ（2番目の座標）からグラフィック画面（1番目の座標）へ画像データを引き出します。
2640 '
2650 '　［書式］　PUT@(x1,y1),w1,h1,(x2,y2)[,[w2],[h2][,描画モード]]
2660 '　［説明］
2670 '　　w1,w2=横サイズ h1,h2= 縦サイズ
2680 '　　転写元と転写先のサイズが異なる場合、拡大縮小描画されます。
2690 '　　各種重ね合わせの方式は pen命令で設定することができます。
2700 '　　<描画モード>の指定で次の選択ができます。
2710 '　　 0. グラフィックバッファからグラフィック画面への描画。
2720 '　　 1. グラフィック画面からグラフィック画面への描画。
2730 '　　 2. グラフィックバッファからグラフィックバッファへの描画。
2740 '***********************************************************'
2750 '*************************************************************************************************
2760 'if (((size(0) >= 1280) and (size(0) <= 1920)) and ((size(1) <= 1200) and (size(1) > 800))) then
2770 '日本語トップスクリーン
2780 'gload Gazo$ + "TopScreen_20230310.png",0,0,0
2790 'else
2800 '1.WXGAの時
2810 '************************************************************************************************
2820 if ((size(0) <= 1280) and (size(1) <= 800)) then
2830 gload Gazo$ + Gazo_WXGA$ + "Screen1_907x680_20240214.png",0,0,0
2840 else
2850 '************************************************************************************************
2860 '2.WXGA以外の時
2870 '************************************************************************************************
2880 gload Gazo$ + "TopScreen_20230310.png",0,0,0
2890 endif
2900 'put@(0,0),1280,800,(1080,800),,,0
2910 endif
2920 '***********************************************************************************************
2930 'if (((size(0) >= 1280) and (size(0) <= 1920)) and ((size(1) <= 1200) and (size(1) > 800))) then
2940 '***********************************************************************************************
2950 if ((size(0) <= 1280) and (size(1) <= 800)) then
2960 '************************************************************************************************
2970 'WXGAの場合　ここから (1280 x 800)
2980 '************************************************************************************************
2990 sp_def 0,(5,220),32,32
3000 sp_def 1,(5,320),32,32
3010 sp_def 2,(5,420),32,32
3020 sp_def 3,(5,520),32,32
3030 '1(4)
3040 sp_def 4,(130,420),32,32
3050 '2(5)
3060 sp_def 5,(280,420),32,32
3070 '3(6)
3080 sp_def 6,(430,420),32,32
3090 '4(7)
3100 sp_def 7,(130,330),32,32
3110 '5(8)
3120 sp_def 8,(280,330),32,32
3130 '6(9)
3140 sp_def 9,(430,330),32,32
3150 '9(10):9
3160 sp_def 10,(130,250),32,32
3170 '6(11):6
3180 sp_def 11,(280,250),32,32
3190 '9(12):3
3200 sp_def 12,(430,250),32,32
3210 sp_def 13,(280,495),32,32
3220 '14:OK ボタン (-1)
3230 sp_def 14,(430,495),32,32
3240 'Sprite OFF
3250 sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_on 4,0:sp_on 5,0:sp_on 6,0
3260 sp_on 7,0:sp_on 8,0:sp_on 9,0:sp_on 10,0:sp_on 11,0:sp_on 12,0:sp_on 13,0:sp_on 14,0
3270 sp_put 0,(5,220),0,0
3280 sp_put 1,(5,320),1,0
3290 sp_put 2,(4,420),2,0
3300 sp_put 3,(5,520),3,0
3310 '1
3320 sp_put 4,(130,420),4,0
3330 '2
3340 sp_put 5,(280,420),5,0
3350 '3
3360 sp_put 6,(430,420),6,0
3370 '4
3380 sp_put 7,(130,330),7,0
3390 '5
3400 sp_put 8,(280,330),8,0
3410 '6
3420 sp_put 9,(430,330),9,0
3430 '7
3440 sp_put 10,(130,250),10,0
3450 '8
3460 sp_put 11,(280,250),11,0
3470 '9
3480 sp_put 12,(430,250),12,0
3490 '0
3500 sp_put 13,(280,495),13,0
3510 '14:OK ボタン
3520 sp_put 14,(430,495),14,0
3530 '************************************************************************************************
3540 'WXGAの場合　ここまで (1280 x 800)
3550 '************************************************************************************************
3560 else
3570 '選択肢の丸
3580 '************************************************************************************************
3590 'WUXGAの場合　ここから (1920 x 1280)
3600 '************************************************************************************************
3610 gload Gazo$ + "downscreen.png",0,0,800
3620 sp_def 0,(5,300),32,32
3630 sp_def 1,(5,400),32,32
3640 sp_def 2,(5,500),32,32
3650 sp_def 3,(5,600),32,32
3660 '************************************************************************************************
3670 'sp_def  1920x1260 ここから
3680 '************************************************************************************************
3690 '1
3700 sp_def 4,(35,300),32,32
3710 '2
3720 sp_def 5,(35,400),32,32
3730 '3
3740 sp_def 6,(35,500),32,32
3750 '4:9
3760 sp_def 7,(70,300),32,32
3770 '5:6
3780 sp_def 8,(70,400),32,32
3790 '6:3
3800 sp_def 9,(70,500),32,32
3810 '**********************************************************************************************
3820 '10:7
3830 'gload Gazo$ + "Selection.png",1,430,300
3840 '11:8
3850 'gload Gazo$ + "Selection.png",1,430,420
3860 '12:9
3870 'gload Gazo$ + "Selection.png",1,430,500
3880 '**********************************************************************************************
3890 '7:3
3900 sp_def 10,(540,300),32,32
3910 '8:6
3920 sp_def 11,(540,400),32,32
3930 '9:9
3940 sp_def 12,(540,500),32,32
3950 '************************************************************************************************
3960 '0
3970 sp_def 13,(150,400),32,32
3980 '-1:ok Button
3990 sp_def 14,(200,400),32,32
4000 '************************************************************************************************
4010 'sp_def 1920x1260 ここまで
4020 '************************************************************************************************
4030 '1
4040 'sp_def 4,(35,300),32,32
4050 '2
4060 'sp_def 5,(35,400),32,32
4070 '3
4080 'sp_def 6,(35,500),32,32
4090 '4
4100 'sp_def 7,(70,300),32,32
4110 '5
4120 'sp_def 8,(70,400),32,32
4130 '6
4140 'sp_def 9,(70,500),32,32
4150 '7
4160 'sp_def 10,(110,300),32,32
4170 '8
4180 'sp_def 11,(110,400),32,32
4190 '9
4200 'sp_def 12,(110,400),32,32
4210 'sp_def 13,(150,400),32,32
4220 'sp_def 14,(200,400),32,32
4230 'Sprite OFF
4240 sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_on 4,0:sp_on 5,0:sp_on 6,0
4250 sp_on 7,0:sp_on 8,0:sp_on 9,0:sp_on 10,0:sp_on 11,0:sp_on 12,0:sp_on 13,0:sp_on 14,0
4260 '***********************************************************************************************************
4270 '選択肢の●　ここから  1920x1260  ここから
4280 '***********************************************************************************************************
4290 sp_put 0,(5,300),0,0
4300 sp_put 1,(5,400),1,0
4310 sp_put 2,(5,500),2,0
4320 sp_put 3,(5,600),3,0
4330 '***********************************************************************************************************
4340 '選択肢の● ここまで 1920x1260    ここまで
4350 '**********************************************************************************************************
4360 '********************************************************************************************************
4370 'sp_put 1920x1260 ここから
4380 '*********************************************************************************************************
4390 '1. 左
4400 '1
4410 sp_put 4,(130,300),4,0
4420 '2
4430 sp_put 5,(130,400),5,0
4440 '3
4450 sp_put 6,(130,500),6,0
4460 '2.中央
4470 '4
4480 sp_put 7,(340,300),7,0
4490 '5
4500 sp_put 8,(340,400),8,0
4510 '6
4520 sp_put 9,(340,500),9,0
4530 '右
4540 '7 (3)
4550 sp_put 10,(540,300),10,0
4560 '8 (6)
4570 sp_put 11,(540,400),11,0
4580 '9 (9)
4590 sp_put 12,(540,500),12,0
4600 '0
4610 sp_put 13,(340,600),13,0
4620 'ok Button
4630 sp_put 14,(540,600),14,0
4640 '*********************************************************************************************************
4650 'sp_put 1920x1260 ここまで
4660 '**********************************************************************************************************
4670 '1
4680 'sp_put 4,(130,300),4,0
4690 '2
4700 'sp_put 5,(130,400),5,0
4710 '3
4720 'sp_put 6,(130,500),6,0
4730 '4
4740 'sp_put 7,(340,300),7,0
4750 '5
4760 'sp_put 8,(340,400),8,0
4770 '6
4780 'sp_put 9,(340,500),9,0
4790 '7
4800 'sp_put 10,(540,300),10,0
4810 '8
4820 'sp_put 11,(540,400),11,0
4830 '9
4840 'sp_put 12,(540,500),12,0
4850 '0
4860 'sp_put 13,(340,600),13,0
4870 'sp_put 14,(540,600),14,0
4880 '************************************************************************************************
4890 'WUXGAの場合　ここまで  (1920 x 1200)
4900 '************************************************************************************************
4910 endif
4920 Main_Top:
4930 'Main Message 2023.06.07
4940 '再生を止める
4950 play ""
4960 init "kb:4"
4970 'font 32:
4980 font 40
4990 if ex_info$(1) <> "JP" then
5000 '1.英語表示ターム
5010 print chr$(13) + chr$(13) + chr$(13)
5020 color rgb(217,255,212)
5030 print "Please Select Number?" + chr$(13)+chr$(13)
5040 '0
5050 print " :1.Kabara Fortune..." + chr$(13)+chr$(13)
5060 '1
5070 print " :2.Setting" + chr$(13)+chr$(13)
5080 '2
5090 print " :3.Help" + chr$(13)
5100 '3
5110 print " :4.(Finishing)Program" + chr$(13)
5120 COLOR rgb(0,0,0):No=0
5130 locate 1,15
5140 print "                                        "
5150 locate 1,15
5160 print "1.It has Selected Kabara Fortune Telling"
5170 '1.英語表示ターム
5180 '---------音声 日本語　英語に変える----------------
5190 'play Voice$ + "Voice_Main_Message_20230607.mp3"
5200 '---------音声 日本語　英語に変える----------------
5210 else
5220 '2.日本語表示ターム
5230 'Main_Screen_Select:
5240 '************************************************************************************************
5250 '1.WXGAの場合　ここから (1280 x 800)
5260 '************************************************************************************************
5270 if ((size(0) <= 1280) and (size(1) <= 800)) then
5280 '************************************************************************************************
5290 '1.WXGAの場合　ここから (1280 x 800)
5300 '************************************************************************************************
5310 font FONT
5320 color rgb(217,255,212)
5330 locate 1,5
5340 print "番号を選んでください"
5350 '0
5360 locate 1,7
5370 print " :1.数秘術占い"
5380 '1
5390 locate 1,10
5400 print " :2.設 定"
5410 '2
5420 locate 1,13
5430 print " :3.ヘルプ"
5440 '3
5450 locate 1,16
5460 print " :4.(プログラムを)終了する"
5470 COLOR rgb(0,0,0):No=0
5480 'locate 1,15
5490 '3行下げる
5500 if (count = 0) then
5510 locate 1,19
5520 print "           "
5530 locate 1,19:color rgb(0,0,0):print "1.数秘術占いを選択"
5540 play Voice$ + "Voice_Main_Message_20230607.mp3"
5550 endif
5560 '************************************************************************************************
5570 '1.WXGAの場合　ここまで (1280 x 800)
5580 '************************************************************************************************
5590 '2.日本語表示ターム
5600 else
5610 '************************************************************************************************
5620 '2.WXGA以外の場合（WUXGAの場合）　ここから (1920 x 1280)
5630 '************************************************************************************************
5640 font FONT
5650 print chr$(13) + chr$(13) + chr$(13)
5660 color rgb(217,255,212)
5670 print "番号を選んでください" + chr$(13)
5680 '0
5690 print " :1.数秘術占い" + chr$(13)
5700 '1
5710 print " :2.設 定" + chr$(13)
5720 '2
5730 print " :3.ヘルプ" + chr$(13)
5740 '3
5750 print " :4.(プログラムを)終了する" + chr$(13)
5760 COLOR rgb(0,0,0):No=0
5770 'locate 1,15
5780 '3行下げる
5790 if count=0 then
5800 locate 1,15
5810 print "           "
5820 locate 1,15:color rgb(0,0,0):print "1.数秘術占いを選択"
5830 play Voice$ + "Voice_Main_Message_20230607.mp3"
5840 endif
5850 '************************************************************************************************
5860 '2.WXGA以外の場合（WUXGAの場合）　ここまで (1920 x 1280)
5870 '************************************************************************************************
5880 endif
5890 '************************************************************************************************
5900 '2.WXGA以外の場合（WUXGAの場合）　ここまで (1920 x 1280)
5910 '************************************************************************************************
5920 endif
5930 Main_Screen_Select:
5940 y = 0:key$ = "":bg = 0:bg2=0
5950 while ((key$ <> chr$(31)) and (key$ <> chr$(13)) and (key$ <> chr$(30)) and (y <> 1) and (y <> -1) and (bg <> 2) and (bg2 <> 2))
5960 y = stick(1)
5970 '"May (2023)"
5980 key$ = inkey$
5990 bg = strig(1)
6000 bg2 = strig(0)
6010 pause 200
6020 wend
6030 '*******************************************************************************************************************************
6040 '  WUXGA(1920 x 1200)
6050 '  X=5:Y=300
6060 '  WXGA (1280 x 800)
6070 '  X=5:Y=200
6080 '*******************************************************************************************************************************
6090 '1.
6100 'ジョイパッドのソース ソート　ここから
6110 'カーソル　下 or 十字キー下
6120 '************************************************************************************************
6130 '1.WXGAの場合　ここから (1280 x 800)
6140 '************************************************************************************************
6150 if ((size(0) <= 1280) and (size(1) <= 800)) then
6160 '************************************************************************************************
6170 '1.WXGAの場合　ここから (1280 x 800)
6180 '************************************************************************************************
6190 if ((y = 1) or (key$ = chr$(31))) then
6200 select case No
6210 case 0:
6220 '1
6230 No = 1:sp_on 0,0:sp_on 1,1:sp_on 2,0:sp_on 3,0:sp_put 1,(X,Y+120),0,0:count = count + 1:beep:pause 200:gosub TopScreenRecheck:locate 1,19:print "                          ":locate 1,19:color rgb(0,0,0):print "2.設 定を選択":count=cunt+1:goto Main_Screen_Select:
6240 case 1:
6250 '2
6260 No = 2:sp_on 1,0:sp_on 2,1:sp_on 3,0:sp_put 2,(X,Y+220),0,0:beep:count = count + 1:pause 200:gosub TopScreenRecheck:locate 1,19:print "                                 ":locate 1,19:color rgb(0,0,0):print "3.ヘルプを選択":count=count+1:goto Main_Screen_Select:
6270 case 2:
6280 '3
6290 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(X,Y+320),0,0:beep:count = count + 1:pause 200:gosub TopScreenRecheck:locate 1,19:print "                            ":locate 1,19:color rgb(0,0,0):print "4.(プログラムを)終了するを選択":count=count+1:goto Main_Screen_Select:
6300 case 3:
6310 '0
6320 No=0:sp_on 0,1:sp_on 3,0:sp_on 1,0:sp_on 2,0:sp_put 0,(X,Y+20),0,0:beep:pause 200:count = count + 1:gosub TopScreenRecheck:locate 1,19:print "                              ":locate 1,19:color rgb(0,0,0):print "1.数秘術占いを選択":count=count+1:goto Main_Screen_Select:
6330 end select
6340 endif
6350 '2.
6360 'カーソル　上　or 十字キー  上
6370 if ((y = -1) or (key$ = chr$(30))) then
6380 select case No
6390 case 0:
6400 '3
6410 No=3:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,1:sp_put 3,(X,Y+320),0,0:beep:count = count + 1:pause 200:gosub TopScreenRecheck:locate 1,19:print "                              ":locate 1,19:COLOR rgb(0,0,0):print "4.(プログラムを)終了するを選択":goto Main_Screen_Select:
6420 case 1:
6430 '0
6440 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(X,Y+20),0,0:beep:count = count + 1:pause 200:gosub TopScreenRecheck:locate 1,19:print "                            ":locate 1,19:COLOR rgb(0,0,0):print  "1.数秘術占いを選択":goto Main_Screen_Select:
6450 case 2:
6460 '1
6470 No=1:sp_on 0,0:sp_on 1,1:sp_on 2,0:sp_on 3,0:sp_put 1,(X,Y+120),0,0:beep:count = count + 1:pause 200:gosub TopScreenRecheck:locate 1,19:print "                          ":locate 1,19:color rgb(0,0,0):print "2.設 定を選択":goto Main_Screen_Select:
6480 case 3:
6490 '2
6500 No=2:sp_on 0,0:sp_on 1,0:sp_on 2,1:sp_on 3,0:sp_put 2,(X,Y+220),0,0:beep:count = count + 1:pause 200:gosub TopScreenRecheck:locate 1,19:print "                   ":locate 1,19:color rgb(0,0,0):print "3.ヘルプを選択":goto Main_Screen_Select:
6510 end select
6520 endif
6530 'ジョイパッド　ソース 部分　ここまで
6540 'ジョイパッド右　　or Enter key 決定
6550 if ((bg = 2) OR (key$ = chr$(13))) then
6560 select case No
6570 case 0:
6580 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:count=0:goto Kabara_TopScreen: 'Kabara_First_Top:
6590 case 1:
6600 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:count=0:goto Setting:
6610 case 2:
6620 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:count=0:goto Help:
6630 case 3:
6640 play "":pause 200
6650 play Voice$ + "Voice_Finish_Program_20230607.mp3":ui_msg "プログラムを終了します":Gosub Data_erase:pause 200:color rgb(255,255,255):cls 3:cls 4:font 16:end
6660 end select
6670 endif
6680 if (bg2 = 2) then
6690 play "":pause 200
6700 play Voice$ + "Voice_Main_Message_20230607.mp3"
6710 goto Main_Screen_Select:
6720 endif
6730 '************************************************************************************************
6740 '1.WXGAの場合　ここまで (1280 x 800)
6750 '************************************************************************************************
6760 else
6770 '************************************************************************************************
6780 '2.WXGA以外の場合（WUXGAの場合）　ここから (1920 x 1280)
6790 '************************************************************************************************
6800 if ((y = 1) or (key$ = chr$(31))) then
6810 select case No
6820 case 0:
6830 '1
6840 No = 1:sp_on 0,0:sp_on 1,1:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.設 定を選択":goto Main_Screen_Select:
6850 case 1:
6860 '2
6870 No = 2:sp_on 1,0:sp_on 2,1:sp_on 3,0:sp_put 2,(5,500),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "3.ヘルプを選択":goto Main_Screen_Select:
6880 case 2:
6890 '3
6900 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "4.(プログラムを)終了するを選択":goto Main_Screen_Select:
6910 case 3:
6920 '0
6930 No=0:sp_on 0,1:sp_on 3,0:sp_on 1,0:sp_on 2,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                                ":locate 1,15:print "1.数秘術占いを選択":goto Main_Screen_Select:
6940 end select
6950 endif
6960 '2.
6970 'カーソル　上　or 十字キー  上
6980 '************************************************************************************************
6990 '2.WXGA以外の場合（WUXGAの場合）　ここから (1920 x 1280)
7000 'カーソル　上　or 十字キー  上
7010 '************************************************************************************************
7020 if ((y = -1) or (key$ = chr$(30))) then
7030 select case No
7040 case 0:
7050 '3
7060 No=3:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,1:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                                          ":locate 1,15:print "4.(プログラムを)終了するを選択":goto Main_Screen_Select:
7070 case 1:
7080 '0
7090 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                                          ":locate 1,15:print  "1.数秘術占いを選択":goto Main_Screen_Select:
7100 case 2:
7110 '1
7120 No=1:sp_on 0,0:sp_on 1,1:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),0,0:beep:pause 200:locate 1,15:print "                                                                                ":locate 1,15:print "2.設 定を選択":goto Main_Screen_Select:
7130 case 3:
7140 '2
7150 No=2:sp_on 0,0:sp_on 1,0:sp_on 2,1:sp_on 3,0:sp_put 2,(5,500),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "3.ヘルプを選択":goto Main_Screen_Select:
7160 end select
7170 endif
7180 'ジョイパッド　ソース 部分　ここまで
7190 '***************************************************************************************************************
7200 'ジョイパッド右　　or Enter key 決定
7210 '***************************************************************************************************************
7220 if ((bg = 2) OR (key$ = chr$(13))) then
7230 select case No
7240 case 0:
7250 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:count=0:goto Kabara_TopScreen:  'Kabara_First_Top:
7260 case 1:
7270 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:count=0:goto Setting:
7280 case 2:
7290 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:count=0:goto Help:
7300 case 3:
7310 play "":pause 200
7320 play Voice$ + "Voice_Finish_Program_20230607.mp3":ui_msg "プログラムを終了します":Gosub Data_erase:pause 200:color rgb(255,255,255):cls 3:cls 4:end
7330 end select
7340 endif
7350 '*****************************************************************************************
7360 'ジョイパッド 左ボタン：トップ画面
7370 '*****************************************************************************************
7380 if (bg2 = 2) then
7390 play "":pause 200
7400 play Voice$ + "Voice_Main_Message_20230607.mp3"
7410 goto Main_Screen_Select:
7420 endif
7430 '************************************************************************************************
7440 '2.WXGA以外の場合（WUXGAの場合）　ここまで (1920 x 1280)
7450 '************************************************************************************************
7460 endif
7470 'Version
7480 Version:
7490 cls 3:PLAY ""
7500 if ((size(0) <= 1280) and (size(1) <= 800)) then
7510 '************************************************************************************************
7520 '1.WXGA ここから (1280 x 800)
7530 '************************************************************************************************
7540 gload Gazo$   + Gazo_WXGA$ + "VersionScreen_918x680_20240219.png",0,0,0
7550 '************************************************************************************************
7560 '1.WXGA ここまで (1280 x 800)
7570 '************************************************************************************************
7580 else
7590 '************************************************************************************************
7600 '2.WXGA以外の場合（WUXGAの場合）　ここから (1920 x 1280)
7610 '************************************************************************************************
7620 gload Gazo$  + "VersionScreen_20230601.png",0,0,0
7630 gload Gazo$ + "downscreen.png",0,0,800
7640 '************************************************************************************************
7650 '2.WXGA以外の場合（WUXGAの場合）　ここまで (1920 x 1280)
7660 '************************************************************************************************
7670 endif
7680 init"kb:4":font FONT
7690 'talk"バージョン情報です"
7700 'Message :Version
7710 play Voice$ +  "Voice_Version_Message_20230607.mp3"
7720 if ((size(0) <= 1280) and (size(1) <= 800)) then
7730 color rgb(0,0,255)
7740 locate 1,5
7750 print "・Title:数秘術占い";chr$(13)
7760 locate 1,8
7770 print "・" + Version$ + chr$(13)
7780 locate 1,10
7790 print "・Author:licksjp"+chr$(13)
7800 locate 1,13
7810 print "・E-mail:licksjp@gmail.com" + chr$(13)
7820 locate 0,15
7830 print "(C)licksjp All rights " + chr$(13)
7840 locate 7,16
7850 print "reserved since 2009"+chr$(13)
7860 locate 0,19
7870 color rgb(255,255,255)
7880 print "ジョイパッドの右を押してください"
7890 else
7900 locate 0,3
7910 color rgb(0,0,255)
7920 print "・Title:数秘術占い";chr$(13)
7930 print "・" + Version$ + chr$(13)
7940 print "・Author:licksjp"+chr$(13)
7950 print "・E-mail:licksjp@gmail.com" + chr$(13)
7960 locate 0,12
7970 print "(C)licksjp All rights " + chr$(13)
7980 locate 7,13
7990 print "reserved since 2009"+chr$(13)
8000 locate 0,18
8010 color rgb(255,255,255)
8020 print "ジョイパッドの右を押してください"
8030 endif
8040 Versionn_Selection:
8050 bg = 0:key$ = "":bg2 = 0
8060 while ((bg <> 2) and (key$ <> chr$(13)) and (bg2 <> 2))
8070 bg = strig(1)
8080 key$ = inkey$
8090 bg2 = strig(0)
8100 pause 200
8110 wend
8120 if ((bg = 2) or (key$ = chr$(13))) then
8130 cls 4:goto Main_Screen:
8140 endif
8150 if (bg2=2) then
8160 play "":pause 200
8170 play Voice$ + "Voice_Version_Message_20230607.mp3"
8180 goto Versionn_Selection:
8190 endif
8200 '1.数秘ナンバーを求める
8210 '誕生日入力(生れた年代)
8220 Input_Seireki:
8230 '************************************************************************************************
8240 '1.WXGAの時1200x800の時
8250 '************************************************************************************************
8260 '************************************************************************************************
8270 '2.WUXGAの時1920x1200の時
8280 '************************************************************************************************
8290 cls 3:play "":count=0:count2=0
8300 'No = -1:Okのとき
8310 init"kb:4":key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_year$ = "****"
8320 '************************************************************************************************
8330 '配列buf_year(4)を0で埋める。:データー初期化 ここから
8340 '************************************************************************************************
8350 for i=0 to 3
8360 buf_year(i)=0
8370 next i
8380 '************************************************************************************************
8390 '配列buf_year(4)を0で埋める。 :データー初期化　ここまで
8400 '************************************************************************************************
8410 '************************************************************************************************
8420 '1.WXGAの時1200x800の時
8430 '************************************************************************************************
8440 if ((size(0) <= 1280) and (size(1) <= 800)) then
8450 gload Gazo$ + Gazo_WXGA$ + "Screen2_907x680_20240216.png",0,0,0
8460 else
8470 '************************************************************************************************
8480 '2.WUXGAの時1920x1200の時
8490 '************************************************************************************************
8500 gload Gazo$ + "Screen2.png",0,0,0
8510 gload Gazo$ + "downscreen.png",0,0,800
8520 '************************************************************************************************
8530 '2.WUXGAの時1920x1200の時
8540 '************************************************************************************************
8550 endif
8560 'Init"kb:2"
8570 '音声ファイル再生 2023.06.07
8580 play Voice$ + "Voice_Input_Born_Year_20230607.mp3"
8590 font FONT
8600 locate 0,1
8610 if ex_info$(1) <> "JP" then
8620 color rgb(255,255,255)
8630 color rgb(255,255,255)
8640 print "Input Born Year?" + chr$(13)
8650 color rgb(255,255,255)
8660 locate 2,4
8670 print "Your Born Year(4 dedgit for AC):" + buf_year$
8680 else
8690 '文字色：黒　 color rgb(0,0,0)
8700 color rgb(255,255,255)
8710 print "生まれた年代を入れて下さい" + chr$(13)
8720 color rgb(255,255,255)
8730 locate 2,4
8740 print "生まれた年代(西暦4桁):" + buf_year$
8750 endif
8760 '=============================
8770 'テンキーの色(1~９)　白 ,決定ボタン　青
8780 '=============================
8790 color rgb(255,255,255)
8800 sp_on 4,0: sp_on 5,0:sp_on 6,0
8810 sp_on 7,0:sp_on 8,0:sp_on 9,0
8820 sp_on 10,0:sp_on 11,0:sp_on 12,0
8830 sp_on 13,0:sp_on 14,1
8840 Input_Seireki2:
8850 key$="":bg=0:y=0:y2=0:bg2=0:
8860 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
8870 key$ = inkey$
8880 bg = strig(1)
8890 y = stick(1)
8900 y2 = stick(0)
8910 bg2 = strig(0)
8920 pause 200
8930 wend
8940 if ((size(0) <= 1280) and (size(1) <= 800)) then
8950 '*************************************************************************************************************************
8960 'WXGA　1280 x 800 ここから
8970 '*************************************************************************************************************************
8980 '十字キー　ここから
8990 '上の矢印　または、十字キー上
9000 if ((y = -1) or (key$ = chr$(30))) then
9010 select case No
9020 'No=-1:okのとき:初期の状態
9030 '0kボタンから３に移動
9040 '上に行く 処理
9050 case -1:
9060 No=3:sp_on 6,1:sp_on 14,0:beep
9070 pause 200:goto Input_Seireki2:
9080 '選択肢:3
9090 '3ボタンから 6に移動
9100 case 3:
9110 No=6:sp_on 9,1:sp_on 6,0:beep
9120 pause 200:goto Input_Seireki2:
9130 '6ボタンから ９に移動
9140 case 6:
9150 No=9:sp_on 12,1:sp_on 9,0:beep
9160 pause 200:goto Input_Seireki2:
9170 '6ボタンから ９に移動　ここまで
9180 '9で上を押して何もしない
9190 case 9:
9200 '何もしない
9210 No=9
9220 beep:pause 200:goto Input_Seireki2:
9230 '9で上を押しても何もしない　ここまで
9240 '上　 0ボタンから2ボタン
9250 'sp_on 6,1:1
9260 'sp_on 8,1:5
9270 'sp_on 7,1:7
9280 case 0:
9290 No=2:sp_on 13,0:sp_on 5,1:beep
9300 pause 200:goto Input_Seireki2:
9310 '上  0ボタンから2ボタン　ここまで
9320 '2から５になる 上
9330 case 2:
9340 No=5:sp_on 8,1:sp_on 5,0:beep
9350 pause 200:goto Input_Seireki2:
9360 case 5:
9370 No=8:sp_on 11,1:sp_on 8,0:beep
9380 pause 200:goto Input_Seireki2:
9390 case 8:
9400 beep:pause 200:goto Input_Seireki2:
9410 case 1:
9420 No=4:sp_on 7,1:sp_on 4,0:beep
9430 pause 200:goto Input_Seireki2:
9440 case 4:
9450 No=7:sp_on 10,1:sp_on 7,0:beep
9460 pause 200:goto Input_Seireki2:
9470 case 7:
9480 beep:pause 200:goto Input_Seireki2:
9490 end select
9500 endif
9510 '左３　ここまで
9520 '下の矢印
9530 '中央 2
9540 if ((y=1) or (key$ = chr$(31))) then
9550 select case No
9560 '9から６に下げる
9570 case 9:
9580 No=6:sp_on 12,0:sp_on 9,1:beep
9590 pause 200:goto Input_Seireki2:
9600 '6から３に下げる
9610 case 6:
9620 No=3:sp_on 9,0:sp_on 6,1:beep
9630 pause 200:goto Input_Seireki2:
9640 '3から０ｋに変える
9650 case 3:
9660 No=-1:sp_on 14,1:sp_on 6,0:beep
9670 pause 200:goto Input_Seireki2:
9680 'Okから下のボタンを押しても何もしない
9690 case -1:
9700 beep:pause 200:goto Input_Seireki2:
9710 case 8:
9720 No=5:sp_on 8,1:sp_on 11,0:beep
9730 pause 200:goto Input_Seireki2:
9740 case 5:
9750 No=2:sp_on 5,1:sp_on 8,0:beep
9760 pause 200:goto Input_Seireki2:
9770 case 2:
9780 No=0:sp_on 13,1:sp_on 5,0:beep
9790 pause 200:goto Input_Seireki2:
9800 case 0:
9810 beep:pause 200:goto Input_Seireki2:
9820 case 7:
9830 No=4:sp_on 7,1:sp_on 10,0:beep
9840 pause 200:goto Input_Seireki2:
9850 case 4:
9860 No=1:sp_on 4,1:sp_on 7,0:beep
9870 pause 200:goto Input_Seireki2:
9880 case 1:
9890 beep:pause 200:goto Input_Seireki2:
9900 end select
9910 endif
9920 '左へボタン 十字キー　左　or 　カーソル左
9930 if ((y2 = -1) or (key$ = chr$(29))) then
9940 select case No
9950 'Ok ボタン  Okから　左　０に行く
9960 case -1:
9970 No=0:sp_on 13,1:sp_on 14,0:beep
9980 pause 200:goto Input_Seireki2:
9990 '0 ボタン  左　何もしない
10000 case 0:
10010 beep:pause 200:goto Input_Seireki2:
10020 case 3:
10030 No=2:sp_on 5,1:sp_on 6,0:beep
10040 pause 200:goto Input_Seireki2:
10050 case 2:
10060 No=1:sp_on 5,0:sp_on 4,1:beep
10070 pause 200:goto Input_Seireki2:
10080 case 1:
10090 beep:pause 200:goto Input_Seireki2:
10100 case 6:
10110 No=5:sp_on 8,1:sp_on 9,0:beep
10120 pause 200:goto Input_Seireki2:
10130 case 5:
10140 No=4:sp_on 7,1:sp_on 8,0:beep
10150 pause 200:goto Input_Seireki2:
10160 case 4:
10170 beep:pause 200:goto Input_Seireki2:
10180 case 9:
10190 No=8:sp_on 11,1:sp_on 12,0:beep
10200 pause 200:goto Input_Seireki2:
10210 case 8:
10220 No=7:sp_on 10,1:sp_on 11,0:beep
10230 pause 200:goto Input_Seireki2:
10240 case 7:
10250 beep:pause 200:goto Input_Seireki2:
10260 end select
10270 endif
10280 '右  十字キー　右　or カーソル　右
10290 if ((y2 = 1) or (key$ = chr$(28))) then
10300 select case No
10310 '0ボタンからokボタン右に移動
10320 case 0:
10330 No=-1:sp_on 14,1:sp_on 13,0:beep
10340 pause 200:goto Input_Seireki2:
10350 '0ボタンからokボタン 右に移動　ここまで
10360 'OKボタンで右を押して何もしない
10370 case -1:
10380 pause 200:goto Input_Seireki2:
10390 case 1:
10400 No=2:sp_on 5,1:sp_on 4,0:beep
10410 pause 200:goto Input_Seireki2:
10420 case 2:
10430 No=3:sp_on 6,1:sp_on 5,0
10440 beep:pause 200:goto Input_Seireki2:
10450 case 3:
10460 beep:pause 200:goto Input_Seireki2:
10470 case 4:
10480 No=5:sp_on 8,1:sp_on 7,0:beep
10490 pause 200:goto Input_Seireki2:
10500 case 5:
10510 No=6:sp_on 9,1:sp_on 8,0:beep
10520 pause 200:goto Input_Seireki2:
10530 case 7:
10540 No=8:sp_on 11,1:sp_on 10,0:beep
10550 pause 200:goto Input_Seireki2:
10560 case 8:
10570 No=9:sp_on 12,1:sp_on 11,0:beep
10580 pause 200:goto Input_Seireki2:
10590 case 9:
10600 beep:pause 200:goto Input_Seireki2:
10610 case 6:
10620 beep:pause 200:goto Input_Seireki2:
10630 end select
10640 'Okから右ボタンを押して何もしない ここまで
10650 endif
10660 '十字キー　ここまで
10670 '*************************************************************************************************************************
10680 'WXGA　1280 x 800 ここまで
10690 '*************************************************************************************************************************
10700 else
10710 '************************************************************************************************
10720 '2.WUXGAの時1920x1280の時 ここから
10730 '************************************************************************************************
10740 '************************************************************************************************
10750 '1.十字キー上ここから
10760 '************************************************************************************************
10770 if ((y = -1) or (key$ = chr$(30))) then
10780 select case No
10790 'No=-1:okのとき:初期の状態
10800 '0kボタンから３に移動
10810 '上に行く 処理
10820 case -1:
10830 No=3:sp_on 12,1:sp_on 14,0:beep
10840 pause 200:goto Input_Seireki2:
10850 '選択肢:3
10860 '3ボタンから 6に移動
10870 case 3:
10880 No=6:sp_on 12,0:sp_on 11,1:beep
10890 pause 200:goto Input_Seireki2:
10900 '6ボタンから ９に移動
10910 case 6:
10920 No=9:sp_on 10,1:sp_on 11,0:beep
10930 pause 200:goto Input_Seireki2:
10940 '6ボタンから ９に移動　ここまで
10950 '9で上を押して何もしない
10960 case 9:
10970 '何もしない
10980 No=9
10990 beep:pause 200:goto Input_Seireki2:
11000 '9で上を押しても何もしない　ここまで
11010 '上　 0ボタンから2ボタン
11020 'sp_on 6,1:1
11030 'sp_on 8,1:5
11040 'sp_on 7,1:7
11050 case 0:
11060 No=2:sp_on 13,0:sp_on 9,1:beep
11070 pause 200:goto Input_Seireki2:
11080 '上  0ボタンから2ボタン　ここまで
11090 '2から５になる 上
11100 case 2:
11110 No=5:sp_on 8,1:sp_on 9,0:beep
11120 pause 200:goto Input_Seireki2:
11130 case 5:
11140 No=8:sp_on 7,1:sp_on 8,0:beep
11150 pause 200:goto Input_Seireki2:
11160 case 8:
11170 beep:pause 200:goto Input_Seireki2:
11180 case 1:
11190 No=4:sp_on 5,1:sp_on 6,0:beep
11200 pause 200:goto Input_Seireki2:
11210 case 4:
11220 No=7:sp_on 4,1:sp_on 5,0:beep
11230 pause 200:goto Input_Seireki2:
11240 case 7:
11250 beep:pause 200:goto Input_Seireki2:
11260 end select
11270 endif
11280 '************************************************************************************************
11290 '1. 十字キー　上　ここまで
11300 '************************************************************************************************
11310 '左３　ここまで
11320 '************************************************************************************************
11330 '1. 十字キー　下　矢印　下　ここから
11340 '************************************************************************************************
11350 '下の矢印
11360 '中央 2
11370 if ((y=1) or (key$ = chr$(31))) then
11380 select case No
11390 '9から６に下げる
11400 case 9:
11410 No=6:sp_on 11,1:sp_on 10,0:beep
11420 pause 200:goto Input_Seireki2:
11430 '6から３に下げる
11440 case 6:
11450 No=3:sp_on 12,1:sp_on 11,0:beep
11460 pause 200:goto Input_Seireki2:
11470 '3から０ｋに変える
11480 case 3:
11490 No=-1:sp_on 14,1:sp_on 12,0:beep
11500 pause 200:goto Input_Seireki2:
11510 'Okから下のボタンを押しても何もしない
11520 case -1:
11530 beep:pause 200:goto Input_Seireki2:
11540 case 8:
11550 No=5:sp_on 8,1:sp_on 7,0:beep
11560 pause 200:goto Input_Seireki2:
11570 case 5:
11580 No=2:sp_on 9,1:sp_on 8,0:beep
11590 pause 200:goto Input_Seireki2:
11600 case 2:
11610 No=0:sp_on 13,1:sp_on 9,0:beep
11620 pause 200:goto Input_Seireki2:
11630 case 0:
11640 pause 200:goto Input_Seireki2:
11650 case 7:
11660 No=4:sp_on 5,1:sp_on 4,0:beep
11670 pause 200:goto Input_Seireki2:
11680 case 4:
11690 No=1:sp_on 6,1:sp_on 5,0:beep
11700 pause 200:goto Input_Seireki2:
11710 case 1:
11720 beep:pause 200:goto Input_Seireki2:
11730 end select
11740 endif
11750 '************************************************************************************************
11760 '1. 十字キー　下　矢印　下　ここまで
11770 '************************************************************************************************
11780 '************************************************************************************************
11790 '1. 十字キー　左　矢印　左　ここから
11800 '************************************************************************************************
11810 '左へボタン 十字キー　左　or 　カーソル左
11820 if ((y2 = -1) or (key$ = chr$(29))) then
11830 select case No
11840 'Ok ボタン  Okから　左　０に行く
11850 case -1:
11860 No=0:sp_on 13,1:sp_on 14,0:beep
11870 pause 200:goto Input_Seireki2:
11880 '0 ボタン  左　何もしない
11890 case 0:
11900 beep:pause 200:goto Input_Seireki2:
11910 case 3:
11920 No=2:sp_on 9,1:sp_on 12,0:beep
11930 pause 200:goto Input_Seireki2:
11940 case 2:
11950 No=1:sp_on 6,1:sp_on 9,0:beep
11960 pause 200:goto Input_Seireki2:
11970 case 1:
11980 beep:pause 200:goto Input_Seireki2:
11990 case 6:
12000 No=5:sp_on 8,1:sp_on 11,0:beep
12010 pause 200:goto Input_Seireki2:
12020 case 5:
12030 No=4:sp_on 5,1:sp_on 8,0:beep
12040 pause 200:goto Input_Seireki2:
12050 case 4:
12060 beep:pause 200:goto Input_Seireki2:
12070 case 9:
12080 No=8:sp_on 7,1:sp_on 10,0:beep
12090 pause 200:goto Input_Seireki2:
12100 case 8:
12110 No=7:sp_on 4,1:sp_on 7,0:beep
12120 pause 200:goto Input_Seireki2:
12130 case 7:
12140 beep:pause 200:goto Input_Seireki2:
12150 end select
12160 endif
12170 '************************************************************************************************
12180 '1. 十字キー　左　矢印　左　ここまで
12190 '************************************************************************************************
12200 '************************************************************************************************
12210 '十字キー　右　ここから
12220 '***********************************************************************************************
12230 '右  十字キー　右　or カーソル　右
12240 if ((y2 = 1) or (key$ = chr$(28))) then
12250 select case No
12260 '0ボタンからokボタン右に移動
12270 case 0:
12280 No=-1:sp_on 14,1:sp_on 13,0:beep
12290 pause 200:goto Input_Seireki2:
12300 '0ボタンからokボタン 右に移動　ここまで
12310 'OKボタンで右を押して何もしない
12320 case -1:
12330 beep:pause 200:goto Input_Seireki2:
12340 case 1:
12350 No=2:sp_on 9,1:sp_on 6,0:beep
12360 pause 200:goto Input_Seireki2:
12370 case 2:
12380 No=3:sp_on 12,1:sp_on 9,0:beep
12390 pause 200:goto Input_Seireki2:
12400 case 3:
12410 beep:pause 200:goto Input_Seireki2:
12420 case 4:
12430 No=5:sp_on 8,1:sp_on 5,0:beep
12440 pause 200:goto Input_Seireki2:
12450 case 5:
12460 No=6:sp_on 11,1:sp_on 8,0:beep
12470 pause 200:goto Input_Seireki2:
12480 case 7:
12490 No=8:sp_on 7,1:sp_on 4,0:beep
12500 pause 200:goto Input_Seireki2:
12510 case 8:
12520 No=9:sp_on 10,1:sp_on 7,0:beep
12530 pause 200:goto Input_Seireki2:
12540 case 9:
12550 beep:pause 200:goto Input_Seireki2:
12560 case 6:
12570 beep:pause 200:goto Input_Seireki2:
12580 end select
12590 'Okから右ボタンを押して何もしない ここまで
12600 endif
12610 '**********************************************************************************************************
12620 '右　ここまで
12630 '**********************************************************************************************************
12640 endif
12650 '**********************************************************************************************************
12660 '2.WUXGAの時1920x1280の時 ここまで
12670 '**********************************************************************************************************
12680 if ((bg=2) or (key$=chr$(13))) then
12690 select case count
12700 case 0:
12710 count=1
12720 if (No=-1) then
12730 count=0
12740 'Okボタンを押したとき
12750 goto Input_Seireki2:
12760 else
12770 '===================================
12780 'Okボタン以外が押されたとき  1桁目の入力
12790 '===================================
12800 count2=1
12810 if (No >= 1 and No <= 2) then
12820 buf_year$="":buf_year$ = str$(No)
12830 buf_year=No:buf_year2$ = buf_year$ + string$(3,"*") :'"***"
12840 if ex_info$(1) <> "JP" then
12850 n1= len("Input Born Year?(4 dedgit):")
12860 else
12870 n1 = len("生まれた年代(西暦4桁):")
12880 endif
12890 locate 2,4
12900 color rgb(255,255,255)
12910 if ex_info$(1) <> "JP" then
12920 buf_Born_Year_line$ = trim$("Input Born Year?(4 dedgit):" + buf_year2$)
12930 else
12940 buf_Born_Year_line$ = trim$("生まれた年代(西暦4桁):" + buf_year2$)
12950 endif
12960 'buf_Born_Year_line$ = left$(buf_Born_year_5490 'buf_Born_Year_line$ = left$(buf_Born_year_name$,1)
12970 'print "生まれた年代(西暦4桁):";buf_year2$
12980 print buf_Born_Year_line$
12990 goto Input_Seireki2:
13000 else
13010 count=0
13020 ui_msg"数字が範囲外になります。"
13030 buf_year$="":buf_year=0
13040 goto Input_Seireki2:
13050 endif
13060 endif
13070 case 1:
13080 count = 2
13090 if (No = -1) then
13100 count = 1
13110 goto Input_Seireki2:
13120 else
13130 count2 = 1
13140 b = val(buf_year$)
13150 buf_year = b * 10 + No
13160 buf_year$ = str$(buf_year):buf_year2$ = buf_year$ + string$(2,"**")
13170 locate 2,4
13180 color rgb(255,255,255)
13190 print "                                                                "
13200 locate 2,4
13210 if ex_info$(1) <> "JP" then
13220 print "Input Born Year(4 dedgit):";buf_year$
13230 else
13240 print "生まれた年代(西暦4桁):";buf_year2$
13250 endif
13260 'if (No = -1) then
13270 'count=1
13280 goto Input_Seireki2:
13290 endif
13300 case 2:
13310 count=3
13320 if (No=-1) then
13330 count =2
13340 goto Input_Seireki2:
13350 else
13360 b = val(buf_year$)
13370 buf_year = b*10 + No
13380 buf_year$ = str$(buf_year):buf_year2$ = buf_year$ + string$(1,"*")
13390 locate 2,4
13400 color rgb(255,255,255)
13410 print "                                        "
13420 locate 2,4
13430 if ex_info$(1) <> "JP" then
13440 print "Input Born Year?(4 dedgit):";buf_year$
13450 else
13460 print "生まれた年代(西暦4桁):";buf_year2$
13470 endif
13480 goto Input_Seireki2:
13490 endif
13500 case 3:
13510 count=4
13520 if (No = -1) then
13530 count=3
13540 goto Input_Seireki2:
13550 else
13560 b = val(buf_year$)
13570 buf_year = b * 10 + No
13580 buf_year$ = str$(buf_year)
13590 locate 2,4
13600 color RGB(255,255,255)
13610 print "                                      "
13620 locate 2,4
13630 if ex_info$(1) <> "JP" then
13640 print "Input Born Year?(4 dedgit):";buf_year$
13650 else
13660 print "生まれた年代(西暦4桁):";buf_year$
13670 endif
13680 buf_year=val(buf_year$)
13690 'year=val(buf_year$)
13700 'if (No=-1) then
13710 'goto Input_Born_Month:
13720 'else
13730 goto Input_Seireki2:
13740 endif
13750 case 4:
13760 'bufyear=buf_year
13770 if (No = -1) then
13780 buf_year = val(buf_year$)
13790 bufyear = buf_year
13800 sp_on 14,0
13810 goto Input_Born_Month:
13820 else
13830 goto Input_Seireki2:
13840 endif
13850 end select
13860 endif
13870 '=========================
13880 'bg2　キャンセルボタン
13890 '=========================
13900 if (bg2 = 2) then
13910 select case count2
13920 case 0:
13930 'Okボタンを押したときの処理
13940 if (No = -1) then
13950 buf_year=0:buf_year$=(""):buf_year$=trim$("****")
13960 'count = 0
13970 locate 2,4
13980 color rgb(255,255,255)
13990 print "                                      "
14000 locate 2,4
14010 if ex_info$(1) <> "JP" then
14020 print "Input Born Year?(4 dedgit):";buf_year$
14030 else
14040 print "生まれた年代（西暦4桁):";buf_year$
14050 endif
14060 '=============================
14070 'case 0:前の画面に戻る 数秘術トップメニュー
14080 '=============================
14090 sp_on 14,0:goto Kabara_TopScreen:
14100 else
14110 'count=0
14120 '(buf_year=0) then
14130 buf_year = 0:buf_year$ = string$(4,"*")
14140 goto Input_Seireki2:
14150 'endif
14160 endif
14170 case 1:
14180 if (No = -1) then
14190 count2 = 0:count = 0
14200 buf$=right$(buf_year$,1)
14210 if (val(buf$) >= 1 and val(buf$) <= 9) then
14220 buf_year$ = "****":buf_year=0
14230 color rgb(255,255,255)
14240 locate 0,4:
14250 print "                                      "
14260 locate 2,4
14270 if ex_info$(1) <> "JP" then
14280 print "Input Born Year(4 dedgit):";buf_year$
14290 else
14300 print "生まれた年代（西暦4桁):" + buf_year$
14310 endif
14320 goto Input_Seireki2:
14330 endif
14340 else
14350 endif
14360 end select
14370 endif
14380 end
14390 'Input"生れた年代(4桁,〜2025年):",year
14400 'if year > 2025 then goto Input_Seireki:
14410 'if year = 123 then cls 3:cls 4:goto Main_Screen:
14420 '"4桁目"
14430 'bufyear4 = fix(year / 1000)
14440 '"3桁目"
14450 'bufyear3 = fix((year - (bufyear4 * 1000)) / 100)
14460 '"2桁目"
14470 'bufyear2 = fix((year - ((bufyear4 * 1000)+(bufyear3*100)))/10)
14480 '"1桁目"
14490 'bufyear1 = fix((year - ((bufyear4*
14500 'bufyear = bufyear1+bufyear2+bufyear3+bufyear4
14510 '生れた月を入力
14520 Input_Born_Month:
14530 cls 3:play "":count=0:count2=0
14540 'No=-1:Okのとき
14550 init"kb:4":key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_Month$ = "**":buf_month=0
14560 for i=0 to 1
14570 buf_month(i)=0
14580 next i
14590 '***********************************************************
14600 '1.WXGAの時 ここから
14610 '(1200 x 800)
14620 '***********************************************************
14630 if ((size(0) <= 1280) and (size(1) <= 800)) then
14640 gload Gazo$ + Gazo_WXGA$ +"Screen2_907x680_20240216.png",0,0,0
14650 '***********************************************************
14660 '1.WXGAの時　ここまで
14670 '(1200 x 800)
14680 '***********************************************************
14690 else
14700 '***********************************************************
14710 '2.WUXGAの時(WXGA以外の時)　ここから
14720 '(1920 gload Gazo$ + "Selection.png",1,60,240
14730 '***********************************************************
14740 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
14750 gload Gazo$ + "Screen2.png",0,0,0
14760 gload Gazo$ + "downscreen.png",0,0,800
14770 '***********************************************************
14780 '2.WUXGAの時(WXGA以外の時)　ここまで
14790 '(1920 gload Gazo$ + "Selection.png",1,60,240
14800 '***********************************************************
14810 endif
14820 'Init"kb:2"
14830 if ex_info$(1) <> "JP" then
14840 else
14850 '音声ファイル再生 2023.06.07
14860 play Voice$ + "Voice_Input_Born_Month_20230607.mp3"
14870 endif
14880 font FONT
14890 locate 0,1
14900 '文字色：黒　 color rgb(0,0,0)
14910 if ex_info$(1) <> "JP" then
14920 '英語パート
14930 '文字色:白
14940 color rgb(255,255,255)
14950 print "Input Born Month?(1~12):" + chr$(13)
14960 '文字色:白
14970 color rgb(255,255,255)
14980 locate 2,4
14990 '文字色:白
15000 print "Your Born Month?(1~12):";buf_Month$
15010 color rgb(255,255,255)
15020 else
15030 '日本語パート
15040 color rgb(255,255,255)
15050 print "生まれた月を入れて下さい" + chr$(13)
15060 '文字色:白
15070 color rgb(255,255,255)
15080 locate 2,4
15090 '文字色:白
15100 print "生まれた月(1月~12月):";buf_Month$
15110 color rgb(255,255,255)
15120 endif
15130 'locate 4,6:print ":7"
15140 'locate 9,6:print ":8"
15150 'locate 12,6:print ":9"
15160 'locate 4,6
15170 '文字色:赤
15180 'print ":7  :8  :9" + chr$(13)
15190 'color rgb(255,255,255)
15200 'locate 4,8
15210 'print ":4  :5  :6" + chr$(13)
15220 'color rgb(255,255,255)
15230 'locate 4,10
15240 'print ":1  :2  :3" + chr$(13)
15250 'locate 4,12
15260 'print "    :0"
15270 'locate 12,12
15280 'color rgb(255,0,0)
15290 'print ":Ok"
15300 sp_on 4,0: sp_on 5,0:sp_on 6,0
15310 sp_on 7,0:sp_on 8,0:sp_on 9,0
15320 sp_on 10,0:sp_on 11,0:sp_on 12,0
15330 sp_on 13,0:sp_on 14,1
15340 Input_Born_Month2:
15350 key$="":bg=0:y=0:y2=0:bg2=0
15360 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
15370 key$ = inkey$
15380 bg = strig(1)
15390 y = stick(1)
15400 y2 = stick(0)
15410 bg2 = strig(0)
15420 pause 200
15430 wend
15440 if ((size(0) <= 1280) and (size(1) <= 800)) then
15450 '***********************************************************
15460 '1.WXGAの時 ここから
15470 '(1200 x 800)
15480 '***********************************************************
15490 '十字キー　ここから
15500 '上の矢印　または、十字キー上
15510 if ((y = -1) or (key$ = chr$(30))) then
15520 select case No
15530 'No=-1:okのとき:初期の状態
15540 '0kボタンから３に移動
15550 '上に行く 処理
15560 case -1:
15570 No=3:sp_on 6,1:sp_on 14,0:beep
15580 pause 200:goto Input_Born_Month2:
15590 '選択肢:3
15600 '3ボタンから 6に移動
15610 case 3:
15620 No=6:sp_on 9,1:sp_on 6,0:beep
15630 pause 200:goto Input_Born_Month2:
15640 '6ボタンから ９に移動
15650 case 6:
15660 No=9:sp_on 12,1:sp_on 9,0:beep
15670 pause 200:goto Input_Born_Month2:
15680 '6ボタンから ９に移動　ここまで
15690 '9で上を押して何もしない
15700 case 9:
15710 '何もしない
15720 No=9
15730 beep:pause 200:goto Input_Born_Month2:
15740 '9で上を押しても何もしない　ここまで
15750 '上　 0ボタンから2ボタン
15760 'sp_on 6,1:1
15770 'sp_on 8,1:5
15780 'sp_on 7,1:7
15790 case 0:
15800 No=2:sp_on 13,0:sp_on 5,1:beep
15810 pause 200:goto Input_Born_Month2:
15820 '上  0ボタンから2ボタン　ここまで
15830 '2から５になる 上
15840 case 2:
15850 No=5:sp_on 8,1:sp_on 5,0:beep
15860 pause 200:goto Input_Born_Month2:
15870 case 5:
15880 No=8:sp_on 11,1:sp_on 8,0:beep
15890 pause 200:goto Input_Born_Month2:
15900 case 8:
15910 beep:pause 200:goto Input_Born_Month2:
15920 case 1:
15930 No=4:sp_on 7,1:sp_on 4,0:beep
15940 pause 200:goto Input_Born_Month2:
15950 case 4:
15960 No=7:sp_on 10,1:sp_on 7,0:beep
15970 pause 200:goto Input_Born_Month2:
15980 case 7:
15990 beep:pause 200:goto Input_Born_Month2:
16000 end select
16010 endif
16020 '左３　ここまで
16030 '下の矢印
16040 '中央 2
16050 if ((y=1) or (key$ = chr$(31))) then
16060 select case No
16070 '9から６に下げる
16080 case 9:
16090 No=6:sp_on 12,0:sp_on 9,1:beep
16100 pause 200:goto Input_Born_Month2:
16110 '6から３に下げる
16120 case 6:
16130 No=3:sp_on 9,0:sp_on 6,1:beep
16140 pause 200:goto Input_Born_Month2:
16150 '3から０ｋに変える
16160 case 3:
16170 No=-1:sp_on 14,1:sp_on 6,0:beep
16180 pause 200:goto Input_Born_Month2:
16190 'Okから下のボタンを押しても何もしない
16200 case -1:
16210 beep:pause 200:goto Input_Born_Month2:
16220 case 8:
16230 No=5:sp_on 8,1:sp_on 11,0:beep
16240 pause 200:goto Input_Born_Month2:
16250 case 5:
16260 No=2:sp_on 5,1:sp_on 8,0:beep
16270 pause 200:goto Input_Born_Month2:
16280 case 2:
16290 No=0:sp_on 13,1:sp_on 5,0:beep
16300 pause 200:goto Input_Born_Month2:
16310 case 0:
16320 beep:pause 200:goto Input_Born_Month2:
16330 case 7:
16340 No=4:sp_on 7,1:sp_on 10,0:beep
16350 pause 200:goto Input_Born_Month2:
16360 case 4:
16370 No=1:sp_on 4,1:sp_on 7,0:beep
16380 pause 200:goto Input_Born_Month2:
16390 case 1:
16400 beep:pause 200:goto Input_Born_Month2:
16410 end select
16420 endif
16430 '左へボタン 十字キー　左　or 　カーソル左
16440 if ((y2 = -1) or (key$ = chr$(29))) then
16450 select case No
16460 'Ok ボタン  Okから　左　０に行く
16470 case -1:
16480 No=0:sp_on 13,1:sp_on 14,0:beep
16490 pause 200:goto Input_Born_Month2:
16500 '0 ボタン  左　何もしない
16510 case 0:
16520 beep:pause 200:goto Input_Born_Month2:
16530 case 3:
16540 No=2:sp_on 5,1:sp_on 6,0:beep
16550 pause 200:goto Input_Born_Month2:
16560 case 2:
16570 No=1:sp_on 5,0:sp_on 4,1:beep
16580 pause 200:goto Input_Born_Month2:
16590 case 1:
16600 beep:pause 200:goto Input_Born_Month2:
16610 case 6:
16620 No=5:sp_on 8,1:sp_on 9,0:beep
16630 pause 200:goto Input_Born_Month2:
16640 case 5:
16650 No=4:sp_on 7,1:sp_on 8,0:beep
16660 pause 200:goto Input_Born_Month2:
16670 case 4:
16680 beep:pause 200:goto Input_Born_Month2:
16690 case 9:
16700 No=8:sp_on 11,1:sp_on 12,0:beep
16710 pause 200:goto Input_Born_Month2:
16720 case 8:
16730 No=7:sp_on 10,1:sp_on 11,0:beep
16740 pause 200:goto Input_Born_Month2:
16750 case 7:
16760 beep:pause 200:goto Input_Born_Month2:
16770 end select
16780 endif
16790 '右  十字キー　右　or カーソル　右
16800 if ((y2 = 1) or (key$ = chr$(28))) then
16810 select case No
16820 '0ボタンからokボタン右に移動
16830 case 0:
16840 No=-1:sp_on 14,1:sp_on 13,0:beep
16850 pause 200:goto Input_Born_Month2:
16860 '0ボタンからokボタン 右に移動　ここまで
16870 'OKボタンで右を押して何もしない
16880 case -1:
16890 pause 200:goto Input_Born_Month2:
16900 case 1:
16910 No=2:sp_on 5,1:sp_on 4,0:beep
16920 pause 200:goto Input_Born_Month2:
16930 case 2:
16940 No=3:sp_on 6,1:sp_on 5,0
16950 beep:pause 200:goto Input_Born_Month2:
16960 case 3:
16970 beep:pause 200:goto Input_Born_Month2:
16980 case 4:
16990 No=5:sp_on 8,1:sp_on 7,0:beep
17000 pause 200:goto Input_Born_Month2:
17010 case 5:
17020 No=6:sp_on 9,1:sp_on 8,0:beep
17030 pause 200:goto Input_Born_Month2:
17040 case 7:
17050 No=8:sp_on 11,1:sp_on 10,0:beep
17060 pause 200:goto Input_Born_Month2:
17070 case 8:
17080 No=9:sp_on 12,1:sp_on 11,0:beep
17090 pause 200:goto Input_Born_Month2:
17100 case 9:
17110 beep:pause 200:goto Input_Born_Month2:
17120 case 6:
17130 beep:pause 200:goto Input_Born_Month2:
17140 end select
17150 'Okから右ボタンを押して何もしない ここまで
17160 endif
17170 '***********************************************************
17180 '1.WXGAの時 ここまで
17190 '(1200 x 800)
17200 '***********************************************************
17210 else
17220 '***********************************************************
17230 '2.WUXGAの時(WXGA以外の時)　ここから
17240 '(1920 gload Gazo$ + "Selection.png",1,60,240
17250 '***********************************************************
17260 '十字キー　ここから
17270 '上の矢印　または、十字キー上
17280 if ((y = -1) or (key$ = chr$(30))) then
17290 select case No
17300 'No=-1:okのとき:初期の状態
17310 '0kボタンから３に移動
17320 '上に行く 処理
17330 case -1:
17340 No=3:sp_on 12,1:sp_on 14,0:BEEP
17350 pause 200:goto Input_Born_Month2:
17360 '選択肢:3
17370 '3ボタンから 6に移動
17380 case 3:
17390 No=6:sp_on 12,0:sp_on 11,1:beep
17400 pause 200:goto Input_Born_Month2:
17410 '6ボタンから ９に移動
17420 case 6:
17430 No=9:sp_on 10,1:sp_on 11,0:beep
17440 pause 200:goto Input_Born_Month2:
17450 '6ボタンから ９に移動　ここまで
17460 '9で上を押して何もしない
17470 case 9:
17480 '何もしない
17490 No=9
17500 beep:pause 200:goto Input_Born_Month2:
17510 '9で上を押しても何もしない　ここまで
17520 '上　 0ボタンから2ボタン
17530 'sp_on 6,1:1
17540 'sp_on 8,1:5
17550 'sp_on 7,1:7
17560 case 0:
17570 No=2:sp_on 13,0:sp_on 9,1:beep
17580 pause 200:goto Input_Born_Month2:
17590 '上  0ボタンから2ボタン　ここまで
17600 '2から５になる 上
17610 case 2:
17620 No=5:sp_on 8,1:sp_on 9,0:beep
17630 pause 200:goto Input_Born_Month2:
17640 case 5:
17650 No=8:sp_on 7,1:sp_on 8,0:beep
17660 pause 200:goto Input_Born_Month2:
17670 case 8:
17680 beep:pause 200:goto Input_Born_Month2:
17690 case 1:
17700 No=4:sp_on 5,1:sp_on 6,0:beep
17710 pause 200:goto Input_Born_Month2:
17720 case 4:
17730 No=7:sp_on 4,1:sp_on 5,0:beep
17740 pause 200:goto Input_Born_Month2:
17750 case 7:
17760 beep:pause 200:goto Input_Born_Month2:
17770 end select
17780 endif
17790 '左３　ここまで
17800 '下の矢印
17810 '中央 2
17820 if ((y=1) or (key$ = chr$(31))) then
17830 select case No
17840 '9から６に下げる
17850 case 9:
17860 No=6:sp_on 11,1:sp_on 10,0:beep
17870 pause 200:goto Input_Born_Month2:
17880 '6から３に下げる
17890 case 6:
17900 No=3:sp_on 12,1:sp_on 11,0:beep
17910 pause 200:goto Input_Born_Month2:
17920 '3から０ｋに変える
17930 case 3:
17940 No=-1:sp_on 14,1:sp_on 12,0:beep
17950 pause 200:goto Input_Born_Month2:
17960 'Okから下のボタンを押しても何もしない
17970 case -1:
17980 beep:pause 200:goto Input_Born_Month2:
17990 case 8:
18000 No=5:sp_on 8,1:sp_on 7,0:beep
18010 pause 200:goto Input_Born_Month2:
18020 case 5:
18030 No=2:sp_on 9,1:sp_on 8,0:beep
18040 pause 200:goto Input_Born_Month2:
18050 case 2:
18060 No=0:sp_on 13,1:sp_on 9,0:beep
18070 pause 200:goto Input_Born_Month2:
18080 case 0:
18090 beep:pause 200:goto Input_Born_Month2:
18100 case 7:
18110 No=4:sp_on 5,1:sp_on 4,0:beep
18120 pause 200:goto Input_Born_Month2:
18130 case 4:
18140 No=1:sp_on 6,1:sp_on 5,0:beep
18150 pause 200:goto Input_Born_Month2:
18160 case 1:
18170 beep:pause 200:goto Input_Born_Month2:
18180 end select
18190 endif
18200 '左へボタン 十字キー　左　or 　カーソル左
18210 if ((y2 = -1) or (key$ = chr$(29))) then
18220 select case No
18230 'Ok ボタン  Okから　左　０に行く
18240 case -1:
18250 No=0:sp_on 13,1:sp_on 14,0
18260 beep:pause 200:goto Input_Born_Month2:
18270 '0 ボタン  左　何もしない
18280 case 0:
18290 beep:pause 200:goto Input_Born_Month2:
18300 case 3:
18310 No=2:sp_on 9,1:sp_on 12,0:beep
18320 pause 200:goto Input_Born_Month2:
18330 case 2:
18340 No=1:sp_on 6,1:sp_on 9,0:beep
18350 pause 200:goto Input_Born_Month2:
18360 case 1:
18370 beep:pause 200:goto Input_Born_Month2:
18380 case 6:
18390 No=5:sp_on 8,1:sp_on 11,0:beep
18400 pause 200:goto Input_Born_Month2:
18410 case 5:
18420 No=4:sp_on 5,1:sp_on 8,0:beep
18430 pause 200:goto Input_Born_Month2:
18440 case 4:
18450 beep:pause 200:goto Input_Born_Month2:
18460 case 9:
18470 No=8:sp_on 7,1:sp_on 10,0:beep
18480 pause 200:goto Input_Born_Month2:
18490 case 8:
18500 No=7:sp_on 4,1:sp_on 7,0:beep
18510 pause 200:goto Input_Born_Month2:
18520 case 7:
18530 beep:pause 200:goto Input_Born_Month2:
18540 end select
18550 endif
18560 '右  十字キー　右　or カーソル　右
18570 if ((y2 = 1) or (key$ = chr$(28))) then
18580 select case No
18590 '0ボタンからokボタン右に移動
18600 case 0:
18610 No=-1:sp_on 14,1:sp_on 13,0:beep
18620 pause 200:goto Input_Born_Month2:
18630 '0ボタンからokボタン 右に移動　ここまで
18640 'OKボタンで右を押して何もしない
18650 case -1:
18660 beep:pause 200:goto Input_Born_Month2:
18670 case 1:
18680 No=2:sp_on 9,1:sp_on 6,0:beep
18690 pause 200:goto Input_Born_Month2:
18700 case 2:
18710 No=3:sp_on 12,1:sp_on 9,0:beep
18720 pause 200:goto Input_Born_Month2:
18730 case 3:
18740 beep:pause 200:goto Input_Born_Month2:
18750 case 4:
18760 No=5:sp_on 8,1:sp_on 10,0:beep
18770 pause 200:goto Input_Born_Month2:
18780 case 5:
18790 No=6:sp_on 11,1:sp_on 8,0:beep
18800 pause 200:goto Input_Born_Month2:
18810 case 7:
18820 No=8:sp_on 7,1:sp_on 11,0:beep
18830 pause 200:goto Input_Born_Month2:
18840 case 8:
18850 No=9:sp_on 12,1:sp_on 7,0:beep
18860 pause 200:goto Input_Born_Month2:
18870 case 9:
18880 beep:pause 200:goto Input_Born_Month2:
18890 case 6:
18900 beep:pause 200:goto Input_Born_Month2:
18910 end select
18920 'Okから右ボタンを押して何もしない ここまで
18930 endif
18940 '***********************************************************
18950 '2.WUXGAの時(WXGA以外の時)　ここまで
18960 '(1920 gload Gazo$ + "Selection.png",1,60,240
18970 '***********************************************************
18980 endif
18990 '***********************************************************
19000 '2.WUXGAの時(WXGA以外の時)　ここまで
19010 '(1920 gload Gazo$ + "Selection.png",1,60,240
19020 '***********************************************************
19030 '十字キー　ここまで
19040 '右の丸ボタン　決定キー
19050 if ((bg=2) or (key$=chr$(13))) then
19060 select case count
19070 case 0:
19080 count = 1:buf_Month$ = str$(No):buf_month = No:buf_Month2$ = buf_Month$ + string$(1,"*"):count2=1
19090 if (buf_month = 1 or buf_month = 2) then
19100 locate 2,4
19110 color RGB(255,255,255)
19120 if ex_info$(1) <> "JP" then
19130 print "Input Born Month(1~12):";buf_Month2$
19140 else
19150 print "生まれた月(1月~12月):";buf_Month2$
19160 endif
19170 else
19180 locate 2,4
19190 color Rgb(255,255,255)
19200 if ex_info$(1) <> "JP" then
19210 print "Input Born Month(1~12):";buf_Month$
19220 else
19230 print "生まれた月(1月~12月):";buf_Month$
19240 endif
19250 endif
19260 goto Input_Born_Month2:
19270 case 1:
19280 count = 2:c = No
19290 c = val(buf_Month$)
19300 if (No = -1) then
19310 'if No=1 or No=2 then
19320 'endif
19330 month = buf_month
19340 buf_month=val(buf_Month$)
19350 month=buf_month
19360 '生まれた日に飛ぶ
19370 goto Input_Born_Day:
19380 else
19390 buf_month = c*10 + No
19400 buf_Month$= str$(buf_month)
19410 locate 2,4
19420 color Rgb(255,255,255)
19430 if ex_info$(1) <> "JP" then
19440 print "Input Born Month(1~12):";buf_Month$
19450 else
19460 print "生まれた月(1月~12月):";buf_Month$
19470 endif
19480 goto Input_Born_Month2:
19490 endif
19500 case 2:
19510 count=3:count2=1
19520 'c= val(buf_Month$)
19530 'buf_month = c*10 + No
19540 'buf_Month$ = str$(buf_month)
19550 'locate 2,3
19560 'print "生まれた月(1月～12月):";buf_Month$
19570 'goto Input_Born_Month2:
19580 'case 3:
19590 'count=4
19600 'b=val(buf_month$)
19610 'buf_month=c*10+No
19620 'buf_Month$=str$(buf_month)
19630 'locate 2,3
19640 'print "生まれた月(1月～12月):";buf_Month$
19650 'buf_month=val(buf_Month$)
19660 'year=val(buf_year$)
19670 if (No = -1) then
19680 goto Input_Born_Day:
19690 else
19700 goto Input_Born_Month2:
19710 endif
19720 'case 4:
19730 'bufyear=buf_year
19740 'if (No=-1) then
19750 'buf_month = val(buf_Month$)
19760 'month = buf_month
19770 'sp_on 14,0
19780 'goto Input_Born_Day:
19790 'else
19800 'goto Input_Born_Month2:
19810 'endif
19820 end select
19830 endif
19840 '左の丸ボタン　キャンセル
19850 if (bg2=2) then
19860 select case count2
19870 case 0:
19880 if (No = -1) then
19890 buf_month=0:buf_Month$="**"
19900 count2=0:count=0
19910 locate 0,3:print "                                   "
19920 if ex_info$(1) <> "JP" then
19930 print "Input Born Month?(1~12):";buf_Month$
19940 else
19950 locate 2,3:print "生まれた月(1月~12月):"+buf_Month$
19960 endif
19970 'if (buf_month > 1) then
19980 sp_on 14,0:goto Input_Born_Month2:
19990 'goto rewrite:
20000 else
20010 if ((No>=1 and No<=9) or (No>=10 and No <=12)) then
20020 buf_month=0:buf_Month$="**"
20030 locate 2,3
20040 color rgb(255,255,255)
20050 print "                                       "
20060 goto rewrite:
20070 if (No>2) then
20080 if ex_info$(1) <> "JP" then
20090 ui_msg "The value is out of range"
20100 else
20110 ui_msg "値が範囲外です。"
20120 endif
20130 goto rewrite:
20140 endif
20150 endif
20160 'endif
20170 rewrite:
20180 locate 2,4
20190 color rgb(255,255,255)
20200 print "                                      "
20210 locate 2,4
20220 if ex_info$(1) <> "JP" then
20230 print "Input Born Month?(1~12):";buf_Month$
20240 else
20250 print "生まれた月(1月~12月):";buf_Month$
20260 endif
20270 goto Input_Born_Month2:
20280 endif
20290 case 1:
20300 buf_Month$="**":buf_month=0
20310 if No=-1 then
20320 count2=2:count=0
20330 locate 0,4
20340 print "                                      "
20350 locate 2,4:
20360 if ex_info$(1) <> "JP" then
20370 print "Input Born Month?(1~12):";buf_Month$
20380 else
20390 print "生まれた月(1月~12月):" + buf_Month$
20400 endif
20410 goto Input_Born_Month2:
20420 endif
20430 case 2:
20440 sp_on 14,0:goto Input_Seireki:
20450 end select
20460 endif
20470 'endif
20480 end
20490 'end
20500 '生れた日を入力
20510 Input_Born_Day:
20520 '生まれた日入力
20530 cls 3:play ""
20540 'No=-1:Okのとき
20550 init"kb:4":key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_Day$ = "**":count=0:bg2=0:count2=0
20560 for i=0 to 1
20570 buf_day(i)=0
20580 next i
20590 '***********************************************************
20600 '1.WXGAの時 ここから
20610 '(1200 x 800)
20620 '***********************************************************
20630 if ((size(0) <= 1280) and (size(1) <= 800)) then
20640 gload Gazo$ + Gazo_WXGA$ + "Screen2_907x680_20240216.png",0,0,0
20650 '***********************************************************
20660 '1.WXGAの時　ここまで
20670 '(1200 x 800)
20680 '***********************************************************
20690 else
20700 '***********************************************************
20710 '2.WUXGAの時(WXGA以外の時)　ここから
20720 '(1920 gload Gazo$ + "Selection.png",1,60,240
20730 '***********************************************************
20740 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
20750 gload Gazo$ + "Screen2.png",0,0,0
20760 gload Gazo$ + "downscreen.png",0,0,800
20770 '***********************************************************
20780 '2.WUXGAの時(WXGA以外の時)　ここまで
20790 '(1920 gload Gazo$ + "Selection.png",1,60,240
20800 '***********************************************************
20810 endif
20820 'Init"kb:2"
20830 if ex_info$(1) <> "JP" then
20840 '英語音声パート
20850 else
20860 '日本語音声パート
20870 '音声ファイル再生 2023.06.07
20880 play Voice$ + "Voice_Input_Born_Day_20230607.mp3"
20890 endif
20900 font FONT
20910 if ex_info$(1) <> "JP" then
20920 locate 0,1
20930 '文字色：黒　 color rgb(0,0,0)
20940 color rgb(255,255,255)
20950 print "Input Born day?" + chr$(13)
20960 color rgb(255,255,255)
20970 locate 2,4
20980 print "Born Day(1~31):";buf_Day$
20990 else
21000 locate 0,1
21010 '文字色：黒　 color rgb(0,0,0)
21020 color rgb(255,255,255)
21030 print "生まれた日を入れて下さい" + chr$(13)
21040 color rgb(255,255,255)
21050 locate 2,4
21060 print "生まれた日(1日~31日):";buf_Day$
21070 endif
21080 'color rgb(255,255,255)
21090 'locate 4,6:print ":7"
21100 'locate 9,6:print ":8"
21110 'locate 12,6:print ":9"
21120 'locate 4,6
21130 'print ":7  :8  :9" + chr$(13)
21140 '=======================
21150 'テンキー　色　白　決定ボタン　青
21160 '=======================
21170 'color rgb(255,255,255)
21180 'locate 4,8
21190 'print ":4  :5  :6" + chr$(13)
21200 'color rgb(255,255,255)
21210 'locate 4,10
21220 'print ":1  :2  :3" + chr$(13)
21230 'locate 4,12
21240 'print "    :0"
21250 'locate 12,12
21260 'color rgb(255,0,0)
21270 'print ":Ok"
21280 sp_on 4,0: sp_on 5,0:sp_on 6,0
21290 sp_on 7,0:sp_on 8,0:sp_on 9,0
21300 sp_on 10,0:sp_on 11,0:sp_on 12,0
21310 sp_on 13,0:sp_on 14,1
21320 Input_Born_Day2:
21330 key$="":bg=0:y=0:y2=0:bg2=0
21340 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
21350 key$ = inkey$
21360 bg = strig(1)
21370 y = stick(1)
21380 y2 = stick(0)
21390 bg2 = strig(0)
21400 pause 200
21410 wend
21420 if ((size(0) <= 1280) and (size(1) <= 800)) then
21430 '十字キー　ここから
21440 '上の矢印　または、十字キー上
21450 if ((y = -1) or (key$ = chr$(30))) then
21460 select case No
21470 'No=-1:okのとき:初期の状態
21480 '0kボタンから３に移動
21490 '上に行く 処理
21500 case -1:
21510 No=3:sp_on 6,1:sp_on 14,0:beep
21520 pause 200:goto Input_Born_Day2:
21530 '選択肢:3
21540 '3ボタンから 6に移動
21550 case 3:
21560 No=6:sp_on 9,1:sp_on 6,0:beep
21570 pause 200:goto Input_Born_Day2:
21580 '6ボタンから ９に移動
21590 case 6:
21600 No=9:sp_on 12,1:sp_on 9,0:beep
21610 pause 200:goto Input_Born_Day2:
21620 '6ボタンから ９に移動　ここまで
21630 '9で上を押して何もしない
21640 case 9:
21650 '何もしない
21660 No=9
21670 beep:pause 200:goto Input_Born_Day2:
21680 '9で上を押しても何もしない　ここまで
21690 '上　 0ボタンから2ボタン
21700 'sp_on 6,1:1
21710 'sp_on 8,1:5
21720 'sp_on 7,1:7
21730 case 0:
21740 No=2:sp_on 13,0:sp_on 5,1:beep
21750 pause 200:goto Input_Born_Day2:
21760 '上  0ボタンから2ボタン　ここまで
21770 '2から５になる 上
21780 case 2:
21790 No=5:sp_on 8,1:sp_on 5,0:beep
21800 pause 200:goto Input_Born_Day2:
21810 case 5:
21820 No=8:sp_on 11,1:sp_on 8,0:beep
21830 pause 200:goto Input_Born_Day2:
21840 case 8:
21850 beep:pause 200:goto Input_Born_Day2:
21860 case 1:
21870 No=4:sp_on 7,1:sp_on 4,0:beep
21880 pause 200:goto Input_Born_Day2:
21890 case 4:
21900 No=7:sp_on 10,1:sp_on 7,0:beep
21910 pause 200:goto Input_Born_Day2:
21920 case 7:
21930 beep:pause 200:goto Input_Born_Day2:
21940 end select
21950 endif
21960 '左３　ここまで
21970 '下の矢印
21980 '中央 2
21990 if ((y=1) or (key$ = chr$(31))) then
22000 select case No
22010 '9から６に下げる
22020 case 9:
22030 No=6:sp_on 12,0:sp_on 9,1:beep
22040 pause 200:goto Input_Born_Day2:
22050 '6から３に下げる
22060 case 6:
22070 No=3:sp_on 9,0:sp_on 6,1:beep
22080 pause 200:goto Input_Born_Day2:
22090 '3から０ｋに変える
22100 case 3:
22110 No=-1:sp_on 14,1:sp_on 6,0:beep
22120 pause 200:goto Input_Born_Day2:
22130 'Okから下のボタンを押しても何もしない
22140 case -1:
22150 beep:pause 200:goto Input_Born_Day2:
22160 case 8:
22170 No=5:sp_on 8,1:sp_on 11,0:beep
22180 pause 200:goto Input_Born_Day2:
22190 case 5:
22200 No=2:sp_on 5,1:sp_on 8,0:beep
22210 pause 200:goto Input_Born_Day2:
22220 case 2:
22230 No=0:sp_on 13,1:sp_on 5,0:beep
22240 pause 200:goto Input_Born_Day2:
22250 case 0:
22260 beep:pause 200:goto Input_Born_Day2:
22270 case 7:
22280 No=4:sp_on 7,1:sp_on 10,0:beep
22290 pause 200:goto Input_Born_Day2:
22300 case 4:
22310 No=1:sp_on 4,1:sp_on 7,0:beep
22320 pause 200:goto Input_Born_Day2:
22330 case 1:
22340 beep:pause 200:goto Input_Born_Day2:
22350 end select
22360 endif
22370 '左へボタン 十字キー　左　or 　カーソル左
22380 if ((y2 = -1) or (key$ = chr$(29))) then
22390 select case No
22400 'Ok ボタン  Okから　左　０に行く
22410 case -1:
22420 No=0:sp_on 13,1:sp_on 14,0:beep
22430 pause 200:goto Input_Born_Day2:
22440 '0 ボタン  左　何もしない
22450 case 0:
22460 beep:pause 200:goto Input_Born_Day2:
22470 case 3:
22480 No=2:sp_on 5,1:sp_on 6,0:beep
22490 pause 200:goto Input_Born_Day2:
22500 case 2:
22510 No=1:sp_on 5,0:sp_on 4,1:beep
22520 pause 200:goto Input_Born_Day2:
22530 case 1:
22540 beep:pause 200:goto Input_Born_Day2:
22550 case 6:
22560 No=5:sp_on 8,1:sp_on 9,0:beep
22570 pause 200:goto Input_Born_Day2:
22580 case 5:
22590 No=4:sp_on 7,1:sp_on 8,0:beep
22600 pause 200:goto Input_Born_Day2:
22610 case 4:
22620 beep:pause 200:goto Input_Born_Day2:
22630 case 9:
22640 No=8:sp_on 11,1:sp_on 12,0:beep
22650 pause 200:goto Input_Born_Day2:
22660 case 8:
22670 No=7:sp_on 10,1:sp_on 11,0:beep
22680 pause 200:goto Input_Born_Day2:
22690 case 7:
22700 beep:pause 200:goto Input_Born_Day2:
22710 end select
22720 endif
22730 '右  十字キー　右　or カーソル　右
22740 if ((y2 = 1) or (key$ = chr$(28))) then
22750 select case No
22760 '0ボタンからokボタン右に移動
22770 case 0:
22780 No=-1:sp_on 14,1:sp_on 13,0:beep
22790 pause 200:goto Input_Born_Day2:
22800 '0ボタンからokボタン 右に移動　ここまで
22810 'OKボタンで右を押して何もしない
22820 case -1:
22830 pause 200:goto Input_Born_Day2:
22840 case 1:
22850 No=2:sp_on 5,1:sp_on 4,0:beep
22860 pause 200:goto Input_Born_Day2:
22870 case 2:
22880 No=3:sp_on 6,1:sp_on 5,0
22890 beep:pause 200:goto Input_Born_Day2:
22900 case 3:
22910 beep:pause 200:goto Input_Born_Day2:
22920 case 4:
22930 No=5:sp_on 8,1:sp_on 7,0:beep
22940 pause 200:goto Input_Born_Day2:
22950 case 5:
22960 No=6:sp_on 9,1:sp_on 8,0:beep
22970 pause 200:goto Input_Born_Day2:
22980 case 7:
22990 No=8:sp_on 11,1:sp_on 10,0:beep
23000 pause 200:goto Input_Born_Day2:
23010 case 8:
23020 No=9:sp_on 12,1:sp_on 11,0:beep
23030 pause 200:goto Input_Born_Day2:
23040 case 9:
23050 beep:pause 200:goto Input_Born_Day2:
23060 case 6:
23070 beep:pause 200:goto Input_Born_Day2:
23080 end select
23090 'Okから右ボタンを押して何もしない ここまで
23100 endif
23110 else
23120 '***********************************************************
23130 '2.WUXGAの時(WXGA以外の時)　ここから
23140 '(1920 gload Gazo$ + "Selection.png",1,60,240
23150 '***********************************************************
23160 '十字キー　ここから
23170 '上の矢印　または、十字キー上
23180 if ((y = -1) or (key$ = chr$(30))) then
23190 select case No
23200 'No=-1:okのとき:初期の状態
23210 '0kボタンから３に移動
23220 '上に行く 処理
23230 case -1:
23240 No=3:sp_on 12,1:sp_on 14,0:beep
23250 pause 200:goto Input_Born_Day2:
23260 '選択肢:3
23270 '3ボタンから 6に移動
23280 case 3:
23290 No=6:sp_on 12,0:sp_on 11,1:beep
23300 pause 200:goto Input_Born_Day2:
23310 '6ボタンから ９に移動
23320 case 6:
23330 No=9:sp_on 10,1:sp_on 11,0:beep
23340 pause 200:goto Input_Born_Day2:
23350 '6ボタンから ９に移動　ここまで
23360 '9で上を押して何もしない
23370 case 9:
23380 '何もしない
23390 No=9
23400 beep:pause 200:goto Input_Born_Day2:
23410 '9で上を押しても何もしない　ここまで
23420 '上　 0ボタンから2ボタン
23430 'sp_on 6,1:1
23440 'sp_on 8,1:5
23450 'sp_on 7,1:7
23460 case 0:
23470 No=2:sp_on 13,0:sp_on 9,1:beep
23480 pause 200:goto Input_Born_Day2:
23490 '上  0ボタンから2ボタン　ここまで
23500 '2から５になる 上
23510 case 2:
23520 No=5:sp_on 8,1:sp_on 9,0:beep
23530 pause 200:goto Input_Born_Day2:
23540 case 5:
23550 No=8:sp_on 7,1:sp_on 8,0:beep
23560 pause 200:goto Input_Born_Day2:
23570 case 8:
23580 beep:pause 200:goto Input_Born_Day2:
23590 case 1:
23600 No=4:sp_on 5,1:sp_on 6,0:beep
23610 pause 200:goto Input_Born_Day2:
23620 case 4:
23630 No=7:sp_on 4,1:sp_on 5,0:beep
23640 pause 200:goto Input_Born_Day2:
23650 case 7:
23660 beep:pause 200:goto Input_Born_Day2:
23670 end select
23680 endif
23690 '左３　ここまで
23700 '下の矢印
23710 '中央 2
23720 if ((y=1) or (key$ = chr$(31))) then
23730 select case No
23740 '9から６に下げる
23750 case 9:
23760 No=6:sp_on 11,1:sp_on 10,0:beep
23770 pause 200:goto Input_Born_Day2:
23780 '6から３に下げる
23790 case 6:
23800 No=3:sp_on 12,1:sp_on 11,0:beep
23810 pause 200:goto Input_Born_Day2:
23820 '3から０ｋに変える
23830 case 3:
23840 No=-1:sp_on 14,1:sp_on 12,0:beep
23850 pause 200:goto Input_Born_Day2:
23860 'Okから下のボタンを押しても何もしない
23870 case -1:
23880 beep:pause 200:goto Input_Born_Day2:
23890 case 8:
23900 No=5:sp_on 8,1:sp_on 7,0:beep
23910 pause 200:goto Input_Born_Day2:
23920 case 5:
23930 No=2:sp_on 9,1:sp_on 8,0:beep
23940 pause 200:goto Input_Born_Day2:
23950 case 2:
23960 No=0:sp_on 13,1:sp_on 9,0:beep
23970 pause 200:goto Input_Born_Day2:
23980 case 0:
23990 beep:pause 200:goto Input_Born_Day2:
24000 case 7:
24010 No=4:sp_on 5,1:sp_on 4,0:beep
24020 pause 200:goto Input_Born_Day2:
24030 case 4:
24040 No=1:sp_on 6,1:sp_on 5,0:beep
24050 pause 200:goto Input_Born_Day2:
24060 case 1:
24070 beep:pause 200:goto Input_Born_Day2:
24080 end select
24090 endif
24100 '左へボタン 十字キー　左　or 　カーソル左
24110 if ((y2 = -1) or (key$ = chr$(29))) then
24120 select case No
24130 'Ok ボタン  Okから　左　０に行く
24140 case -1:
24150 No=0:sp_on 13,1:sp_on 14,0:beep
24160 pause 200:goto Input_Born_Day2:
24170 '0 ボタン  左　何もしない
24180 case 0:
24190 beep:pause 200:goto Input_Born_Day2:
24200 case 3:
24210 No=2:sp_on 9,1:sp_on 12,0:beep
24220 pause 200:goto Input_Born_Day2:
24230 case 2:
24240 No=1:sp_on 6,1:sp_on 9,0:beep
24250 pause 200:goto Input_Born_Day2:
24260 case 1:
24270 pause 200:goto Input_Born_Day2:
24280 case 6:
24290 No=5:sp_on 8,1:sp_on 11,0:beep
24300 pause 200:goto Input_Born_Day2:
24310 case 5:
24320 No=4:sp_on 5,1:sp_on 8,0:beep
24330 pause 200:goto Input_Born_Day2:
24340 case 4:
24350 beep:pause 200:goto Input_Born_Day2:
24360 case 9:
24370 No=8:sp_on 7,1:sp_on 10,0:beep
24380 pause 200:goto Input_Born_Day2:
24390 case 8:
24400 No=7:sp_on 4,1:sp_on 7,0:beep
24410 pause 200:goto Input_Born_Day2:
24420 case 7:
24430 beep:pause 200:goto Input_Born_Day2:
24440 end select
24450 endif
24460 '右  十字キー　右　or カーソル　右
24470 if ((y2 = 1) or (key$ = chr$(28))) then
24480 select case No
24490 '0ボタンからokボタン右に移動
24500 case 0:
24510 No=-1:sp_on 14,1:sp_on 13,0:beep
24520 pause 200:goto Input_Born_Day2:
24530 '0ボタンからokボタン 右に移動　ここまで
24540 'OKボタンで右を押して何もしない
24550 case -1:
24560 beep:pause 200:goto Input_Born_Day2:
24570 case 1:
24580 No=2:sp_on 9,1:sp_on 6,0:beep
24590 pause 200:goto Input_Born_Day2:
24600 case 2:
24610 No=3:sp_on 12,1:sp_on 9,0:beep
24620 pause 200:goto Input_Born_Day2:
24630 case 3:
24640 beep:pause 200:goto Input_Born_Day2:
24650 case 4:
24660 No=5:sp_on 8,1:sp_on 5,0:beep
24670 pause 200:goto Input_Born_Day2:
24680 case 5:
24690 No=6:sp_on 11,1:sp_on 8,0:beep
24700 pause 200:goto Input_Born_Day2:
24710 case 7:
24720 No=8:sp_on 7,1:sp_on 4,0:beep
24730 pause 200:goto Input_Born_Day2:
24740 case 8:
24750 No=9:sp_on 10,1:sp_on 7,0:beep
24760 pause 200:goto Input_Born_Day2:
24770 case 9:
24780 beep:pause 200:goto Input_Born_Day2:
24790 case 6:
24800 beep:pause 200:goto Input_Born_Day2:
24810 end select
24820 'Okから右ボタンを押して何もしない ここまで
24830 endif
24840 '***********************************************************
24850 '2.WUXGAの時(WXGA以外の時)　ここまで
24860 '(1920 gload Gazo$ + "Selection.png",1,60,240
24870 '***********************************************************
24880 endif
24890 '十字キー　ここまで
24900 '右の丸ボタンを押したとき
24910 if ((bg = 2) or (key$ = chr$(13))) then
24920 'count :決定ボタンを押した回数
24930 select case (count mod 3)
24940 '1桁目入力
24950 case 0:
24960 count = 1:
24970 if (No = -1) then
24980 '1桁目　OKでは何もしない
24990 'goto check:
25000 else
25010 'ok以外のボタンを押したとき
25020 buf_day = No:buf_Day$ = str$(No)
25030 c=No:buf_Day2$ = buf_Day$ + string$(1,"*")
25040 locate 2,4
25050 color RGB(255,255,255)
25060 if ex_info$(1) <> "JP" then
25070 print "Input Born Day(1~31):";buf_Day2$
25080 else
25090 print "生まれた日(1日~31日):";buf_Day2$
25100 endif
25110 endif
25120 check:
25130 if (No >= 1 and No <= 9) then
25140 sp_on 14,0
25150 goto Input_Born_Day2:
25160 else
25170 sp_on 14,0
25180 goto complate:
25190 endif
25200 case 1:
25210 '10未満の数字ボタン+okボタン or 2桁目の数字ボタン
25220 count = 2:
25230 'locate 2,3
25240 'color RGB(255,255,255)
25250 'print "生まれた日(1日~31日):";buf_Day$
25260 'Okボタンを押したときの処理
25270 '入力値　10未満のとき
25280 'c = buf_day
25290 if (No = -1) then
25300 'c=buf_day
25310 ' buf_day = c
25320 'buf_Day$ = str$(buf_day)
25330 '10以下のとき
25340 if (buf_day < 10) then
25350 sp_on 14,0
25360 goto complate:
25370 endif
25380 else
25390 'c = No
25400 buf_day = c * 10 + No
25410 'buf_day = c
25420 buf_Day$ =str$(buf_day)
25430 locate 2,4
25440 color Rgb(255,255,255)
25450 if ex_info$(1) <> "JP" then
25460 print "Input Born Day(1~31):";buf_Day$
25470 else
25480 print "生まれた日(1日~31日):";buf_Day$
25490 endif
25500 goto Input_Born_Day2:
25510 endif
25520 '生まれた日　2桁目の数字　or 1桁の数字 + ok
25530 case 2:
25540 count=0
25550 'c=val(buf_Day$)
25560 'buf_day=c*10+No
25570 'buf_Day$=str$(buf_day)
25580 'day=buf_day
25590 'locate 2,3
25600 'print "生まれた日(1日〜31日):";buf_Day$
25610 'No=-1:ok ボタンを押したとき
25620 if (No = -1) then
25630 if ((buf_day > 0) and (buf_day < 32)) then
25640 sp_on 14,0
25650 goto complate:
25660 else
25670 goto Input_Born_Day2:
25680 endif
25690 'Okボタン以外を押したとき
25700 else
25710 c=val(buf_Day$)
25720 buf_day = c * 10 + No
25730 buf_Day$ = str$(buf_day)
25740 locate 2,4
25750 if ex_info$(1) <> "JP" then
25760 print "Input Born Day?(1~31):";buf_Day$
25770 else
25780 print "生まれた日(1日~31日):";buf_Day$
25790 endif
25800 'goto Input_Born_Day2:
25810 endif
25820 case 3:
25830 count = 4
25840 c=val(buf_day$)
25850 buf_day = c * 10 + No
25860 buf_day$ = str$(buf_day)
25870 locate 2,4
25880 if ex_info$(1) <> "JP" then
25890 print "Input Born Day?(1~31):";buf_Day$
25900 else
25910 print "生まれた日を入れてください(1日~31日):";buf_Day$
25920 endif
25930 year = val(buf_year$)
25940 if (No = -1) then
25950 'goto Input_Born_Day:
25960 sp_on 14,0:No=0
25970 goto complate:
25980 else
25990 goto Input_Born_Month2:
26000 endif
26010 'case 4:
26020 'bufyear=buf_year
26030 'if (No=-1) then
26040 'buf_day = val(buf_day$)
26050 'bufday = buf_day
26060 'sp_on 14,0
26070 'goto complate:
26080 'else
26090 'goto Input_Born_Day2:
26100 'endif
26110 end select
26120 endif
26130 if (bg2=2) then
26140 select case count
26150 case 0:
26160 if (No=-1) then
26170 'buf_day=0:buf_Day$="**"
26180 if (buf_day>=1 and buf_day<=31) then
26190 count=0:No=0
26200 buf_day=0:buf_Day$="**"
26210 'goto rewrite_day:
26220 else
26230 buf_day=0:buf_Day$="**"
26240 ui_msg"値が範囲外です"
26250 endif
26260 goto rewrite_day:
26270 else
26280 goto rewrite_day:
26290 endif
26300 rewrite_day:
26310 locate 2,4
26320 color rgb(255,255,255)
26330 print "                                      "
26340 locate 2,4
26350 if ex_info$(1)<>"JP" then
26360 print "Born Day(1~31):";buf_Day$
26370 else
26380 print "生まれた日(1日~31日):";buf_Day$
26390 endif
26400 goto Input_Born_Day2:
26410 end select
26420 endif
26430 '--------------------------Input_Born_Day:-------------------------------------------
26440 complate:
26450 suhiNo = buf_year + buf_month + buf_day
26460 'if (suhiNo < 1000) then
26470 a1 = fix(suhiNo / 1000)
26480 a2 = fix(suhiNo/100) - (a1 * 10)
26490 a3 = fix(suhiNo/10)-(a1*100+a2*10)
26500 a4 =fix(suhiNo-((a1*1000+a2*100+a3*10)))
26510 'endif
26520 bufsuhiNo = a1 + a2 + a3 + a4
26530 recomp:
26540 if ((bufsuhiNo > 0 and bufsuhiNo < 10) or (bufsuhiNo = 11) or (bufsuhiNo = 22) or (bufsuhiNo = 33)) then
26550 'bufsuhiNo=a6
26560 goto Kabara_Result_Screen:
26570 else
26580 a5 = fix(bufsuhiNo / 10)
26590 a6 = bufsuhiNo - a5 * 10
26600 bufsuhiNo = a6 + a5
26610 if (bufsuhiNo = 10) then
26620 bufsuhiNo=1
26630 endif
26640 goto Kabara_Result_Screen:
26650 endif
26660 Kabara_Result_Screen:
26670 cls 3:
26680 if ((size(0) <= 1280) and (size(1) <= 800)) then
26690 '****************************************************************************************************
26700 '1.WXGA(1260x800)の時
26710 '****************************************************************************************************
26720 gload Gazo$ + Gazo_WXGA$ + "ResultScreen_918x680_20240309.png",0,0,0
26730 '****************************************************************************************************
26740 '1.WUXGA(1260x800)の時
26750 '****************************************************************************************************
26760 else
26770 '****************************************************************************************************
26780 '1.WXGA(1920x1200)の時
26790 '****************************************************************************************************
26800 gload Gazo$ + "ResultScreen_20230601.png",0,0,0
26810 gload Gazo$ + "downscreen.png",0,0,800
26820 '****************************************************************************************************
26830 '1.WUXGA(1920x1200)の時
26840 '****************************************************************************************************
26850 endif
26860 init "kb:4"
26870 '
26880 play ""
26890 select case (bufsuhiNo)
26900 case 1:
26910 '****************************************************************************************************
26920 '1.数秘ナンバー 1
26930 '****************************************************************************************************
26940 play Voice$ + "Result_Kabara_1_20230607.mp3"
26950 '****************************************************************************************************
26960 '1.数秘ナンバー 1
26970 '****************************************************************************************************
26980 case 2:
26990 '****************************************************************************************************
27000 '1.数秘ナンバー 2
27010 '****************************************************************************************************
27020 play Voice$ + "Result_Kabara_2_20231112.mp3"
27030 '****************************************************************************************************
27040 '1.数秘ナンバー 2
27050 '****************************************************************************************************
27060 case 3:
27070 '****************************************************************************************************
27080 '1.数秘ナンバー 3
27090 '****************************************************************************************************
27100 play Voice$ + "Result_Kabara_3_20230607.mp3"
27110 '****************************************************************************************************
27120 '1.数秘ナンバー 3
27130 '****************************************************************************************************
27140 case 4:
27150 '****************************************************************************************************
27160 '1.数秘ナンバー 4
27170 '****************************************************************************************************
27180 play Voice$ + "Result_Kabara_4_20230607.mp3"
27190 '****************************************************************************************************
27200 '1.数秘ナンバー 4
27210 '****************************************************************************************************
27220 case 5:
27230 '****************************************************************************************************
27240 '1.数秘ナンバー 5
27250 '****************************************************************************************************
27260 play Voice$ + "Result_Kabara_5_20231112.mp3"
27270 '****************************************************************************************************
27280 '1.数秘ナンバー 5
27290 '****************************************************************************************************
27300 case 6:
27310 '****************************************************************************************************
27320 '1.数秘ナンバー 6
27330 '****************************************************************************************************
27340 play Voice$ + "Result_Kabara_6_20230607.mp3"
27350 '****************************************************************************************************
27360 '1.数秘ナンバー 6
27370 '****************************************************************************************************
27380 case 7:
27390 '****************************************************************************************************
27400 '1.数秘ナンバー 7
27410 '****************************************************************************************************
27420 play Voice$ + "Result_Kabara_7_20230607.mp3"
27430 '****************************************************************************************************
27440 '1.数秘ナンバー 7
27450 '****************************************************************************************************
27460 case 8:
27470 '****************************************************************************************************
27480 '1.数秘ナンバー 8
27490 '****************************************************************************************************
27500 play Voice$ + "Result_Kabara_8_20230607.mp3"
27510 '****************************************************************************************************
27520 '1.数秘ナンバー 8
27530 '****************************************************************************************************
27540 case 9:
27550 '****************************************************************************************************
27560 '1.数秘ナンバー 9
27570 '****************************************************************************************************
27580 play Voice$ + "Result_Kabara_9_20230607.mp3"
27590 '****************************************************************************************************
27600 '1.数秘ナンバー 9
27610 '****************************************************************************************************
27620 case 11:
27630 '****************************************************************************************************
27640 '1.数秘ナンバー 11
27650 '****************************************************************************************************
27660 play Voice$ + "Result_Kabara_11_20230607.mp3"
27670 '****************************************************************************************************
27680 '1.数秘ナンバー 11
27690 '****************************************************************************************************
27700 case 22:
27710 '****************************************************************************************************
27720 '1.数秘ナンバー 22
27730 '****************************************************************************************************
27740 play Voice$ + "Result_Kabara_22_20230607.mp3"
27750 '****************************************************************************************************
27760 '1.数秘ナンバー 22
27770 '****************************************************************************************************
27780 case 33:
27790 '****************************************************************************************************
27800 '1.数秘ナンバー 33
27810 '****************************************************************************************************
27820 play Voice$ + "Result_Kabara_33_20230607.mp3"
27830 '****************************************************************************************************
27840 '1.数秘ナンバー 33
27850 '****************************************************************************************************
27860 end select
27870 '****************************************************************************************************
27880 '
27890 '****************************************************************************************************
27900 font FONT
27910 '****************************************************************************************************
27920 '
27930 '****************************************************************************************************
27940 key$ = "":bg = 0:bg2=0
27950 'COLOR rgb(255,255,255)
27960 'print "●診断結果"+chr$(13)
27970 locate 0,2
27980 if ex_info$(1)<>"JP" then
27990 color rgb(0,0,0):print "Your Birth Day：";buf_year;".";buf_month;".";buf_day;".";chr$(13)
28000 color rgb(0,0,0):print"Your Kabara Kabara Number is";bufsuhiNo;".";chr$(13)
28010 locate 0,15:
28020 color rgb(255,255,255)
28030 print "Left button：Retry,Right Button：Main Screen" + chr$(13)
28040 else
28050 if ((size(0) <= 1280) and (size(1) <= 800)) then
28060 locate 0,4
28070 '****************************************************************************************************
28080 '1.WXGA(1260x800)の時
28090 '****************************************************************************************************
28100 color rgb(0,0,0):print "誕生日：";buf_year;"年";buf_month;"月";buf_day;"日";chr$(13)
28110 color rgb(0,0,0):print"あなたの数秘ナンバーは";bufsuhiNo;"です";chr$(13)
28120 locate 0,19
28130 print "                    "
28140 color rgb(255,255,255)
28150 locate 0,19
28160 print "左の丸：もう一度診断,右の丸：メイン画面" + chr$(13)
28170 '****************************************************************************************************
28180 '1.WUXGA(1260x800)の時
28190 '****************************************************************************************************
28200 else
28210 locate 0,2
28220 '****************************************************************************************************
28230 'WUXG(1920x1200)の時ここから
28240 '****************************************************************************************************
28250 color rgb(0,0,0):print "誕生日：";buf_year;"年";buf_month;"月";buf_day;"日";chr$(13)
28260 color rgb(0,0,0):print"あなたの数秘ナンバーは";bufsuhiNo;"です";chr$(13)
28270 locate 0,15
28280 color rgb(255,255,255)
28290 print "左の丸：もう一度診断,右の丸：メイン画面" + chr$(13)
28300 endif
28310 '****************************************************************************************************
28320 'WUXG(1920x1200)の時ここまで
28330 '****************************************************************************************************
28340 endif
28350 while ((key$ <> chr$(13)) and (bg <> 2) and (bg2 <> 2))
28360 key$ = inkey$
28370 bg = strig(1)
28380 bg2 = strig(0)
28390 pause 200
28400 wend
28410 'Enter or JoyPad right
28420 if ((key$ = chr$(13)) or (bg = 2)) then
28430 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 100:cls 3:goto Main_Screen:
28440 endif
28450 if ((bg2=2)) then
28460 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 100:cls 3:goto Input_Seireki:
28470 endif
28480 'suhiNo1 = fix(bufsuhiNo / 10)
28490 'suhiNo2 = bufsuhiNo - (suhiNo1 * 10)
28500 'bufsuhiNo = suhiNo1 + suhiNo2
28510 'goto recomp:
28520 'endif
28530 'print chr$(13)
28540 'color rgb(255,0,0)
28550 'print"トップ:エンターキー,S or s:保存"+chr$(13)
28560 'key$ = input$(1)
28570 'if key$ = chr$(13) then goto Main_Screen:
28580 '"Menu2 占いのルール"
28590 Suhi_Rule:
28600 '数秘術占いルールの表示
28610 cls 3:play "":init"kb:4"
28620 if  ((size(0)<=1280) and (size(1)<=800)) then
28630 '****************************************************************************************************
28640 'WUXG(1920x1200)の時ここから
28650 '****************************************************************************************************
28660 gload Gazo$ + Gazo_WXGA$ + "KabaraRuleScreen_864x640_20240219.png",0,0,0
28670 '****************************************************************************************************
28680 'WUXG(1920x1200)の時ここまで
28690 '****************************************************************************************************
28700 else
28710 '****************************************************************************************************
28720 'WUXG(1920x1200)の時ここから
28730 '****************************************************************************************************
28740 gload Gazo$ + "KabaraRuleScreen_20230601.png",0,0,0
28750 gload Gazo$ + "downscreen.png",0,0,800
28760 '****************************************************************************************************
28770 'WUXG(1920x1200)の時ここまで
28780 '****************************************************************************************************
28790 endif
28800 'cls 3:
28810 'line (0,0) - (1500,60),rgb(0,0,255),bf
28820 'line (0,60) - (1500,60*9),rgb(127,255,212),bf
28830 'line (0,60 * 9) - (1500,60 * 10 + 30),rgb(0,255,0),bf
28840 'COLOR rgb(255,255,255):print "Menu2 数秘術のルール";chr$(13)
28850 if ex_info$(1)<>"JP" then
28860 locate 0,2:Font 48
28870 print chr$(13) + chr$(13)
28880 color rgb(0,0,0)
28890 print "We will convert your birth date to a single number.";chr$(13)
28900 print "Number range: 1~9, 11, 22, 33";chr$(13)
28910 print "Example: If your birth date is 22nd November 1973";chr$(13)
28920 print "1+9+7+3+11+22=53 ";chr$(13)
28930 print "→ 5 + 3 = 8" + chr$(13)
28940 print "So, your numerology number is 8.";chr$(13)
28950 locate 0,15
28960 color rgb(255,255,255)
28970 print "Please press the right on the joystick"
28980 play Voice$ + "Voice_Kabara_Rule_Message_20230607.mp3"
28990 else
29000 Font FONT
29010 if ((size(0)<=1280) and (size(1)<=800)) then
29020 '************************************************************************************************
29030 '1.WXGAの時1200x800の時
29040 '************************************************************************************************
29050 color rgb(0,0,0)
29060 locate 1,5:print "誕生日を単数変換します";chr$(13)
29070 locate 1,7:print "数字の範囲:1~９,11,22,33";chr$(13)
29080 locate 1,9:print "例:1973年11月22日の場合";chr$(13)
29090 locate 1,11:print "1+9+7+3+11+22=53 ";chr$(13)
29100 locate 1,13:print "→ 5 + 3 = 8" + chr$(13)
29110 locate 1,15:print "故に8が数秘ナンバーになります";chr$(13)
29120 locate 0,19:color rgb(255,255,255)
29130 print "ジョイパッドの右を押してください"
29140 '************************************************************************************************
29150 '1.WXGAの時1200x800の時
29160 '************************************************************************************************
29170 else
29180 '****************************************************************************************************
29190 '2.WUXG(1920x1200)の時ここから
29200 '****************************************************************************************************
29210 print chr$(13) + chr$(13)
29220 color rgb(0,0,0)
29230 print "誕生日を単数変換します";chr$(13)
29240 print "数字の範囲:1~９,11,22,33";chr$(13)
29250 print "例:1973年11月22日の場合";chr$(13)
29260 print "1+9+7+3+11+22=53 ";chr$(13)
29270 print "→ 5 + 3 = 8" + chr$(13)
29280 print "故に8が数秘ナンバーになります";chr$(13)
29290 locate 0,15
29300 color rgb(255,255,255)
29310 print "ジョイパッドの右を押してください"
29320 '****************************************************************************************************
29330 '2.WUXG(1920x1200)の時ここまで
29340 '****************************************************************************************************
29350 endif
29360 play Voice$ + "Voice_Kabara_Rule_Message_20230607.mp3"
29370 endif
29380 '"key$ = input$(1)"
29390 '"if key$ = chr$(13) then goto Main_Screen:"
29400 suhi_rule_selection:
29410 bg = 0:key$ = "":bg2=0
29420 while ((bg <> 2) and (key$ <> chr$(13)) and (bg2<>2))
29430 bg = strig(1)
29440 key$ = inkey$
29450 bg2=strig(0)
29460 pause 200
29470 wend
29480 if ((bg = 2) or (key$ = chr$(13))) then
29490 pause 200:cls 4:goto Main_Screen:
29500 endif
29510 if (bg2=2) then
29520 play "":pause 200
29530 play Voice$ + "Voice_Kabara_Rule_Message_20230607.mp3"
29540 goto suhi_rule_selection:
29550 endif
29560 '2.設定 ここから
29570 '2-1.トップ画面に戻る
29580 Setting:
29590 cls 3:init"kb:4":font 48:No=0
29600 play ""
29610 play Voice$ + "Voice_Kabara_Setting_20230614.mp3"
29620 '****************************************************************************************************
29630 'W(1280x 800)の時ここから
29640 '****************************************************************************************************
29650 if (size(0)<=1280 and size(1)<=800) then
29660 gload Gazo$ + Gazo_WXGA$ + "Screen1_Setting_Top_907x680_20240221.png",0,0,0
29670 '****************************************************************************************************
29680 'W(1280 x800)の時ここまで
29690 '****************************************************************************************************
29700 else
29710 '****************************************************************************************************
29720 'WUXG(1920x1200)の時ここから
29730 '****************************************************************************************************
29740 gload Gazo$ + "Screen1_Setting_Top.png",0,0,0
29750 gload Gazo$ + "downscreen.png",0,0,800
29760 '****************************************************************************************************
29770 'WUXG(1920x1200)の時ここまで
29780 '****************************************************************************************************
29790 endif
29800 if (size(0)<=1280 and size(1)<=800) then
29810 font FONT:color rgb(255,255,255):cls
29820 sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:
29830 '****************************************************************************************************
29840 '(1280x800)の時 ここから
29850 '****************************************************************************************************
29860 locate 1,5:
29870 print "番号を選んでください"
29880 locate 1,7:
29890 print " :1.トップ画面に戻る"
29900 locate 1,10:
29910 print " :2.バーズアイグリッドデーターリスト"
29920 locate 1,13:
29930 print " :3.未実装" + chr$(13)
29940 locate 1,16:
29950 print " :4.未実装" + chr$(13)
29960 color rgb(0,0,0):locate 1,19:
29970 print "1.トップ画面に戻るを選択"
29980 '****************************************************************************************************
29990 '(1280x800)の時 ここまで
30000 '****************************************************************************************************
30010 else
30020 font FONT
30030 print chr$(13) + chr$(13) + chr$(13)
30040 color rgb(255,255,255):sp_on 0,1:
30050 '****************************************************************************************************
30060 'WUXG(1920x1200)の時ここから
30070 '****************************************************************************************************
30080 print "番号を選んでください" + chr$(13)
30090 print " :1.トップ画面に戻る"+ chr$(13)
30100 print " :2.バーズアイグリッドデーターリスト" + chr$(13)
30110 print " :3.未実装" + chr$(13)
30120 print " :4.未実装" + chr$(13)
30130 color rgb(0,0,0)
30140 locate 1,15:print "1.トップ画面に戻るを選択"
30150 '****************************************************************************************************
30160 'WUXG(1920x1200)の時ここまで
30170 '****************************************************************************************************
30180 endif
30190 Setting_Selection:
30200 y=0:key$="":bg=0:bg2=0
30210 while ((key$ <> chr$(13)) and (bg <> 2) and (bg2<>2) and (y <> -1) and (y <> 1))
30220 y=stick(1)
30230 key$ = inkey$
30240 bg=strig(1)
30250 bg2 = strig(0)
30260 pause 200
30270 wend
30280 if ((bg = 2) or (key$ = chr$(13))) then
30290 select case No
30300 case 0:
30310 sp_on 0,0:sp_on 1,0:sp_on 2,0:beep:pause 200:cls 3:goto Main_Screen:
30320 case 1:
30330 sp_on 0,0:sp_on 1,0:sp_on 2,0:beep:pause 200:goto BirdsEyeGrid_Entry:
30340 end select
30350 endif
30360 if (bg2 = 2) then
30370 play "":pause 200
30380 play Voice$ + "Voice_Kabara_Setting_20230614.mp3"
30390 goto Setting_Selection:
30400 endif
30410 '****************************************************************************************************
30420 '(1280x800)の時 ここから
30430 '****************************************************************************************************
30440 if (size(0) <= 1280 and size(1) <= 800) then
30450 if ((y=1) or (y=-1)) then
30460 select case No
30470 case 0:
30480 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:beep:gosub Setting_Recheck:pause 200:color rgb(0,0,0):locate 1,19:print "                    ":locate 1,19:print"2.バーズアイグリットデーターリストを選択":goto Setting_Selection:
30490 case else:
30500 No=0:sp_on 1,0:sp_on 0,1:sp_on 2,0:sp_on 3,0:beep:gosub Setting_Recheck:pause 200:locate 1,19:color rgb(0,0,0):print "                                              ":locate 1,19:print "1.トップ画面に戻るを選択":goto Setting_Selection:
30510 end select
30520 '****************************************************************************************************
30530 '(1280x800)の時 ここまで
30540 '****************************************************************************************************
30550 endif
30560 else
30570 '****************************************************************************************************
30580 '(1920x1280)の時 ここから
30590 '****************************************************************************************************
30600 if ((y = 1) or (y = -1)) then
30610 select case No
30620 case 0:
30630 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:beep:pause 200:color rgb(0,0,0):locate 1,15:print "                                              ":locate 1,15:print"2.バーズアイグリットデーターリストを選択":goto Setting_Selection:
30640 case else:
30650 No=0:sp_on 1,0:sp_on 0,1:sp_on 2,0:sp_on 3,0:beep:pause 200:color rgb(0,0,0):locate 1,15:print "                                              ":locate 1,15:print "1.トップ画面に戻るを選択":goto Setting_Selection:
30660 end select
30670 endif
30680 '****************************************************************************************************
30690 '(1920x1200)の時 ここまで
30700 '****************************************************************************************************
30710 endif
30720 '2.設定 ここまで
30730 '3.Help
30740 '3-1.ルールの表示
30750 '3-2.バージョン
30760 '3-3.トップに戻る
30770 Help:
30780 cls 3:font FONT:No=0
30790 play ""
30800 '****************************************************************************************************
30810 ''WXGAの場合　ここから (1280 x 800)
30820 '****************************************************************************************************
30830 if ((size(0) <= 1280) and (size(1) <= 800)) then
30840 gload Gazo$ + Gazo_WXGA$ + "TopScreen_Help_907x680_20240216.png",0,0,0
30850 '****************************************************************************************************
30860 ''WXGAの場合　ここまで (1280 x 800)
30870 '****************************************************************************************************
30880 else
30890 '****************************************************************************************************
30900 'WUXG(1920x1200)の時ここから
30910 '****************************************************************************************************
30920 gload Gazo$ + "TopScreen_Help20230612.png",0,0,0
30930 gload Gazo$ + "downscreen.png",0,0,800
30940 endif
30950 '****************************************************************************************************
30960 'WUXG(1920x1200)の時ここまで
30970 '****************************************************************************************************
30980 if ex_info$(1)<>"JP" then
30990 font FONT
31000 color rgb(255,255,255)
31010 print chr$(13)+chr$(13)+chr$(13)
31020 print "Please select a number"+chr$(13)
31030 print " :1. Rules for Explain" + chr$(13)
31040 print " :2. Display Version" + chr$(13)
31050 print " :3. References" + chr$(13)
31060 print " :4. Return to Top Screen" + chr$(13)
31070 else
31080 if ((size(0)<=1280) and (size(1)<=800)) then
31090 color rgb(255,255,255)
31100 font FONT
31110 locate 1,5
31120 print "番号を選んでください"
31130 locate 1,7
31140 print " :1.ルールの説明"
31150 locate 1,10
31160 print " :2.バージョンの表示"
31170 locate 1,13
31180 print " :3.参考文献"
31190 locate 1,16
31200 print " :4.トップ画面に戻る"
31210 else
31220 '****************************************************************************************************
31230 'WUXG(1920x1200)の時ここから
31240 '****************************************************************************************************
31250 font FONT
31260 color rgb(255,255,255)
31270 print chr$(13)+chr$(13)+chr$(13)
31280 print "番号を選んでください"+chr$(13)
31290 print " :1.ルールの説明" + chr$(13)
31300 print " :2.バージョンの表示" + chr$(13)
31310 print " :3.参考文献" + chr$(13)
31320 print " :4.トップ画面に戻る" + chr$(13)
31330 endif
31340 endif
31350 '****************************************************************************************************
31360 'WUXG(1920x1200)の時ここまで
31370 '****************************************************************************************************
31380 '************************************************************************************************
31390 '1.WXGAの場合　ここから (1280 x 800)
31400 '************************************************************************************************
31410 color rgb(0,0,0)
31420 if ((size(0) <= 1280) and (size(1) <= 800)) then
31430 sp_on 0,1:sp_on 1,0:sp_on 2,0,sp_on 3,0
31440 locate 1,19
31450 print "                                  "
31460 if ex_info$(1) <> "JP" then
31470 print "1. Select Rules for Explain"
31480 else
31490 locate 1,19
31500 print "1.ルールの説明を選択"
31510 endif
31520 '************************************************************************************************
31530 '1.WXGAの場合　ここまで (1280 x 800)
31540 '************************************************************************************************
31550 else
31560 '*************************************************************************************************
31570 '2.WUXG(1920x1200)の時ここから
31580 '**************************************************************************************************
31590 'color rgb(0,0,0)
31600 sp_on 0,1:sp_on 1,0:sp_on 2,0,sp_on 3,0
31610 locate 1,15
31620 print "                                  "
31630 if ex_info$(1) <> "JP" then
31640 print "1. Select Rules for Explain"
31650 else
31660 locate 1,15
31670 print "1.ルールの説明を選択"
31680 endif
31690 '****************************************************************************************************
31700 '2.WUXG(1920x1200)の時ここまで
31710 '****************************************************************************************************
31720 endif
31730 init"kb:4"
31740 play Voice$ + "Voice_Kabara_Help_Top_20230614.mp3"
31750 Help_Select:
31760 bg=0:key$="":y=0:bg2=0
31770 while ((key$ <> chr$(31)) and (key$ <> chr$(13)) and (y <> 1) and (y <> -1) and (bg <> 2) and (bg2 <> 2))
31780 y = stick(1)
31790 key$ = inkey$
31800 bg = strig(1)
31810 bg2 = strig(0)
31820 pause 200
31830 wend
31840 if ex_info$(1)<>"JP" then
31850 '*******************************************************************************************************
31860 '英語の時 ここから
31870 '*******************************************************************************************************
31880 'Joypad: Down (y=1), Cursor: Down (key$=chr$(31))
31890 if ((y = 1) or (key$ = chr$(31))) then
31900 select case No
31910 case 0:
31920 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print"2. Display Version":goto Help_Select:
31930 case 1:
31940 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "3. References":goto Help_Select:
31950 case 2:
31960 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "4. Return to Top Screen":goto Help_Select:
31970 case 3:
31980 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "1. Select Rule for Explain":goto Help_Select:
31990 end select
32000 endif
32010 '************************************************************************************************
32020 '1.WXGAの場合　ここから (1280 x 800)
32030 '************************************************************************************************
32040 if ((y = -1) or (key$ = chr$(30))) then
32050 select case No
32060 case 0:
32070 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,19:print "                                      ":locate 1,19:print "4.Return to Top Screen":goto Help_Select:
32080 case 1:
32090 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,19:print "                                      ":locate 1,19:print "1.Select Rules for Explain":goto Help_Select:
32100 case 2:
32110 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,19:print "                                        ":locate 1,19:print "2.Display Version":goto Help_Select:
32120 case 3:
32130 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,19:print "                                              ":locate 1,19:print "3.References":goto Help_Select:
32140 end select
32150 endif
32160 '************************************************************************************************
32170 '1.WXGAの場合　ここまで (1280 x 800)
32180 '************************************************************************************************
32190 '****************************************************************************************************
32200 'WUXG(1920x1200)の時ここから
32210 '****************************************************************************************************
32220 if ((y = -1) or (key$ = chr$(30))) then
32230 select case No
32240 case 0:
32250 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "4.Return to Top Screen":goto Help_Select:
32260 case 1:
32270 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.Select Rules for Explain":goto Help_Select:
32280 case 2:
32290 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                        ":locate 1,15:print "2.Display Version":goto Help_Select:
32300 case 3:
32310 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "3.References":goto Help_Select:
32320 end select
32330 endif
32340 '****************************************************************************************************
32350 'WUXG(1920x1200)の時ここまで
32360 '****************************************************************************************************
32370 '*******************************************************************************************************
32380 '英語の時 ここまで
32390 '*******************************************************************************************************
32400 else
32410 '******************************************************************************************************
32420 '日本語の時
32430 '******************************************************************************************************
32440 'endif
32450 'endif
32460 '************************************************************************************************
32470 '1.WXGAの場合　ここから (1280 x 800)
32480 '************************************************************************************************
32490 '******************************************************************************************************
32500 '日本語の時
32510 '******************************************************************************************************
32520 if ((size(0) <= 1280) and (size(1) <= 800)) then
32530 'ジョイパッド：下 (y=1)、カーソル：下 (key$=chr$(31))
32540 if ((y = 1) or (key$ = chr$(31))) then
32550 select case No
32560 case 0:
32570 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_put 1,(5,Y + 120),1,0:count = count + 1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0):locate 1,19:print "                                      ":locate 1,19:print"2.バージョンの表示を選択":goto Help_Select:
32580 case 1:
32590 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,Y + 220),2,0:count = count + 1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0):locate 1,19:print "                                      ":locate 1,19:print "3.参考文献を選択":goto Help_Select:
32600 case 2:
32610 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,Y + 320),0,0:count = count + 1:beep:pause 200:locate 1,19:gosub Help_Top_ReCheck:color rgb(0,0,0):print "                                      ":locate 1,19:print "4.トップ画面に戻る":goto Help_Select:
32620 case 3:
32630 '****************************
32640 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,Y + 20),0,0:count = count + 1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0):locate 1,19:print "                                              ":locate 1,19:print "1.ルールの説明を選択":goto Help_Select:
32650 '****************************
32660 end select
32670 endif
32680 '************************************************************************************************
32690 '1.WXGAの場合　ここまで (1280 x 800)
32700 '************************************************************************************************
32710 '******************************************************************************************************
32720 '日本語の時
32730 '******************************************************************************************************
32740 else
32750 '****************************************************************************************************
32760 'WUXG(1920x1200)の時ここから
32770 '****************************************************************************************************
32780 '******************************************************************************************************
32790 '日本語の時
32800 '******************************************************************************************************
32810 if ((y = 1) or (key$ = chr$(31))) then
32820 select case No
32830 case 0:
32840 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print"2.バージョンの表示を選択":goto Help_Select:
32850 case 1:
32860 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "3.参考文献を選択":goto Help_Select:
32870 case 2:
32880 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "4.トップ画面に戻る":goto Help_Select:
32890 case 3:
32900 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "1.ルールの説明を選択":goto Help_Select:
32910 end select
32920 endif
32930 '****************************************************************************************************
32940 'WUXG(1920x1200)の時ここまで
32950 '****************************************************************************************************
32960 endif
32970 'ジョイパッド：上  (y=-1) 、カーソル上 (key$=chr$(30))
32980 '************************************************************************************************
32990 '1.WXGAの場合　ここから (1280 x 800)
33000 '************************************************************************************************
33010 if ((size(0) <= 1280) and (size(1) <= 800)) then
33020 if ((y = -1) or (key$ = chr$(30))) then
33030 select case No
33040 case 0:
33050 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,Y+320),0,0:count=count+1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0):locate 1,15:print "                                      ":locate 1,19:print "4.トップ画面に戻るを選択":goto Help_Select:
33060 case 1:
33070 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,Y+20),0,0:count=count+1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0,0):locate 1,15:print "                                      ":locate 1,19:print "1.ルールの説明を選択":goto Help_Select:
33080 case 2:
33090 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(5,Y+120),1,0:count=count+1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0):locate 1,15:print "                                        ":locate 1,19:print "2.バージョンの表示を選択":goto Help_Select:
33100 case 3:
33110 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,Y+220),2,0:count=count+1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0):locate 1,15:print "                                              ":locate 1,19:print "3.参考文献を選択":goto Help_Select:
33120 end select
33130 endif
33140 '************************************************************************************************
33150 '1.WXGAの場合　ここから (1280 x 800)
33160 '************************************************************************************************
33170 else
33180 '************************************************************************************************
33190 'WUXG(1920x1200)の時ここから
33200 '************************************************************************************************
33210 if ((y = -1) or (key$ = chr$(30))) then
33220 select case No
33230 case 0:
33240 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "4.トップ画面に戻るを選択":goto Help_Select:
33250 case 1:
33260 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.ルールの説明を選択":goto Help_Select:
33270 case 2:
33280 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                        ":locate 1,15:print "2.バージョンの表示を選択":goto Help_Select:
33290 case 3:
33300 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "3.参考文献を選択":goto Help_Select:
33310 end select
33320 endif
33330 '****************************************************************************************************
33340 'WUXG(1920x1200)の時ここまで
33350 '****************************************************************************************************
33360 endif
33370 'endif
33380 'ジョイパッド　右(bg=2) or Enter key (key$=chr$(13))
33390 if ((bg = 2) or (key$ = chr$(13))) then
33400 select case No
33410 case 0:
33420 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:goto Suhi_Rule_explainTop: 'Suhi_Rule:
33430 case 1:
33440 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:goto Version:
33450 case 2:
33460 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 20:goto References1:
33470 '3:Top画面に行く
33480 case 3:
33490 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:cls 4:goto Main_Screen:
33500 end select
33510 endif
33520 if (bg2 = 2) then
33530 play "":pause 200
33540 play Voice$ + "Voice_Kabara_Help_Top_20230614.mp3"
33550 goto Help_Select:
33560 endif
33570 'ルールの説明　トップ画面
33580 Suhi_Rule_explainTop:
33590 '**********************************************************
33600 cls 3:No=0
33610 play ""
33620 '****************************************************************************************************
33630 'WUXG(1920x1200)の時ここから
33640 '背景画像
33650 '****************************************************************************************************
33660 font FONT
33670 if ((size(0) <= 1280) and (size(1) <= 800)) then
33680 gload Gazo$ + Gazo_WXGA$ + "Rule_explain_TopScreen_907x680_20240218.png",0,0,0
33690 else
33700 gload Gazo$ + "Rule_explain_TopScreen20240201.png",0,0,0
33710 gload Gazo$ + "downscreen.png",0,0,800
33720 endif
33730 '****************************************************************************************************
33740 'WUXG(1920x1200)の時ここまで
33750 '背景画像
33760 '****************************************************************************************************
33770 if ex_info$(1)<>"JP" then
33780 color rgb(255,255,255)
33790 print chr$(13)+chr$(13)+chr$(13)
33800 print "Please select a number"+chr$(13)
33810 print " :1.How to Kabara" + chr$(13)
33820 print " :2. Explain for BirdseyeGrid" + chr$(13)
33830 print " :3. Return to Top Screen" + chr$(13)
33840 else
33850 '****************************************************************************************************
33860 'WUXG(1920x1200)の時ここから
33870 '****************************************************************************************************
33880 '****************************************************************************************************
33890 'Top画面メニュー表示文字　ここから
33900 '****************************************************************************************************
33910 '***************************************************************************************************
33920 'WXGA(1200x800)の時 ここから
33930 '***************************************************************************************************
33940 if ((size(0) <= 1280) and (size(1) <= 800)) then
33950 '***************************************************************************************************
33960 'WXGA(1200x800)の時 ここから
33970 '***************************************************************************************************
33980 color rgb(255,255,255)
33990 locate 1,5
34000 print "番号を選んでください"
34010 locate 1,7:    '〇
34020 print " :1.数秘術のやり方"
34030 locate 1,10:   '〇
34040 print " :2.バーズアイグリットの説明"
34050 locate 1,13:    '〇
34060 print " :3.トップ画面に戻る"
34070 '***************************************************************************************************
34080 'WXGA(1200x800)の時 ここまで
34090 '***************************************************************************************************
34100 else
34110 '***************************************************************************************************
34120 'WXGA(1920x1260) の時 ここから
34130 '***************************************************************************************************
34140 color rgb(255,255,255)
34150 print chr$(13)+chr$(13)+chr$(13)
34160 print "番号を選んでください"+chr$(13)
34170 print " :1.数秘術のやり方" + chr$(13)
34180 print " :2.バーズアイグリットの説明" + chr$(13)
34190 print " :3.トップ画面に戻る" + chr$(13)
34200 '***************************************************************************************************
34210 'WXGA(1920x1260) の時 ここまで
34220 '***************************************************************************************************
34230 '****************************************************************************************************
34240 'Top画面メニュー表示文字　ここまで
34250 '****************************************************************************************************
34260 endif
34270 '****************************************************************************************************
34280 'WUXG(1920x1200)の時ここまで
34290 '****************************************************************************************************
34300 endif
34310 color rgb(0,0,0)
34320 sp_on 0,1:sp_on 1,0:sp_on 2,0,sp_on 3,0
34330 locate 1,15
34340 print "                                  "
34350 if ex_info$(1) <> "JP" then
34360 '***************************************************************************************************
34370 '英語の時
34380 '*************************************************************************************************
34390 print "                                  "
34400 print ":1.How to Kabara"
34410 '***************************************************************************************************
34420 '英語の時
34430 '*************************************************************************************************
34440 else
34450 '******************************************************************************************************
34460 '日本語の時
34470 '****************************************************************************************************
34480 '****************************************************************************************************
34490 'WXGA 1280 x 800 の時　ここから
34500 '****************************************************************************************************
34510 if ((size(0) <= 1280) and (size(1) <= 800))  then
34520 '****************************************************************************************************
34530 'WXGA 1280x800 の時　ここから
34540 '****************************************************************************************************
34550 locate 1,19
34560 print ":1.数秘術のやり方"
34570 '****************************************************************************************************
34580 'WXGA 1280 x 800 の時　ここまで
34590 '****************************************************************************************************
34600 endif
34610 '****************************************************************************************************
34620 'WXGA 1280 x 800 の時　ここまで
34630 '****************************************************************************************************
34640 else
34650 '****************************************************************************************************
34660 '1920 x 1260  ここから
34670 '****************************************************************************************************
34680 locate 1,15
34690 print ":1.数秘術のやり方"
34700 '****************************************************************************************************
34710 '1920 x 1260 ここまで
34720 '****************************************************************************************************
34730 endif
34740 endif
34750 init "kb:4"
34760 play Voice$ + "Voice_Kabara_Help_Top_20230614.mp3"
34770 Suhi_Rule_explainTop2:
34780 bg=0:key$="":y=0:bg2=0
34790 while ((key$ <> chr$(31)) and (key$ <> chr$(13)) and (y <> 1) and (y <> -1) and (bg <> 2) and (bg2 <> 2))
34800 y = stick(1)
34810 key$ = inkey$
34820 bg = strig(1)
34830 bg2 = strig(0)
34840 pause 200
34850 wend
34860 '******************************************************************************************************
34870 '英語 ここから
34880 '******************************************************************************************************
34890 if ex_info$(1)<>"JP" then
34900 '******************************************************************************************************
34910 '英語 ここから
34920 '******************************************************************************************************
34930 'Joypad: Down (y=1), Cursor: Down (key$=chr$(31))
34940 if ((y = 1) or (key$ = chr$(31))) then
34950 select case No
34960 case 0:
34970 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print"2. Explain for BirdseyeGrid":goto Suhi_Rule_explainTop2:
34980 case 1:
34990 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "3. Return to Top Screen":goto Suhi_Rule_explainTop2:
35000 case 2:
35010 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "1.How to Kabara":goto Suhi_Rule_explainTop2:
35020 end select
35030 endif
35040 'Joypad: Up (y=-1), Cursor: Up (key$=chr$(30))
35050 if ((y = -1) or (key$ = chr$(30))) then
35060 select case No
35070 case 0:
35080 No=2:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 2,(5,Y+220),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.How to Kabara":goto Suhi_Rule_explainTop2:
35090 case 2:
35100 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(5,Y+120),1,0:beep:pause 200:locate 1,15:print "                                        ":locate 1,15:print "2. Explain for BirdseyeGrid":goto Suhi_Rule_explainTop2:
35110 case 3:
35120 No=0:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 0,(5,Y+20),2,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "3. Return to Top Screen":goto Suhi_Rule_explainTop2:
35130 end select
35140 endif
35150 '********************************************************************************************************
35160 '英語　ここまで
35170 '********************************************************************************************************
35180 else
35190 '********************************************************************************************************
35200 '英語　ここまで
35210 '********************************************************************************************************
35220 'ジョイパッド：下 (y=1)、カーソル：下 (key$=chr$(31))
35230 '*******************************************************************************************************
35240 'WXGA 1200x 800 日本語
35250 '*******************************************************************************************************
35260 if ((size(0) <= 1280) and (size(1) <= 800)) then
35270 '*******************************************************************************************************
35280 'WXGA 1200x 800 ここから 日本語
35290 '*******************************************************************************************************
35300 if ((y = 1) or (key$ = chr$(31))) then
35310 select case No
35320 case 0:
35330 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_put 1,(x,Y+120),1,0:beep:gosub Suhi_Rule_Screen_Recheck:pause 200:count=count+1:color rgb(0,0,0):locate 1,19:print "                                      ":locate 1,19:print"2.バーズアイグリットの説明":goto Suhi_Rule_explainTop2:
35340 case 1:
35350 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(X,Y+220),2,0:beep:gosub Suhi_Rule_Screen_Recheck:pause 200:count=count+1:locate 1,19:color rgb(0,0,0):print "                                      ":locate 1,19:print "3.トップ画面に戻る":goto Suhi_Rule_explainTop2:
35360 case 2:
35370 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(X,Y+20),0,0:beep:gosub Suhi_Rule_Screen_Recheck:pause 200:count=count+1:locate 1,19:color rgb(0,0,0):print "                                              ":locate 1,19:print "1.数秘術のやり方を選択":goto Suhi_Rule_explainTop2:
35380 end select
35390 endif
35400 'ジョイパッド：上  (y=-1) 、カーソル上 (key$=chr$(30))
35410 if ((y = -1) or (key$ = chr$(30))) then
35420 select case No
35430 case 0:
35440 No=2:sp_on 1,0:sp_on 0,0:sp_on 2,1:sp_on 0,0:sp_put 2,(5,Y+220),0,0:beep:gosub Suhi_Rule_Screen_Recheck:pause 200:count=count+1:locate 1,19:color rgb(0,0,0):print "                                      ":locate 1,19:print "1.数秘術のやり方":goto Suhi_Rule_explainTop2:
35450 case 1:
35460 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,Y+20),1,0:beep:gosub Suhi_Rule_Screen_Recheck:pause 200:count=count+1:locate 1,19:color rgb(0,0,0):print "                                        ":locate 1,19:print "2.バーズアイグリットの説明を選択":goto Suhi_Rule_explainTop2:
35470 case 2:
35480 No=1:sp_on 1,1:sp_on 1,0:sp_on 0,0:sp_on 2,0:sp_put 1,(5,Y+120),2,0:beep:gosub Suhi_Rule_Screen_Recheck:pause 200:count=count+1:locate 1,19:color rgb(0,0,0):print "                                              ":locate 1,19:print "3.トップ画面に行く":goto Suhi_Rule_explainTop2:
35490 end select
35500 endif
35510 endif
35520 '*******************************************************************************************************
35530 'WXGA 1200x 800 ここまで 日本語
35540 '*******************************************************************************************************
35550 '*******************************************************************************************************
35560 '1920x 1260 　ここから
35570 '*******************************************************************************************************
35580 else
35590 '*******************************************************************************************************
35600 '1920x 1260 　ここから
35610 '*******************************************************************************************************
35620 if ((y = 1) or (key$ = chr$(31))) then
35630 select case No
35640 case 0:
35650 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print"2.バーズアイグリットの説明":goto Suhi_Rule_explainTop2:
35660 case 1:
35670 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "3.トップ画面に戻る":goto Suhi_Rule_explainTop2:
35680 case 2:
35690 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "1.数秘術のやり方を選択":goto Suhi_Rule_explainTop2:
35700 end select
35710 endif
35720 'ジョイパッド：上  (y=-1) 、カーソル上 (key$=chr$(30))
35730 if ((y = -1) or (key$ = chr$(30))) then
35740 select case No
35750 case 2:
35760 No=0:sp_on 1,0:sp_on 0,1:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.数秘術のやり方":goto Suhi_Rule_explainTop2:
35770 case 0:
35780 No=1:sp_on 2,0:sp_on 1,1:sp_on 2,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                        ":locate 1,15:print "2.バーズアイグリットの説明を選択":goto Suhi_Rule_explainTop2:
35790 case 1:
35800 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "3.トップ画面に行く":goto Suhi_Rule_explainTop2:
35810 end select
35820 endif
35830 endif
35840 '******************************************************************************************************
35850 '1920x 1260　ここまで
35860 '******************************************************************************************************
35870 'endif
35880 'ジョイパッド　右(bg=2) or Enter key (key$=chr$(13))
35890 '*******************************************************************************************************
35900 '決定ボタンを押したときの処理　共通部分　ここから
35910 '********************************************************************************************************
35920 '********************************************************************************************************
35930 'bg:右の丸ボタン　chr$(13):Enter Key
35940 '********************************************************************************************************
35950 if ((bg = 2) or (key$ = chr$(13))) then
35960 select case No
35970 case 0:
35980 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 20:goto Suhi_Rule:  '1.数秘ルールの説明
35990 case 1:
36000 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 20:goto BirdsEyeGrid_Explain1:  '2.バーズアイグリットの説明
36010 '3:Top画面に行く
36020 case 2:
36030 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:cls 4:goto Main_Screen: '3.メイン画面に行く
36040 end select
36050 endif
36060 '********************************************************************************************************
36070 '決定ボタンを押したときの処理　共通部分　ここまで
36080 '*********************************************************************************************************
36090 if (bg2 = 2) then
36100 play "":pause 200
36110 play Voice$ + "Voice_Kabara_Help_Top_20230614.mp3"
36120 goto Suhi_Rule_explainTop2:
36130 endif
36140 '**********************************************************
36150 'バーズアイグリットの説明1
36160 'Help-
36170 '**********************************************************
36180 BirdsEyeGrid_Explain1:
36190 '●.初期設定
36200 cls 3:Font FONT:No=0:bg=0:key$="":bg2=0
36210 play "":'音を停める
36220 'バーズアイグリット基本チャートを表示　　ここから
36230 if ex_info$(1) <> "JP" then
36240 '英語ファイル
36250 else
36260 if ((size(0)<=1280) and (size(1)<=800)) then
36270 gload Gazo$ + Gazo_WXGA$ + "BirdsEyeGrid_Explain1_Chart_907x680_20240219.png",0,0,0
36280 else
36290 '****************************************************************************************************
36300 'WUXG(1920x1200)の時ここから
36310 '****************************************************************************************************
36320 '日本語ファイル
36330 gload Gazo$ + "BirdsEyeGrid_Explain1_Chart_20240202.png",0,0,0
36340 '****************************************************************************************************
36350 'WUXG(1920x1200)の時ここまで
36360 '****************************************************************************************************
36370 endif
36380 'バーズアイグリット基本チャートを表示　　ここまで
36390 endif
36400 'ジョイパッドの右で次へ行く
36410 while ((key$ <> chr$(13)) and (bg <> 2) and (bg2<>2))
36420 key$ = inkey$
36430 bg = strig(1)
36440 bg2 = strig(0)
36450 pause 200
36460 wend
36470 if (bg=2 or key$=chr$(13)) then
36480 'ジョイパッドの右を押した時、もしくはEnterを押したときの処理
36490 'goto バーズアイグリット説明の2番目に行く
36500 '未実装なのでメイン画面に行く
36510 goto Main_Screen:
36520 end
36530 endif
36540 if (bg2 = 2 or key$ = "") then
36550 'ジョイパッドの左を押した時、もしくはSpaceを押したときの処理
36560 'goto Top画面に行く
36570 goto Main_Screen:
36580 'end
36590 endif
36600 '**********************************************************
36610 'バーズアイグリットの説明2
36620 'Help-
36630 '**********************************************************
36640 BirdsEyeGrid_Explain2:
36650 '●.初期設定
36660 cls 3:Font 48:No = 0:bg = 0:key$ = "":bg2 = 0
36670 play "":'音を停める
36680 'バーズアイグリット基本チャートを表示　　ここから
36690 if ex_info$(1) <> "JP" then
36700 '英語ファイル
36710 else
36720 '日本語ファイル
36730 '****************************************************************************************************
36740 'WUXG(1920x1200)の時ここから
36750 '****************************************************************************************************
36760 gload Gazo$ + "BirdsEyeGrid_Exaple1_Chart_20240202.png",0,0,0
36770 '****************************************************************************************************
36780 'WUXG(1920x1200)の時ここまで
36790 '****************************************************************************************************
36800 'バーズアイグリット基本チャートを表示　　ここまで
36810 endif
36820 'ジョイパッドの右で次へ行く
36830 while ((key$ <> chr$(13)) and (bg <> 2) and (bg2<>2))
36840 key$ = inkey$
36850 bg = strig(1)
36860 bg2 = strig(0)
36870 pause 200
36880 wend
36890 if (bg = 2 or key$ = chr$(13)) then
36900 'ジョイパッドの右を押した時、もしくはEnterを押したときの処理
36910 'goto バーズアイグリット説明の3番目に行く
36920 end
36930 endif
36940 if (bg2 = 2 or key$ = "") then
36950 'ジョイパッドの左を押した時、もしくはSpaceを押したときの処理
36960 'goto Top画面に行く
36970 goto Main_Screen:
36980 'end
36990 endif
37000 '**********************************************************
37010 '数秘術占い　トップ画面
37020 Kabara_TopScreen:
37030 cls 3:play "":
37040 if ((size(0)<=1280) and (size(1)<=800)) then
37050 '***********************************************************
37060 '1280x800ここから
37070 '***********************************************************
37080 gload Gazo$ + Gazo_WXGA$ + "Kabara_TopScreen_853x640_20240223.png",0,0,0
37090 '************************************************************
37100 '1280x800ここまで
37110 '************************************************************
37120 else
37130 '****************************************************************************************************
37140 'WUXG(1920x1200)の時ここから
37150 '****************************************************************************************************
37160 gload Gazo$ + "Kabara_TopScreen20230618.png",0,0,0
37170 gload Gazo$ + "downscreen.png",0,0,800
37180 '****************************************************************************************************
37190 'WUXG(1920x1200)の時ここまで
37200 '****************************************************************************************************
37210 endif
37220 play Voice$ + "KabaraTop_Selection_20230721.mp3"
37230 sp_on 0,1:sp_on  1,0:sp_on 2,0:sp_on 3,0
37240 init"kb:4":No=0
37250 if ex_info$(1)<>"JP" then
37260 color rgb(255,255,255)
37270 print chr$(13)+chr$(13)+chr$(13)
37280 print "Please select a number" + chr$(13)
37290 print " :1.Numerology" + chr$(13)
37300 print " :2.Bird's Eye Grid" + chr$(13)
37310 print " :3.Compatibility Divination" + chr$(13)
37320 print " :4.Return to Top Screen" + chr$(13)
37330 color rgb(0,0,0)
37340 locate 1,15:print "1. Select Numerology"
37350 else
37360 if ((size(0)<=1280) and (size(1)<=800)) then
37370 '***************************************************************************************************
37380 '1280 x800 ここから
37390 '***************************************************************************************************
37400 color rgb(255,255,255):font FONT
37410 locate 1,5
37420 print "番号を選んでください" + chr$(13)
37430 locate 1,7
37440 print " :1.数秘術占い" + chr$(13)
37450 locate 1,10
37460 print " :2.バーズアイグリット" + chr$(13)
37470 locate 1,13
37480 print " :3.相性占い" + chr$(13)
37490 locate 1,16
37500 print " :4.トップ画面に戻る" + chr$(13)
37510 color rgb(0,0,0)
37520 locate 1,18:print "1.数秘術占いを選択"
37530 '***************************************************************************************************
37540 '1280 x800 ここまで
37550 '***************************************************************************************************
37560 else
37570 '****************************************************************************************************
37580 'WUXG(1920x1200)の時ここから
37590 '****************************************************************************************************
37600 color rgb(255,255,255):font FONT
37610 print chr$(13)+chr$(13)+chr$(13)
37620 print "番号を選んでください" + chr$(13)
37630 print " :1.数秘術占い" + chr$(13)
37640 print " :2.バーズアイグリット" + chr$(13)
37650 print " :3.相性占い" + chr$(13)
37660 print " :4.トップ画面に戻る" + chr$(13)
37670 color rgb(0,0,0)
37680 locate 1,15:print "1.数秘術占いを選択"
37690 '****************************************************************************************************
37700 'WUXG(1920x1200)の時ここまで
37710 '****************************************************************************************************
37720 endif
37730 endif
37740 Kabara_TopScreen2:
37750 y = 0:bg = 0:key$ = "":bg2 = 0
37760 while ((y <> 1) and (y <> -1) and (key$ <> chr$(31)) and (key$ <> chr$(30)) and (key$ <> chr$(13)) and (bg <> 2) and (bg2 <> 2))
37770 key$ = inkey$
37780 bg = strig(1)
37790 y = stick(1)
37800 bg2 = strig(0)
37810 pause 200
37820 wend
37830 '選択ボタン
37840 'カーソル下 　と　ジョイパッド　の下
37850 '****************************************************************************************************
37860 '英語パート ここから
37870 '****************************************************************************************************
37880 if ex_info$(1)<>"JP" then
37890 if ((y = 1) or (key$ = chr$(31))) then
37900 select case No
37910 case 2:
37920 No=3:sp_on 3,1:sp_on 1,0:sp_on 2,0:sp_on 0,0:sp_put 3,(X,Y+320),0,0:beep:pause 200:locate 1,15:print "                                    ":locate 1,15:print "4.Return to Top Screen":goto Kabara_TopScreen2:
37930 case 3:
37940 No=0:sp_on 0,1:sp_on 2,0:sp_on 1,0:sp_on 3,0:sp_put 0,(X,Y+20),0,0:beep:pause 200: locate 1,15:print "                                      ":locate 1,15:print "1.Select Numerology":goto Kabara_TopScreen2:
37950 case 0:
37960 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(X,Y+120),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.Select Bird's Eye Grid":goto Kabara_TopScreen2:
37970 case 1:
37980 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:sp_on 3,0:sp_put 2,(X,Y+220),0,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print"3.Select Compatibility Divination":goto Kabara_TopScreen2:
37990 end select
38000 endif
38010 '*****************************************************************************************************
38020 '英語パート ここまで
38030 '****************************************************************************************************
38040 else
38050 '****************************************************************************************************
38060 '日本語パート ここから
38070 '****************************************************************************************************
38080 if ((size(0) <= 1280) and (size(1) <= 800)) then
38090 '******************************************************************************************************
38100 '1280 x 800 日本語 ここから
38110 '*****************************************************************************************************
38120 if ((y = 1) or (key$ = chr$(31))) then
38130 select case No
38140 case 2:
38150 No=3:sp_on 3,1:sp_on 1,0:sp_on 2,0:sp_on 0,0:sp_put 3,(X,Y+320),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                    ":locate 1,18:print "4.トップ画面に戻るを選択":goto Kabara_TopScreen2:
38160 case 3:
38170 No=0:sp_on 0,1:sp_on 2,0:sp_on 1,0:sp_on 3,0:sp_put 0,(X,Y+20),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0): locate 1,18:print"                                      ":locate 1,18:print "1.数秘術占いを選択":goto Kabara_TopScreen2:
38180 case 0:
38190 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(X,Y+120),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                      ":locate 1,18:print "2.バーズアイグリッドを選択":goto Kabara_TopScreen2:
38200 case 1:
38210 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:sp_on 3,0:sp_put 2,(X,Y+220),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                              ":locate 1,18:print"3.相性占いを選択":goto Kabara_TopScreen2:
38220 end select
38230 endif
38240 'カーソル　上  or  ジョイパッド　上
38250 if ((y = -1) or (key$ = chr$(30))) then
38260 select case No
38270 case 0:
38280 No=3:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,1:sp_put 3,(X,Y+320),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                      ":locate 1,18:print "4.トップ画面に戻るを選択":goto Kabara_TopScreen2:
38290 case 1:
38300 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(X,Y+20),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                      ":locate 1,18:print "1.数秘術占いを選択":goto Kabara_TopScreen2:
38310 case 2:
38320 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(X,Y+120),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                      ":locate 1,18:print "2.バーズアイグリッドを選択":goto Kabara_TopScreen2:
38330 case 3:
38340 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(X,Y+220),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                       ":locate 1,18:print"3.相性占いを選択":goto Kabara_TopScreen2:
38350 end select
38360 endif
38370 '*****************************************************************************************************
38380 '1280 x800 ここまで
38390 '******************************************************************************************************
38400 else
38410 '******************************************************************************************************
38420 '1920x1280 ここから
38430 '******************************************************************************************************
38440 if ((y = 1) or (key$ = chr$(31))) then
38450 select case No
38460 case 2:
38470 No=3:sp_on 3,1:sp_on 1,0:sp_on 2,0:sp_on 0,0:sp_put 3,(X,Y+320),3,0:beep:pause 200:locate 1,15:print "                                    ":locate 1,15:print "4.トップ画面に戻るを選択":goto Kabara_TopScreen2:
38480 case 3:
38490 No=0:sp_on 0,1:sp_on 2,0:sp_on 1,0:sp_on 3,0:sp_put 0,(X,Y+20),0,0:beep:pause 200: locate 1,15:print"                                      ":locate 1,15:print "1.数秘術占いを選択":goto Kabara_TopScreen2:
38500 case 0:
38510 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(X,Y+120),1,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.バーズアイグリッドを選択":goto Kabara_TopScreen2:
38520 case 1:
38530 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:sp_on 3,0:sp_put 2,(X,Y+220),2,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print"3.相性占いを選択":goto Kabara_TopScreen2:
38540 end select
38550 endif
38560 'カーソル　上  or  ジョイパッド　上
38570 if ((y = -1) or (key$ = chr$(30))) then
38580 select case No
38590 case 0:
38600 No=3:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,1:sp_put 3,(X,Y+320),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "4.トップ画面に戻るを選択":goto Kabara_TopScreen2:
38610 case 1:
38620 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(X,Y+20),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.数秘術占いを選択":goto Kabara_TopScreen2:
38630 case 2:
38640 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(X,,Y+120),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.バーズアイグリッドを選択":goto Kabara_TopScreen2:
38650 case 3:
38660 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(X,Y+220),0,0:beep:pause 200:locate 1,15:print "                                       ":locate 1,15:print"3.相性占いを選択":goto Kabara_TopScreen2:
38670 end select
38680 endif
38690 '******************************************************************************************************
38700 '日本語 ここまで
38710 '******************************************************************************************************
38720 endif
38730 '******************************************************************************************************
38740 '1920x 1280 ここまで
38750 '******************************************************************************************************
38760 endif
38770 '決定ボタン
38780 'ジョイパッドの右　or  Enter key
38790 if ((bg = 2) or (key$ = chr$(13))) then
38800 select case No
38810 case 0:
38820 '1.数秘術占い
38830 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:goto Input_Seireki:
38840 case 3:
38850 '4.メイン画面にいく
38860 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_on 1,0:pause 200:goto Main_Screen:
38870 case 1:
38880 '2.バースアイグリッド
38890 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:goto Input_name1_Birdseye:
38900 case 2:
38910 '3.相性占い
38920 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:goto Kabara_Aishou_Top:
38930 end select
38940 endif
38950 if (bg2 = 2) then
38960 play "":pause 200
38970 play Voice$ + "Voice_Kabara_Top_20230621.mp3"
38980 goto Kabara_TopScreen2:
38990 endif
39000 '1.バースアイグリット　名入力
39010 Inputname1:
39020 cls 3:init"kb:4":
39030 '****************************************************************************************************
39040 'WUXG(1920x1200)の時ここから
39050 '****************************************************************************************************
39060 font FONT
39070 bg=0:key$="":y=0:No=-1:name1$="":i=1
39080 gload Gazo$ + "Selection.png",1,10,100
39090 'Line 1:☓
39100 'A:選択肢
39110 sp_def 15,(50,250),16,16
39120 'B:選択肢
39130 sp_def 16,(200,250),16,16
39140 'C:選択肢
39150 sp_def 17,(350,250),16,16
39160 'D:選択肢
39170 sp_def 18,(500,250),16,16
39180 'E:選択肢
39190 sp_def 19,(630,250),16,16
39200 'F:選択肢
39210 sp_def 20,(780,250),16,16
39220 'G:選択肢
39230 sp_def 21,(930,250),16,16
39240 'Line 2:☓
39250 'H:選択肢
39260 sp_def 22,(50,345),16,16
39270 'I:選択肢
39280 sp_def 23,(200,345),16,16
39290 'J:選択肢
39300 sp_def 24,(350,345),16,16
39310 'K:選択肢
39320 sp_def 25,(500,345),16,16
39330 'L:選択肢
39340 sp_def 26,(630,345),16,16
39350 'M:選択肢
39360 sp_def 27,(780,345),16,16
39370 'N:選択肢
39380 sp_def 28,(930,345),16,16
39390 'Line 3:☓
39400 'O:選択肢
39410 sp_def 29,(50,440),16,16
39420 'P:選択肢
39430 sp_def 30,(200,440),16,16
39440 'Q:選択肢
39450 sp_def 31,(350,440),16,16
39460 'R:選択肢
39470 sp_def 32,(500,440),16,16
39480 'S:選択肢
39490 sp_def 33,(630,440),16,16
39500 'T:選択肢
39510 sp_def 34,(780,440),16,16
39520 'U:選択肢
39530 sp_def 35,(930,440),16,16
39540 'Line 4:◯
39550 'V:選択肢
39560 sp_def 36,(50,535),16,16
39570 'W:選択肢
39580 sp_def 37,(200,535),16,16
39590 'X:選択肢
39600 sp_def 38,(350,535),16,16
39610 'Y:選択肢
39620 sp_def 39,(500,535),16,16
39630 'Z:選択肢
39640 sp_def 40,(630,535),16,16
39650 'Ok:選択肢
39660 sp_def 41,(780,535),16,16
39670 'sp_def 42,(930,535),16,16
39680 'Line 1
39690 'A
39700 sp_on 15,0
39710 'B
39720 sp_on 16,0
39730 'C
39740 sp_on 17,0
39750 'D
39760 sp_on 18,0
39770 'E
39780 sp_on 19,0
39790 'F
39800 sp_on 20,0
39810 'G
39820 sp_on 21,0
39830 'Line 1
39840 'Line 2
39850 'H
39860 sp_on 22,0
39870 'I
39880 sp_on 23,0
39890 'J
39900 sp_on 24,0
39910 'K
39920 sp_on 25,0
39930 'L
39940 sp_on 26,0
39950 'M
39960 sp_on 27,0
39970 'N
39980 sp_on 28,0
39990 'Line 2
40000 'Line 3
40010 'O
40020 sp_on 29,0
40030 'P
40040 sp_on 30,0
40050 'Q
40060 sp_on 31,0
40070 'R
40080 sp_on 32,0
40090 'S
40100 sp_on 33,0
40110 'T
40120 sp_on 34,0
40130 'U
40140 sp_on 35,0
40150 'Line 3
40160 'Line 4
40170 'V
40180 sp_on 36,0
40190 'W
40200 sp_on 37,0
40210 'X
40220 sp_on 38,0
40230 'Y
40240 sp_on 39,0
40250 'Z
40260 sp_on 40,0
40270 'Ok
40280 sp_on 41,1
40290 '****************************************************************************************************
40300 'WUXG(1920x1200)の時ここまで
40310 '****************************************************************************************************
40320 'Line 4
40330 'sp_on 42,1
40340 'Line 1
40350 'sp_put 15,(50,250),0,0
40360 'sp_put 16,(200,250),0,0
40370 'sp_put 17,(350,250),0,0
40380 'sp_put 18,(500,250),0,0
40390 'sp_put 19,(630,250),0,0
40400 'sp_put 20,(780,250),0,0
40410 'sp_put 21,(930,250),0,0
40420 'Line 2
40430 'sp_put 22,(50,345),0,0
40440 'sp_put 23,(200,345),0,0
40450 'sp_put 24,(350,345),0,0
40460 'sp_put 25,(500,345),0,0
40470 'sp_put 26,(630,345),0,0
40480 'sp_put 27,(780,345),0,0
40490 'sp_put 28,(930,345),0,0
40500 'Line 3
40510 'sp_put 29,(50,440),0,0
40520 'sp_put 30,(200,440),0,0
40530 'sp_put 31,(350,440),0,0
40540 'sp_put 32,(500,440),0,0
40550 'sp_put 33,(630,440),0,0
40560 'sp_put 34,(780,440),0,0
40570 'sp_put 35,(930,440),0,0
40580 'Line 4
40590 'sp_put 36,(50,535),0,0
40600 'sp_put 37,(200,535),0,0
40610 'sp_put 38,(350,535),0,0
40620 'sp_put 39,(500,535),0,0
40630 'sp_put 40,(630,535),0,0
40640 sp_put 41,(780,535),0,0
40650 'sp_put 42,(930,536),0,0
40660 gload Gazo$ + "Screen1.png",0,0,0
40670 color rgb(255,255,255)
40680 locate 1,3
40690 print "名前の姓をアルファベットで入力してください"
40700 locate 1,5
40710 print " A  B  C  D  E  F  G"
40720 locate 1,7
40730 print " H  I  J  K  L  M  N"
40740 locate 1,9
40750 print " O  P  Q  R  S  T  U"
40760 locate 1,11
40770 print " V  W  X  Y  Z":locate 17,11:color rgb(255,0,0):print "Ok"
40780 locate 1,15:color rgb(0,0,0)
40790 print "名前の姓:" + name1$
40800 select_name1:
40810 bg = 0:y = 0:key$ = "":y2=0:init"kb:4":
40820 '有効ボタン
40830 '1.決定ボタン(bg:2)
40840 '2.Enter Key$:chr$(13)
40850 '3.カーソル上 (chr$(31))
40860 '4.カーソル　左 (chr$(29))
40870 '5.ジョイパッド　上 (y:1)
40880 '6:ジョイパッド　左 (y2:-1)
40890 '7:ジョイパッド　下 (y:-1)
40900 while ((bg <> 2) and (key$ <> chr$(13)) and (y <> -1) and (y <> 1) and (key$ <> chr$(31)) and (y2 <> -1) and (key$ <> chr$(29)))
40910 key$ = inkey$
40920 'ジョイパッドの決定:bg
40930 bg = strig(1)
40940 y = stick(1)
40950 y2 = stick(0)
40960 pause 200
40970 wend
40980 '====================================
40990 'Birds Eye Grid 名前入力
41000 '入力スタイル　アルファベット入力
41010 'sp_on:　スプライトのオンオフ
41020 'sp_put :表示位置
41030 'No:ボタン番号
41040 '====================================
41050 'カーソルで下に行く
41060 if ((y=-1) or (key$=chr$(31))) then
41070 select case No
41080 '1.Ok ボタン
41090 'sp_on スプライトのオンオフ
41100 'sp_put スプライトを表示
41110 case -1:
41120 '1.アルファベット　入力ボタン
41130 '実装未完全なので終了
41140 'Ok → T ○ :No:20=T
41150 No=20:sp_on 41,0:sp_on 34,1:sp_put 34,(780,440),0,0:goto select_name1:
41160 'T  → M ○
41170 case 20:
41180 No = 13:sp_on 34,0:sp_on 27,1:sp_put 27,(780,345),0,0:goto select_name1:
41190 'M  →　F ○
41200 case 13:
41210 No = 6:sp_on 27,0:sp_on 20,1:sp_put 20,(780,250),0,0:goto select_name1:
41220 'F  → Ok
41230 case 6:
41240 No=-1:sp_on 20,0:sp_on 41,1:sp_put 41,(780,535),0,0:goto select_name1:
41250 end select
41260 endif
41270 '2.決定ボタン
41280 if ((key$ = chr$(13)) OR  (bg = 2)) then
41290 select case No
41300 case -1:
41310 'スプライトをOFFにする
41320 sp_on 41,0
41330 end select
41340 endif
41350 '3.カーソル　左
41360 if (key$ = chr$(29) or (y2 =-1)) then
41370 select case No
41380 'Line 4
41390 'Line 4
41400 '1.
41410 'Z:-1 :Ok ボタン
41420 'Ok → Z
41430 case -1:
41440 'Ok →　Z
41450 'Ok ボタン OFF,Z Button ON
41460 'No=26:Z
41470 No = 26:sp_on 41,0:sp_on 40,1:sp_put 40,(630,535),0,0:goto select_name1:
41480 '2.
41490 '26:Zボタン Z→ Y
41500 case 26:
41510 No=25:sp_on 40,0:sp_on 39,1:sp_put 39,(500,535),0,0:goto select_name1:
41520 '3.
41530 '25:Yボタン  Y → X
41540 case 25:
41550 No=24:sp_on 39,0:sp_on 38,1:sp_put 38,(350,535),0,0:goto select_name1:
41560 '4
41570 '24:Xボタン X → W
41580 case 24:
41590 No=23:sp_on 38,0:sp_on 37,1:sp_put 37,(200,535),0,0:goto select_name1:
41600 '23:Wボタン X → W
41610 '5
41620 case 23:
41630 '22:Vボタン W → V
41640 No=22:sp_on 37,0:sp_on 36,1:sp_put 36,(50,535),0,0:goto select_name1:
41650 case 22:
41660 '-1:V→ Ok
41670 No=-1:sp_on 36,0:sp_on 41,1:sp_put 41,(780,535),0,0:goto select_name1:
41680 'Line 3
41690 case 20:
41700 '33:T34  → S:33 :◯
41710 No=19:sp_on 34,0:sp_on 33,1:sp_put 33,(630,440),0,0:goto select_name1:
41720 case 19:
41730 '32:S:33 → R:32 :◯
41740 No=18:sp_on 33,0:sp_on 32,1:sp_put 32,(500,440),0,0:goto select_name1:
41750 case 18:
41760 '31:R:32 → Q:31 :◯
41770 No=17:sp_on 32,0:sp_on 31,1:sp_put 31,(350,440),0,0:goto select_name1:
41780 '30:O → P :◯
41790 case 17:
41800 '30:Q:31 → P:30 :◯
41810 No=16:sp_on 31,0:sp_on 30,1:sp_put 30,(200,440),0,0:goto select_name1:
41820 case 16:
41830 '29:P:30 → O:29 :◯
41840 No=15:sp_on 30,0:sp_on 29,1:sp_put 29,(50,440),0,0:goto select_name1:
41850 case 15:
41860 '28:O:29 → U:21  :◯
41870 'O:OFF,U:ON
41880 No=21:sp_on 29,0:sp_on 35,1:sp_put 35,(930,440),0,0:goto select_name1:
41890 '27:U:21 → T:20  :◯
41900 case 21:
41910 'U:OFF:T:ON
41920 No=20:sp_on 35,0:sp_on  34,1:sp_put 34,(780,440),0,0:goto select_name1:
41930 'Line 2
41940 '26:M:13 → L:12 : ○
41950 case 13:
41960 'M:OFF,L:ON
41970 No=12:sp_on 27,0:sp_on 26,1:sp_put 26,(630,345),0,0:goto select_name1:
41980 '25:L:12 → K:11 : ○
41990 case 12:
42000 No=11:sp_on 26,0:sp_on 25,1:sp_put 25,(500,345),0,0:goto select_name1:
42010 '24:K:11 → J:10 : ○
42020 case 11:
42030 No=10:sp_on 25,0:sp_on 24,1:sp_put 24,(350,345),0,0:goto select_name1:
42040 '23:J:10 → I:9  : ○
42050 case 10:
42060 No=9:sp_on 24,0:sp_on 23,1:sp_put 23,(200,345),0,0:goto select_name1:
42070 '22:I:9 → H:8    :○
42080 case 9:
42090 No=8:sp_on 23,0:sp_on 22,1:sp_put 22,(50,345),0,0:goto select_name1:
42100 '21:H:8 → N:14:   :○
42110 case 8:
42120 No=14:sp_on 22,0:sp_on 28,1:sp_put 28,(930,345),0,0:goto select_name1:
42130 '20:N:14 → M:13:   :○
42140 case 14:
42150 No=6:sp_on 28,0:sp_on 27,1:sp_put 27,(780,345),0,0:goto select_name1:
42160 '●.Line 1:
42170 '19:F:20 → E:19 : ☓
42180 'F:OFF,E:ON
42190 case 6:
42200 No = 5:sp_on 20,0:sp_on 19,1:sp_put 19,(630,250),0,0:goto select_name1:
42210 '18:E → D
42220 'E:OFF,D:ON
42230 case 5:
42240 No=4:sp_on 19,0:sp_on 18,1:sp_put 18,(500,250),0,0:goto select_name1:
42250 '17:D → C
42260 'D:OFF,C:ON
42270 case 4:
42280 No=3:sp_on 18,0:sp_on 17,1:sp_put 17,(350,250),0,0:goto select_name1:
42290 case 3:
42300 No=2:sp_on 17,0:sp_on 16,1:sp_put 16,(200,250),0,0:goto select_name1:
42310 case 2:
42320 No=1:sp_on 16,0:sp_on 15,1:sp_put 15,(50,250),0,0:goto select_name1:
42330 case 1:
42340 No=7:sp_on 15,0:sp_on 21,1:sp_put 21,(930,250),0,0:goto select_name1:
42350 case 7:
42360 No=6:sp_on 21,0:sp_on 20,1:sp_put 20,(780,250),0,0:goto select_name1:
42370 end select
42380 endif
42390 '上から下の方向
42400 if ((key$ = chr$(31)) or  (y = 1)) then
42410 select case No
42420 '●.1
42430 '1:A→H
42440 case 1:
42450 No=8:sp_on 15,0:sp_on 22,1:sp_put 22,(50,345),0,0:goto select_name1:
42460 '2:H→O
42470 case 8:
42480 No=15:sp_on 22,0:sp_on 29,1:sp_put 29,(50,440),0,0:goto select_name1:
42490 '3:O→V
42500 case 15:
42510 No=22:sp_on 29,0:sp_on 36,1:sp_put 36,(50,535),0,0:goto select_name1:
42520 '4:V→A
42530 case 22:
42540 No=1:sp_on 36,0:sp_on 15,1:sp_put 15,(50,250),0,0:goto select_name1:
42550 '●.2
42560 '5.B→I
42570 case 2:
42580 No=9:sp_on 16,0:sp_on 23,1:sp_put 23,(200,345),0,0:goto select_name1:
42590 '6.I→P
42600 case 9:
42610 No=16:sp_on 23,0:sp_on 30,1:sp_put 30,(200,440),0,0:goto select_name1:
42620 '7.P→W
42630 case 16:
42640 No=23:sp_on 30,0:sp_on 37,1:sp_put 37,(200,535),0,0:goto select_name1:
42650 '8.W→B
42660 case 23:
42670 No=2:sp_on 37,0:sp_on 16,1:sp_put 16,(200,250),0,0:goto select_name1:
42680 '●.3
42690 '9.C→J
42700 case 3:
42710 No=10:sp_on 17,0:sp_on 24,1:Sp_put 24,(350,345),0,0:goto select_name1:
42720 '10.J→Q
42730 case 10:
42740 No=17:sp_on 24,0:sp_on 31,1:sp_put 31,(350,440),0,0:goto select_name1:
42750 '11.Q→X
42760 case 17:
42770 No=24:sp_on 31,0:sp_on 38,1:sp_put 38,(350,535),0,0:goto select_name1:
42780 '12.X→C
42790 case 24:
42800 No=3:sp_on 38,0:sp_on 17,1:sp_put 17,(350,250),0,0:goto select_name1:
42810 '●.4
42820 '13.D→K
42830 case 4:
42840 No=11:sp_on 18,0:sp_on 25,1:sp_put 25,(500,345),0,0:goto select_name1:
42850 '14.K→R
42860 case 11:
42870 No=18:sp_on 25,0:sp_on 32,1:sp_put 32,(500,440),0,0:goto select_name1:
42880 '15.R→Y
42890 case 18:
42900 No=25:sp_on 32,0:sp_on 39,1:sp_put 39,(500,535),0,0:goto select_name1:
42910 '16.Y→D
42920 case 25:
42930 No=4:sp_on 39,0:sp_on 18,1:sp_put 18,(500,250),0,0:goto select_name1:
42940 '●.5
42950 '17.E→L
42960 case 5:
42970 No=12:sp_on 19,0:sp_on 26,1:sp_put 26,(630,345),0,0:goto select_name1:
42980 '18.L→S
42990 case 12:
43000 No=19:sp_on 26,0:sp_on 33,1:sp_put 33,(630,440),0,0:goto select_name1:
43010 '19.S→Z
43020 case 19:
43030 No=26:sp_on 33,0:sp_on 40,1:sp_put 40,(630,535),0,0:goto select_name1:
43040 '20.Z→E
43050 case 26:
43060 No=5:sp_on 40,0:sp_on 19,1:sp_put 19,(630,250),0,0:goto select_name1:
43070 '●.6
43080 '21.F→M
43090 case 6:
43100 No=13:sp_on 20,0:sp_on 27,1:sp_put 27,(780,345),0,0:goto select_name1:
43110 '22.M→T
43120 case 13:
43130 No=20:sp_on 27,0:sp_on 34,1:sp_put 34,(780,440),0,0:goto select_name1:
43140 '23.T→Ok
43150 case 20:
43160 No=-1:sp_on 34,0:sp_on 41,1:sp_PUT 41,(780,535),0,0:goto select_name1:
43170 '24.Ok→F
43180 case -1:
43190 No=6:sp_on 41,0:sp_on 20,1:sp_put 20,(780,250),0,0:goto select_name1:
43200 '●.7
43210 '25.G→N
43220 case 7:
43230 No=14:sp_on 21,0:sp_on 28,1:sp_put 28,(930,345),0,0:goto select_name1:
43240 '26.N→U
43250 case 14:
43260 No=21:sp_on 28,0:sp_on 35,1:sp_PUT 35,(930,440),0,0:goto select_name1:
43270 '27.U→G
43280 case 21:
43290 No=7:sp_on 35,0:sp_on 21,1:sp_put 21,(930,250),0,0:goto select_name1:
43300 end select
43310 endif
43320 '決定ボタン　で名前の姓に文字を追加。
43330 if (key$ = chr$(13) or bg = 2) then
43340 select case No
43350 'Okボタン
43360 case -1:
43370 goto Inputname2:
43380 'Aの文字
43390 case 1:
43400 'if len(n$)=0 then
43410 n$=String$(i,"A"):name1$=n$:locate 1,15:print "                       ":locate 1,15:print "名前の姓:" +name1$:i=i+1:
43420 'else
43430 'name1$=Mid$("A",i,i+1):locate 1,15:print "                                      ":locate 1,15:print "名前の姓:"+name1$:i=i+1
43440 'endif
43450 goto select_name1:
43460 case 2:
43470 n$=String$(i,"B"):name1$=n$:locate 1,15:print "                                     ":locate 1,15:print "名前の姓:"+name1$:i=i+1:goto select_name1:
43480 end select
43490 endif
43500 Input_name1_Birdseye:
43510 cls 3:init "kb:2":play "":font 48
43520 gload Gazo$ + "Input_Birtheye2.png",0,0,0
43530 if ex_info$(1)<>"JP" then
43540 play Voice$ + "Birdseyegrid_InputName1_20231120.mp3"
43550 color rgb(0,0,255)
43560 locate 1,2:print "Please enter your name in English"
43570 color rgb(0,0,0)
43580 locate 1,5:Input "Name (Surname):",name1$
43590 else
43600 '****************************************************************************************************
43610 '共通部分　ここから
43620 '****************************************************************************************************
43630 play Voice$ + "Birdseyegrid_InputName1_20231120.mp3"
43640 color rgb(0,0,255)
43650 locate 1,2:print "名前をアルファベットで入れてください"
43660 color rgb(0,0,0)
43670 locate 1,5:Input "名前（姓の部分）:",name1$
43680 '****************************************************************************************************
43690 '共通部分　ここまで
43700 '****************************************************************************************************
43710 endif
43720 '27.U→G
43730 'locate 1,5:print "Hit any key"
43740 n1 = len(name1$)
43750 if (n1 < 11) then
43760 for i=1 to n1
43770 buf_name1$(i-1) = Mid$(ucase$(name1$),i,1)
43780 next i
43790 endif
43800 goto Inputname2:
43810 '2.グリッドアイ　姓の入力
43820 'end
43830 Inputname2:
43840 cls 3:init"kb:2":font 48:play ""
43850 gload Gazo$ + "Input_Birtheye1.png",0,0,0
43860 if ex_info$(1)<>"JP" then
43870 play Voice$ + "Birdseyegrid_InputName2_20231120.mp3"
43880 color rgb(0,0,255)
43890 locate 1,2:print "Please enter your name in English"
43900 color rgb(0,0,0)
43910 locate 1,5:Input "Name (First name):",name2$
43920 n2 = len(name2$)
43930 for i=1 to n2
43940 buf_name2$(i-1) = Mid$(ucase$(name2$),i,1)
43950 next i
43960 else
43970 '****************************************************************************************************
43980 '共通部分　ここから
43990 '****************************************************************************************************
44000 play Voice$ + "Birdseyegrid_InputName2_20231120.mp3"
44010 color rgb(0,0,255)
44020 locate 1,2:print "名前をアルファベットで入れてください"
44030 color rgb(0,0,0)
44040 locate 1,5:Input "名前(名の部分):",name2$
44050 n2 = len(name2$)
44060 for i=1 to n2
44070 buf_name2$(i-1) = Mid$(ucase$(name2$),i,1)
44080 next i
44090 '****************************************************************************************************
44100 '共通部分　ここまで
44110 '****************************************************************************************************
44120 endif
44130 '****************************************************************************************************
44140 '計算領域　ここから
44150 '****************************************************************************************************
44160 Complate:
44170 'name1
44180 for i=0 to 25
44190 for n=1 to len(name1$)
44200 if (buf_chart$(i,0) = buf_name1$(n-1)) then
44210 b = val(buf_chart$(i,1))
44220 buffer(b-1) = buffer(b-1) + 1
44230 endif
44240 next n
44250 next i
44260 'name2
44270 for i=0 to 25
44280 for n=1 to len(name2$)
44290 if (buf_chart$(i,0) = buf_name2$(n-1)) then
44300 c = val(buf_chart$(i,1))
44310 buffer(c - 1) = buffer(c - 1) + 1
44320 endif
44330 next n
44340 next i
44350 '****************************************************************************************************
44360 '計算領域 ここまで
44370 '****************************************************************************************************
44380 '****************************************************************************************************
44390 '結果表示領域
44400 '****************************************************************************************************
44410 Result_Birtheye1:
44420 cls 3:init"kb:4":No=0:play "":'音を止める
44430 '****************************************************************************************************
44440 '1280x800　ここから
44450 '****************************************************************************************************
44460 if ((size(0) <= 1280) and (size(1) <= 800)) then
44470 gload Gazo$ + Gazo_WXGA$ + "Result_Birtheye1_907x640_20240223.png",0,0,0
44480 '****************************************************************************************************
44490 '1280x800　ここまで
44500 '****************************************************************************************************
44510 else
44520 '****************************************************************************************************
44530 '1920x1280　ここから
44540 '****************************************************************************************************
44550 gload Gazo$ + "Result_Birtheye1_20230630.png",0,0,0
44560 gload Gazo$ + "downscreen.png",0,0,800
44570 '****************************************************************************************************
44580 '1920x1280　ここまで
44590 '****************************************************************************************************
44600 endif
44610 play Voice$ + "Result_Birdseyegrid_20231120.mp3"
44620 color rgb(255,255,255)
44630 '****************************************************************************************************
44640 '1280x800　ここから
44650 '****************************************************************************************************
44660 if ((size(0) <= 1280) and (size(1) <= 800)) then
44670 '1の表示
44680 locate 2,12:
44690 print buffer(0);
44700 '2の表示
44710 locate 2,7:
44720 print buffer(1);
44730 '3の表示
44740 locate 2,3:
44750 print buffer(2);
44760 '4の表示
44770 locate 8,12:
44780 print buffer(3);
44790 '5の表示
44800 locate 8,7:
44810 print buffer(4);
44820 '6の表示
44830 locate 8,3:
44840 print buffer(5);
44850 '7の表示
44860 locate 13,12:
44870 print buffer(6);
44880 '8の表示
44890 locate 13,7:
44900 print buffer(7);
44910 '9の表示
44920 locate 13,3:
44930 print buffer(8);
44940 '****************************************************************************************************
44950 '1280x800　ここまで
44960 '****************************************************************************************************
44970 else
44980 '1の表示
44990 locate 3,14:
45000 print buffer(0);
45010 '2の表示
45020 locate 3,9:
45030 print buffer(1);
45040 '3の表示
45050 locate 3,5:
45060 print buffer(2);
45070 '4の表示
45080 locate 10,14:
45090 print buffer(3);
45100 '5の表示
45110 locate 10,9:
45120 print buffer(4);
45130 '6の表示
45140 locate 10,5:
45150 print buffer(5);
45160 '7の表示
45170 locate 15,14:
45180 print buffer(6);
45190 '8の表示
45200 locate 15,9:
45210 print buffer(7);
45220 '9の表示
45230 locate 15,5:
45240 print buffer(8);
45250 endif
45260 'name を大文字に変換
45270 locate 5,3:print ucase$(name1$ + name2$)
45280 color rgb(0,0,0)
45290 'bg:右のボタン  ,bg2:左のボタン
45300 if ex_info$(1)<>"JP" then
45310 color rgb(255,255,255)
45320 'print "Left circle: Main Screen, Right circle: Open Menu"
45330 else
45340 'locate 0,15:print "左の丸:メイン画面,右の丸：メニューを開く"
45350 endif
45360 bg=0:key$="":bg2=0
45370 while ((bg <> 2) and (key$ <> chr$(13)) and (bg2 <> 2))
45380 'Enterと決定ボタン
45390 key$ = inkey$
45400 '右ボタン:1
45410 bg = strig(1)
45420 '左の丸ボタン:0
45430 bg2=strig(0)
45440 pause 200
45450 wend
45460 if ((bg=2) or (key$=chr$(13))) then
45470 'データーをクリアしてトップ画面に行く
45480 'for i=0 to 8
45490 'buffer(i)=0
45500 'next i
45510 'for n=0 to 9
45520 'buf_name1$(n) = ""
45530 'buf_name2$(n) = ""
45540 'next n
45550 'Topに行く
45560 'goto Main_Screen:
45570 'メニューを開く
45580 'goto BirdsEye_Result2:
45590 'Menu(ui_select) リストに飛ぶ
45600 goto Result_Birtheye_List1:
45610 endif
45620 if ((bg2=2) or (key$="")) then
45630 'データーをクリアする
45640 for i=0 to 8
45650 buffer(i)=0
45660 next i
45670 for n=0 to 9
45680 buf_name1$(n)=""
45690 buf_name2$(n)=""
45700 next n
45710 goto Main_Screen:
45720 endif
45730 'goto Result_Birtheye1:
45740 'Result_Birtheye2:
45750 'cls 3:color rgb(255,255,255)
45760 'end
45770 'Memory 消去
45780 '****************************************************************************************************
45790 '
45800 '結果表示領域　ここまで
45810 '****************************************************************************************************
45820 '横のフォーカスライン
45830 BirdsEye_Result2:
45840 cls 3:init"kb:4":No = 0:bg = 0:key$ = "":bg2 = 0
45850 if ((buffer(2) > 0) and (buffer(5) > 0) and  (buffer(8) >  0)) then
45860 Forcus1_buffer$(2)="○"
45870 else
45880 Forcus1_buffer$(2)="☓"
45890 endif
45900 if ((buffer(1) > 0 ) and  (buffer(4) > 0) and   (buffer(7) > 0)) then
45910 Forcus1_buffer$(1)="○"
45920 else
45930 Forcus1_buffer$(1) = "☓"
45940 endif
45950 if ((buffer(0) > 0) and (buffer(3) > 0) and (buffer(6) > 0)) then
45960 Forcus1_buffer$(0)="○"
45970 else
45980 Forcus1_buffer$(0)="☓"
45990 endif
46000 gload Gazo$ + "Screen1.png",0,0,0
46010 if ex_info$(1)<>"JP" then
46020 color rgb(255,0,0):
46030 locate 1,1
46040 print "Bird's Eye Grid (Focus Line 1)"
46050 color rgb(255,255,255)
46060 locate 1,3:
46070 print "●. Horizontal Focus Line"
46080 locate 1,5
46090 print "1. Sharp Line:"+Forcus1_buffer$(2)
46100 locate 1,7
46110 print "2. Mediator Line:"+Forcus1_buffer$(1)
46120 locate 1,9
46130 print "3. Steady Line:"+Forcus1_buffer$(0)
46140 color rgb(0,0,0)
46150 locate 0,15:print "Right circle: Next, Left circle: Diagnose again "
46160 else
46170 color rgb(255,0,0):
46180 locate 1,1
46190 print "バーズアイグリッド(フォーカスライン1)"
46200 color rgb(255,255,255)
46210 locate 1,3:
46220 print "●.横のフォーカスライン"
46230 locate 1,5
46240 print "1.切れ者ライン:"+Forcus1_buffer$(2)
46250 locate 1,7
46260 print "2.調停者ライン:"+Forcus1_buffer$(1)
46270 locate 1,9
46280 print "3.しっかり者ライン:"+Forcus1_buffer$(0)
46290 color rgb(0,0,0)
46300 locate 0,15:print "右の丸:次へ,左の丸：もう一度診断 "
46310 endif
46320 while (key$ <> chr$(13) and bg <> 2 and bg2 <> 2 )
46330 key$ = inkey$
46340 bg = strig(1)
46350 bg2 = strig(0)
46360 pause 200
46370 wend
46380 if ((bg=2) or (key$=chr$(13))) then
46390 goto BirdsEye_Result3:
46400 endif
46410 if (bg2=2) then
46420 for i=0 to 8
46430 buffer(i)=0
46440 next i
46450 goto Main_Screen:
46460 endif
46470 BirdsEye_Result3:
46480 cls 3:init"kb:4":bg=0:bg2=0:key$="":No=0
46490 if ((buffer(2) > 0) and (buffer(1) > 0) and  (buffer(0) >  0)) then
46500 Forcus2_buffer$(2)="○"
46510 else
46520 Forcus2_buffer$(2)="☓"
46530 endif
46540 if ((buffer(5) > 0 ) and  (buffer(4) > 0) and   (buffer(3) > 0)) then
46550 Forcus2_buffer$(1)="○"
46560 else
46570 Forcus2_buffer$(1) = "☓"
46580 endif
46590 if ((buffer(8) > 0) and (buffer(7) > 0) and (buffer(6) > 0)) then
46600 Forcus2_buffer$(0)="○"
46610 else
46620 Forcus2_buffer$(0)="☓"
46630 endif
46640 gload Gazo$ + "Screen1.png",0,0,0
46650 if ex_info$(1)<>"JP" then
46660 color rgb(255,0,0):
46670 locate 1,1
46680 print "Bird's Eye Grid (Focus Line 2)"
46690 color rgb(255,255,255)
46700 locate 1,3
46710 print "●. Vertical Focus Line"
46720 locate 1,5
46730 print "1. Expresser Line:" + Forcus2_buffer$(2)
46740 locate 1,7
46750 print "2. Commander Line:" + Forcus2_buffer$(1)
46760 locate 1,9
46770 print "3. Leader Line:" + Forcus2_buffer$(0)
46780 color rgb(0,0,0)
46790 locate 0,15:print "Right circle: Next, Left circle: Retest "
46800 else
46810 '****************************************************************************************************
46820 'WUXG(1920x1200)の時ここから
46830 '****************************************************************************************************
46840 color rgb(255,0,0):
46850 locate 1,1
46860 print "バーズアイグリッド(フォーカスライン2)"
46870 color rgb(255,255,255)
46880 locate 1,3
46890 print "●.縦のフォーカスライン"
46900 locate 1,5
46910 print "1.表現者ライン:" + Forcus2_buffer$(2)
46920 locate 1,7
46930 print "2.司令塔ライン:" + Forcus2_buffer$(1)
46940 locate 1,9
46950 print "3.指導者ライン:" + Forcus2_buffer$(0)
46960 color rgb(0,0,0)
46970 locate 0,15:print "右の丸:次へ,左の丸：もう一度診断 "
46980 '****************************************************************************************************
46990 'WUXG(1920x1200)の時ここから
47000 '****************************************************************************************************
47010 endif
47020 while ((key$ <> chr$(13)) and (bg <> 2) and (bg2 <> 2))
47030 key$ = inkey$
47040 bg = strig(1)
47050 bg2 = strig(0)
47060 pause 200
47070 wend
47080 if ((bg = 2) or (key$ = chr$(13))) then
47090 goto BirdsEye_Result4:
47100 endif
47110 if (bg2=2) then
47120 for i=0 to 8
47130 buffer(i)=0
47140 next i
47150 goto Main_Screen:
47160 endif
47170 BirdsEye_Result4:
47180 cls 3:init"kb:4":bg=0:bg2=0:key$="":No=0
47190 if ((buffer(0) > 0) and (buffer(4) > 0) and  (buffer(8) >  0)) then
47200 Forcus3_buffer$(1) = "○"
47210 else
47220 Forcus3_buffer$(1) = "☓"
47230 endif
47240 if ((buffer(2) > 0 ) and  (buffer(4) > 0) and   (buffer(6) > 0)) then
47250 Forcus3_buffer$(0) = "○"
47260 else
47270 Forcus3_buffer$(0) = "☓"
47280 endif
47290 gload Gazo$ + "Screen1.png",0,0,0
47300 if ex_info$(1)<>"JP" then
47310 color rgb(255,0,0):
47320 locate 1,1
47330 print "Bird's Eye Grid (Focus Line 3)"
47340 color rgb(255,255,255)
47350 locate 1,3:
47360 print "●. Diagonal Focus Line"
47370 locate 1,5
47380 print "1. Success Line:"+Forcus3_buffer$(1)
47390 locate 1,7
47400 print "2. Celebrity Line:"+Forcus3_buffer$(0)
47410 color rgb(0,0,0)
47420 locate 0,15:print "Right circle: Top Menu, Left circle: Top Diagnosis"
47430 else
47440 '****************************************************************************************************
47450 'WUXG(1920x1200)の時ここから
47460 '****************************************************************************************************
47470 color rgb(255,0,0):
47480 locate 1,1
47490 print "バーズアイグリッド(フォーカスライン3)"
47500 color rgb(255,255,255)
47510 locate 1,3:
47520 print "●.斜めのフォーカスライン"
47530 locate 1,5
47540 print "1.成功者ライン:"+Forcus3_buffer$(1)
47550 locate 1,7
47560 print "2.セレブライン:"+Forcus3_buffer$(0)
47570 color rgb(0,0,0)
47580 locate 0,15:print "右の丸:トップメニュー,左の丸：診断トップ "
47590 '*************************************************************************************************
47600 'WUXG(1920x1200)の時ここまで
47610 '*************************************************************************************************
47620 endif
47630 while ((key$ <> chr$(13)) and (bg <> 2) and (bg2 <> 2))
47640 key$ = inkey$
47650 bg = strig(1)
47660 bg2 = strig(0)
47670 pause 200
47680 wend
47690 if ((bg=2) or (key$=chr$(13))) then
47700 goto Result_Birtheye1:
47710 endif
47720 if (bg2=2) then
47730 'データークリア
47740 for i=0 to 8
47750 buffer(i) = 0
47760 next i
47770 goto Main_Screen:
47780 endif
47790 References1:
47800 cls 3:key$ = "":bg = 0:play "":
47810 font 48-8
47820 if ((size(0) <= 1280) and (size(1) <= 800)) then
47830 gload Gazo$ + Gazo_WXGA$ +  "Reference1_864x640_20240219.png",0,0,0
47840 else
47850 gload Gazo$ + "Reference1_20230703.png",0,0,0
47860 gload Gazo$ + "downscreen.png",0,0,800
47870 endif
47880 if ex_info$(1)<>"JP" then
47890 print chr$(13)+chr$(13)+chr$(13)
47900 color rgb(0,0,255)
47910 print "・Title: 名前で運命のすべてがわかる　数秘術" + chr$(13)
47920 print "・Author: Carol Adrienne, Ph.D" + chr$(13)
47930 print "・Publisher: Gento-sha" + chr$(13)
47940 print "・Website: www.carolAdrienne.jp/" + chr$(13)
47950 print "・ISBN: 978-4-344-01394-0" + chr$(13)
47960 print "・Price: 1500 yen + tax" + chr$(13)
47970 color rgb(255,255,255)
47980 locate 1,18
47990 print "Right joystick: Next"
48000 else
48010 '****************************************************************************************************
48020 '(1200x800)の時ここから
48030 '****************************************************************************************************
48040 if ((size(0)<=1280) and (size(1)<=800)) then
48050 font FONT
48060 color rgb(0,0,255)
48070 locate 1,5:
48080 print "・Title:名前で運命のすべてがわかる　数秘術" + chr$(13)
48090 locate 1,7:
48100 print "・Author:carol Adrinne,PhD"+chr$(13)
48110 locate 1,9:
48120 print "・出版社:幻冬舎" + chr$(13)
48130 locate 1,11:
48140 print "・HP:www.carolAdrienne.jp/"+chr$(13)
48150 locate 1,13:
48160 print "・ISBN:978-4-344-01394-0"+chr$(13)
48170 locate 1,15
48180 print "・定価:1500円 + 税"+chr$(13)
48190 color rgb(255,255,255)
48200 locate 1,18
48210 print "ジョイパッド右：次へ"
48220 '****************************************************************************************************
48230 '(1200x800)の時ここまで
48240 '****************************************************************************************************
48250 else
48260 '****************************************************************************************************
48270 'WUXG(1920x1200)の時ここから
48280 '****************************************************************************************************
48290 font FONT
48300 print chr$(13)+chr$(13)+chr$(13)
48310 color rgb(0,0,255)
48320 print "・Title:名前で運命のすべてがわかる　数秘術" + chr$(13)
48330 print "・Author:carol Adrinne,PhD"+chr$(13)
48340 print "・出版社:幻冬舎" + chr$(13)
48350 print "・HP:www.carolAdrienne.jp/"+chr$(13)
48360 print "・ISBN:978-4-344-01394-0"+chr$(13)
48370 print "・定価:1500円 + 税"+chr$(13)
48380 color rgb(255,255,255)
48390 locate 1,18
48400 print "ジョイパッド右：次へ"
48410 '****************************************************************************************************
48420 'WUXG(1920x1200)の時ここまで
48430 '****************************************************************************************************
48440 endif
48450 endif
48460 while (key$ <> chr$(13) and bg <> 2)
48470 bg = strig(1)
48480 key$ = inkey$
48490 pause 200
48500 wend
48510 '
48520 if ((bg = 2) or (key$ = chr$(13))) then
48530 pause 200:goto References2:
48540 endif
48550 'ユダヤの秘儀 カバラ大占術
48560 References2:
48570 cls 3:play "":bg = 0:key$ = ""
48580 if ((size(0)<=1280) and (size(1)<=800)) then
48590 gload Gazo$ + Gazo_WXGA$ +  "Reference2_864x640_20240219.png",0,0,0
48600 else
48610 gload Gazo$ + "Reference2_20230703.png",0,0,0
48620 gload Gazo$ + "downscreen.png",0,0,800
48630 endif
48640 '参考文献２
48650 'カバラ大占術
48660 if ex_info$(1)<>"JP" then
48670 print chr$(13) + chr$(13) + chr$(13)
48680 color  rgb(0,0,255):font 48-8
48690 locate 1,3
48700 print "・Title: ユダヤの秘儀 大占術占術" + chr$(13)
48710 print "・Author: Hironari Asano" + chr$(13)
48720 print "・Publisher: NON BOOK" + chr$(13)
48730 print "・ISBN: 4-396-10364-6" + chr$(13)
48740 print "・Price: 829 yen + tax"
48750 color rgb(255,255,255)
48760 locate 1,18
48770 print "Right joystick: Return to top"
48780 else
48790 '****************************************************************************************************
48800 '(1200x800)の時 ここから
48810 '****************************************************************************************************
48820 if ((size(0)<=1280) and (size(1)<=800)) then
48830 font FONT
48840 color  rgb(0,0,255):
48850 locate 1,5:print "・Title:ユダヤの秘儀 大占術占術" + chr$(13)
48860 locate 1,7:print "・著者：浅野 八郎" + chr$(13)
48870 locate 1,9:print "・出版社:NON BOOK" + chr$(13)
48880 locate 1,11:print "・ISBN:4-396-10364-6" + chr$(13)
48890 locate 1,13:print "・定価:829円 + 税"
48900 color rgb(255,255,255)
48910 locate 1,18
48920 print "ジョイパッド右：トップへ行く"
48930 '****************************************************************************************************
48940 '(1200x800)の時 ここまで
48950 '****************************************************************************************************
48960 else
48970 '****************************************************************************************************
48980 'WUXG(1920x1200)の時ここから
48990 '****************************************************************************************************
49000 color  rgb(0,0,255):font FONT
49010 print chr$(13) + chr$(13) + chr$(13)
49020 locate 1,3
49030 print "・Title:ユダヤの秘儀 大占術占術" + chr$(13)
49040 print "・著者：浅野　八郎" + chr$(13)
49050 print "・出版社:NON BOOK" + chr$(13)
49060 print "・ISBN:4-396-10364-6" + chr$(13)
49070 print "・定価:829円 + 税"
49080 color rgb(255,255,255)
49090 locate 1,18
49100 print "ジョイパッド右：トップへ行く"
49110 '****************************************************************************************************
49120 'WUXG(1920x1200)の時ここまで
49130 '****************************************************************************************************
49140 endif
49150 endif
49160 while ((key$ <> chr$(13)) and (bg <> 2))
49170 bg = strig(1)
49180 key$ = inkey$
49190 pause 200
49200 wend
49210 if ((bg = 2) or (key$ = chr$(13))) then
49220 pause 200:goto Main_Screen:
49230 endif
49240 end
49250 '1.数秘術　トップ画面
49260 Kabara_First_Top:
49270 cls 3:color rgb(255,255,255):play ""
49280 gload Gazo$ + "Kabara_First_Top_20230710.png",0,0,0
49290 gload Gazo$ + "downscreen.png",0,0,800
49300 No=0:init"kb:4"
49310 Play Voice$ + "KabaraTop_Selection_20230721.mp3"
49320 if ex_info$(1)<>"JP" then
49330 print chr$(13);chr$(13)
49340 color rgb(255,255,255)
49350 locate 3,4:No=0
49360 print "Please select a number" + chr$(13)
49370 print " :1. Numerology" + chr$(13)
49380 print " :2. Return to the top screen" + chr$(13)
49390 color rgb(0,0,0)
49400 sp_on 0,1
49410 locate 1,15:print "1. Select Numerology"
49420 else
49430 '****************************************************************************************************
49440 'WUXG(1920x1200)の時ここから
49450 '****************************************************************************************************
49460 print chr$(13);chr$(13)
49470 color rgb(255,255,255)
49480 locate 3,4:No=0
49490 print "番号選んでください" + chr$(13)
49500 print " :1.数秘術占い" + chr$(13)
49510 print " :2.トップ画面に戻る" + chr$(13)
49520 color rgb(0,0,0)
49530 sp_on 0,1
49540 locate 1,15:print "1.数秘術番号を求めるを選択"
49550 '****************************************************************************************************
49560 'WUXG(1920x1200)の時ここまで
49570 '****************************************************************************************************
49580 endif
49590 'KeyBord:true
49600 'Joy Pad:true
49610 '上、下:true
49620 '
49630 'ｂｇ：決定ボタン
49640 'カーソル　上
49650 'カーソル　下
49660 Kabara_First_Top2:
49670 key$ = "":bg = 0:y = 0:
49680 while (((key$ <> chr$(13)) and (key$ <> chr$(30)) and (key$ <> chr$(31)) and (bg <> 2) and (y <> 1) and (y <> -1)))
49690 key$ = inkey$
49700 bg = strig(1)
49710 y = stick(1)
49720 'PauseでCPUを休める
49730 pause 5
49740 wend
49750 '1.カーソル　下 処理 chr$(31)
49760 'カーソル　下
49770 if ex_info$(1) <> "JP" then
49780 if ((key$ = chr$(31)) or (y = 1)) then
49790 select case No
49800 '
49810 case 1:
49820 No = 0:sp_on 0,1:sp_on 2,0:sp_on 3,0:sp_on 1,0:pause 200:locate 1,15:print "                                       ":locate 1,15:print "1. Select Numerology":goto Kabara_First_Top2:
49830 case 0:
49840 No=1:sp_on 1,1:sp_on 0,0:sp_on 3,0:sp_on 2,0:pause 200:locate 1,15:print "                                              ":locate 1,15:print "2. Return to the top screen":goto Kabara_First_Top2:
49850 'case 2:
49860 '       No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print "                                              ":locate 1,15:print "1. Select Numerology Number":goto Kabara_First_Top2:
49870 end select
49880 endif
49890 else
49900 if ((key$ = chr$(31)) or (y = 1)) then
49910 select case No
49920 '
49930 case 1:
49940 No = 0:sp_on 0,1:sp_on 2,0:sp_on 3,0:sp_on 1,0:pause 200:locate 1,15:print "                                       ":locate 1,15:print "1.数秘術占いを選択":goto Kabara_First_Top2:
49950 case 0:
49960 No=1:sp_on 1,1:sp_on 0,0:sp_on 3,0:sp_on 2,0:pause 200:locate 1,15:print "                                              ":locate 1,15:print "2.トップ画面に戻るを選択":goto Kabara_First_Top2:
49970 'case 2:
49980 '       No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print "                                              ":locate 1,15:print "1.数秘術番号を求めるを選択":goto Kabara_First_Top2:
49990 end select
50000 endif
50010 '2.カーソル　上 処理 chr$(30)
50020 if ((key$ = chr$(30)) or (y = -1)) then
50030 select case No
50040 case 0:
50050 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:pause 200:locate 1,15:Print "                                       ":locate 1,15:print "2.トップ画面に戻るを選択":goto Kabara_First_Top2:
50060 case 1:
50070 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:PRINT"                                       ":locate 1,15:print "1.数秘術占いを選択":goto Kabara_First_Top2:
50080 'case 2:
50090 '      No=1:sp_on 0,0:sp_on 2,0:sp_on 1,1:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.数秘術の相性占いを選択":goto Kabara_First_Top2:
50100 end select
50110 endif
50120 endif
50130 '3.決定 処理  bg:2 or Enter key:chr$(13)
50140 if ((bg = 2) or (key$ = chr$(13))) then
50150 select case No
50160 case 0:
50170 sp_on 0,0:sp_on 1,0:sp_on 2,0:No=0: 'goto Input_Seireki:
50180 goto Kabara_TopScreen:
50190 'case 1:
50200 '    sp_on 0,0:sp_on 1,0:sp_on 2,0:No=0:goto Kabara_Aishou_Top:
50210 case 1:
50220 sp_on 0,0:sp_on 1,0:sp_on 2,0:No=0:goto Main_Screen:
50230 end select
50240 endif
50250 '
50260 'Kabara 相性占い トップ画面
50270 Kabara_Aishou_Top:
50280 cls 3:y=0:key$="":bg=0:No=0
50290 play ""
50300 gload Gazo$ + "Kabara_Aishou_Top_20230717.png",0,0,0
50310 gload Gazo$ + "downscreen.png",0,0,800
50320 if ex_info$(1)<>"JP" then
50330 play Voice$ + "Kabara_Aishou_TopScreen_20230721.mp3"
50340 print chr$(13) + chr$(13)
50350 locate 0,4:color rgb(255,255,255)
50360 print "Please select a number" + chr$(13)
50370 print " :1. Compatibility fortune-telling ...." + chr$(13)
50380 print " :2. Business compatibility fortune-telling" + chr$(13)
50390 print " :3. Return to the top screen" + chr$(13)
50400 sp_on 0,1:sp_on 1,0:sp_on 2,0
50410 color rgb(0,0,0)
50420 locate 1,15:print "1. Select compatibility fortune-telling of two men and women"
50430 else
50440 play Voice$ + "Kabara_Aishou_TopScreen_20230721.mp3"
50450 '****************************************************************************************************
50460 'WUXG(1920x1200)の時ここから
50470 '****************************************************************************************************
50480 print chr$(13) + chr$(13)
50490 locate 0,4:color rgb(255,255,255)
50500 'print "Ok"
50510 '
50520 print "番号を選んでください" + chr$(13)
50530 print " :1.男女2人の相性占い(実装不完全)" + chr$(13)
50540 print " :2.ビジネスの相性占い" + chr$(13)
50550 print " :3.トップ画面に戻る" + chr$(13)
50560 sp_on 0,1:sp_on 1,0:sp_on 2,0
50570 color rgb(0,0,0)
50580 locate 1,15:print "1.男女2人の相性占いを選択"
50590 '****************************************************************************************************
50600 'WUXG(1920x1200)の時ここまで
50610 '****************************************************************************************************
50620 endif
50630 Kabara_Aishou_Top2:
50640 key$ = "":y = 0:bg = 0:
50650 while ((key$ <> chr$(13)) and (y <> 1) and (y <> -1) and (bg <> 2) and (key$ <> chr$(30)) and (key$ <> chr$(31)))
50660 'ジョイパッド(右) ,十字キー (上下)
50670 'ジョイパッドの右のボタン bg = 2(ジョイパッド右：決定　)、Enter(chr$(13):（決定）)
50680 y = stick(1)
50690 key$ = inkey$
50700 bg = strig(1)
50710 pause 200
50720 wend
50730 'カーソル　下 or 十字キー　下
50740 if ex_info$(1)<>"JP" then
50750 if ((key$ = chr$(31)) or (y = 1)) then
50760 select case No
50770 'Option change 1 - 2
50780 'case 0 1. Compatibility fortune-telling => 2. Business compatibility fortune-telling
50790 'ok
50800 case 0:
50810 No = 1:sp_on 1,1:sp_on 2,0:sp_on 0,0:pause 200:locate 1,15:print "                                                                               ":locate 1,15:print "2. Select business compatibility fortune-telling":goto Kabara_Aishou_Top2:
50820 'Option change 2 - 3
50830 case 1:
50840 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:print "                                       ":locate 1,15:print "3. Select return to the top screen":locate 1,16:goto Kabara_Aishou_Top2:
50850 'Release time case 2 comment release
50860 case 2:
50870 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1. Select compatibility fortune-telling of two men and women":goto Kabara_Aishou_Top2:
50880 case else:
50890 goto Kabara_Aishou_Top2:
50900 end select
50910 endif
50920 if ((key$ = chr$(30)) or (y = -1)) then
50930 select case No
50940 case 0:
50950 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:locate 1,15:print "                                       ":locate 1,15:print " :3. Return to the top screen" :goto Kabara_Aishou_Top2:
50960 case 1:
50970 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print"                                       ":locate 1,15:print " :1. Compatibility fortune-telling...." :goto Kabara_Aishou_Top2:
50980 case 2:
50990 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print " :2. Business compatibility fortune-telling":goto Kabara_Aishou_Top2:
51000 case else:
51010 goto Kabara_Aishou_Top2:
51020 end select
51030 endif
51040 else
51050 if ((key$ = chr$(31)) or (y = 1)) then
51060 select case No
51070 '選択肢　1 - 2に変更
51080 'case 0 1.男女の相性占い => 2.ビジネスの相性占い
51090 'ok
51100 case 0:
51110 No = 1:sp_on 1,1:sp_on 2,0:sp_on 0,0:pause 200:locate 1,15:print "                                                                               ":locate 1,15:print "2.ビジネスの相性を選択":goto Kabara_Aishou_Top2:
51120 '選択肢　2 - 3に変更
51130 case 1:
51140 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:print "                                       ":locate 1,15:print "3.トップ画面に戻るを選択":locate 1,16:goto Kabara_Aishou_Top2:
51150 'リリース時 case 2コメント解除
51160 case 2:
51170 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.男女の相性占いを選択":goto Kabara_Aishou_Top2:
51180 case else:
51190 goto Kabara_Aishou_Top2:
51200 end select
51210 endif
51220 '十字キー　上　、カーソル　上
51230 if ((key$ = chr$(30)) or (y = -1)) then
51240 select case No
51250 case 0:
51260 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:locate 1,15:print "                                       ":locate 1,15:print "3.トップ画面に戻るを選択":goto Kabara_Aishou_Top2:
51270 case 1:
51280 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print"                                       ":locate 1,15:print "1.男女2人の相性を選択":goto Kabara_Aishou_Top2:
51290 case 2:
51300 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.ビジネスの相性を選択":goto Kabara_Aishou_Top2:
51310 case else:
51320 goto Kabara_Aishou_Top2:
51330 end select
51340 endif
51350 endif
51360 '十字キー　上下:選択
51370 'ジョイパッド 右:決定
51380 if ((bg = 2) or (key$ = chr$(13))) then
51390 select case No
51400 '1.男女の相性
51410 case 0:
51420 '男女の相性占い(未実装)トップ画面に飛ぶ
51430 cls 3:sp_on 0,0:sp_on 1,0:sp_on 2,0:goto Danjyo_Aisyou_Top:
51440 '2ビジネスの相性
51450 case 1:
51460 cls 3:sp_on 0,0:sp_on 1,0:sp_on 2,0:goto Business_Aishou_Input_1_parson:
51470 case 2:
51480 sp_on 0,0:sp_on 1,0:sp_on 2,0:pause 200:goto Main_Screen:
51490 end select
51500 endif
51510 '0.男女の相性　トップ画面　ここから
51520 Danjyo_Aisyou_Top:
51530 cls 3:y=0:key$="":bg=0:No=0
51540 play ""
51550 gload Gazo$ + "Screen1.png",0,0,0
51560 gload Gazo$ + "downscreen.png",0,0,800
51570 if ex_info$(1)<>"JP" then
51580 print chr$(13) + chr$(13)
51590 locate 0,4:color rgb(255,255,255)
51600 print "Please select a number" + chr$(13)
51610 print " :1. Compatibility with a person of ...." + chr$(13)
51620 print " :2. Compatibility between two people" + chr$(13)
51630 print " :3. Return to the top screen" + chr$(13)
51640 sp_on 0,1:sp_on 1,0:sp_on 2,0
51650 color rgb(0,0,0)
51660 locate 1,15:print "1. Compatibility with a person of ...."
51670 else
51680 print chr$(13) + chr$(13)
51690 locate 0,4:color rgb(255,255,255)
51700 '****************************************************************************************************
51710 'WUXG(1920x1200)の時ここから
51720 '****************************************************************************************************
51730 print "番号を選んでください" + chr$(13)
51740 print " :1.自分と異性の相性(未実装)" + chr$(13)
51750 print " :2.男女2人の相性" + chr$(13)
51760 print " :3.トップ画面に戻る" + chr$(13)
51770 sp_on 0,1:sp_on 1,0:sp_on 2,0
51780 color rgb(0,0,0)
51790 locate 1,15:print "1.自分と異性の相性(未実装)を選択"
51800 '****************************************************************************************************
51810 'WUXG(1920x1200)の時ここまで
51820 '****************************************************************************************************
51830 endif
51840 Danjyo_Aisyou_Top2:
51850 key$ = "":y = 0:bg = 0:
51860 while ((key$ <> chr$(13)) and (y <> 1) and (y <> -1) and (bg <> 2) and (key$ <> chr$(30)) and (key$ <> chr$(31)))
51870 'ジョイパッド(右) ,十字キー (上下)
51880 'ジョイパッドの右のボタン bg = 2(ジョイパッド右：決定　)、Enter(chr$(13):（決定）)
51890 y = stick(1)
51900 key$ = inkey$
51910 bg = strig(1)
51920 pause 200
51930 wend
51940 if ex_info$(1)<>"JP" then
51950 'Cursor down or arrow key down
51960 if ((key$ = chr$(31)) or (y = 1)) then
51970 select case No
51980 'Option 1 - 2 change
51990 'case 0 1. Compatibility fortune-telling => 2. Business compatibility fortune-telling
52000 'ok
52010 case 0:
52020 No = 1:sp_on 1,1:sp_on 2,0:sp_on 0,0:pause 200:locate 1,15:print "                                                                               ":locate 1,15:print "2. Select compatibility between two people":goto Danjyo_Aisyou_Top2:
52030 'Option 2 - 3 change
52040 case 1:
52050 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:print "                                       ":locate 1,15:print "3. Select return to the top screen":locate 1,16:goto Danjyo_Aisyou_Top2:
52060 'Release time case 2 comment release
52070 case 2:
52080 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1. Select compatibility with a person of the opposite sex (not implemented)":goto Danjyo_Aisyou_Top2:
52090 case else:
52100 goto Kabara_Aishou_Top2:
52110 end select
52120 endif
52130 'Arrow key up, cursor up
52140 if ((key$ = chr$(30)) or (y = -1)) then
52150 select case No
52160 case 0:
52170 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:locate 1,15:print "                                       ":locate 1,15:print "3. Select return to the top screen":goto Danjyo_Aisyou_Top2:
52180 case 1:
52190 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print"                                       ":locate 1,15:print "1. Select compatibility with a person of the opposite sex (not implemented)":goto Danjyo_Aisyou_Top2:
52200 case 2:
52210 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2. Select compatibility between two people":goto Danjyo_Aisyou_Top2:
52220 case else:
52230 goto Kabara_Aishou_Top2:
52240 end select
52250 endif
52260 else
52270 'カーソル　下 or 十字キー　下
52280 if ((key$ = chr$(31)) or (y = 1)) then
52290 select case No
52300 '選択肢　1 - 2に変更
52310 'case 0 1.男女の相性占い => 2.ビジネスの相性占い
52320 'ok
52330 case 0:
52340 No = 1:sp_on 1,1:sp_on 2,0:sp_on 0,0:pause 200:locate 1,15:print "                                                                               ":locate 1,15:print "2.男女2人の相性を選択":goto Danjyo_Aisyou_Top2:
52350 '選択肢　2 - 3に変更
52360 case 1:
52370 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:print "                                       ":locate 1,15:print "3.トップ画面に戻るを選択":locate 1,16:goto Danjyo_Aisyou_Top2:
52380 'リリース時 case 2コメント解除
52390 case 2:
52400 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.自分と異性の相性(未実装)を選択":goto Danjyo_Aisyou_Top2:
52410 case else:
52420 goto Kabara_Aishou_Top2:
52430 end select
52440 endif
52450 '十字キー　上　、カーソル　上
52460 if ((key$ = chr$(30)) or (y = -1)) then
52470 select case No
52480 case 0:
52490 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:locate 1,15:print "                                       ":locate 1,15:print "3.トップ画面に戻るを選択":goto Danjyo_Aisyou_Top2:
52500 case 1:
52510 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print"                                       ":locate 1,15:print "1.自分と異性の相性(未実装)":goto Danjyo_Aisyou_Top2:
52520 case 2:
52530 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.男女2人の相性を選択":goto Danjyo_Aisyou_Top2:
52540 case else:
52550 goto Kabara_Aishou_Top2:
52560 end select
52570 endif
52580 endif
52590 end
52600 '十字キー　上下:選択
52610 'ジョイパッド 右:決定
52620 if ((bg = 2) or (key$ = chr$(13))) then
52630 select case No
52640 '1.自分と異性の相性
52650 case 0:
52660 '未実装
52670 cls 3:sp_on 0,0:sp_on 1,0:sp_on 2,0:
52680 '2男女の相性 男性の名前入力に飛ぶ
52690 case 1:
52700 cls 3:sp_on 0,0:sp_on 1,0:sp_on 2,0:goto Danjyo_Aisyou_Input_Name_male:
52710 case 2:
52720 sp_on 0,0:sp_on 1,0:sp_on 2,0:pause 200:goto Main_Screen:
52730 end select
52740 endif
52750 '0.男女の相性　トップ画面　ここまで
52760 '1.男女の相性 ここから
52770 '1-1.男性の名前を入力
52780 Danjyo_Aisyou_Input_Name_male:
52790 No=0:color RGB(255,255,255)
52800 '入力:キーボード
52810 cls 3:init "kb:2"
52820 gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
52830 gload Gazo$ + "downscreen.png",0,0,800
52840 for i=0 to 3
52850 buf_male_year(i)=0
52860 next i
52870 if ex_info$(1)<>"JP" then
52880 play "":color rgb(255,0,0):male_name$ = ""
52890 locate 0,1
52900 print "Male Compatibility" + chr$(13) + chr$(13)
52910 color rgb(255,255,255):
52920 locate 0,3
52930 print "We will find the compatibility with a man. Please enter the man's name" + chr$(13)
52940 locate 0,15:color rgb(0,0,0)
52950 Input "Man's Name:",male_name$
52960 else
52970 '****************************************************************************************************
52980 'WUXG(1920x1200)の時ここから
52990 '****************************************************************************************************
53000 play "":color rgb(255,0,0):male_name$ = ""
53010 locate 0,1
53020 print "男性の相性" + chr$(13) + chr$(13)
53030 color rgb(255,255,255):
53040 locate 0,3
53050 print "男性の相性を求めます。男性の名前を" + chr$(13)
53060 print "入れてください" + chr$(13)
53070 locate 0,15:color rgb(0,0,0)
53080 Input "男性の名前:",male_name$
53090 '****************************************************************************************************
53100 'WUXG(1920x1200)の時ここまで
53110 '****************************************************************************************************
53120 endif
53130 '-------------------------------------------
53140 '1-2:男性の生まれた年代
53150 Danjyo_Aisyou_Input_Born_Year:
53160 No=0:color RGB(255,255,255)
53170 cls 3:init "kb:4"
53180 '****************************************************************************************************
53190 'WUXG(1920x1200)の時ここから
53200 '****************************************************************************************************
53210 gload Gazo$ + "Screen1.png",0,0,0
53220 gload Gazo$ + "downscreen.png",0,0,800
53230 '****************************************************************************************************
53240 'WUXG(1920x1200)の時ここから
53250 '****************************************************************************************************
53260 play "":color rgb(255,0,0)
53270 '-------------------------------------------
53280 font 48
53290 if ex_info$(1)<>"JP" then
53300 locate 0,1
53310 color rgb(255,255,255)
53320 print "Please enter the man's birth year" + chr$(13)
53330 color rgb(255,255,255)
53340 locate 1,3
53350 print "Man's Birth Year (4 digits):";buf_male_year$
53360 else
53370 '****************************************************************************************************
53380 'WUXG(1920x1200)の時ここから
53390 '****************************************************************************************************
53400 locate 0,1
53410 '文字色：黒　 color rgb(0,0,0)
53420 color rgb(255,255,255)
53430 print "男性の生まれた年代を入れて下さい" + chr$(13)
53440 color rgb(255,255,255)
53450 locate 1,3
53460 print "男性の生まれた年代(西暦4桁):";buf_male_year$
53470 '****************************************************************************************************
53480 'WUXG(1920x1200)の時ここから
53490 '****************************************************************************************************
53500 endif
53510 color rgb(255,255,255)
53520 'locate 4,6:print ":7"
53530 'locate 9,6:print ":8"
53540 'locate 12,6:print ":9"
53550 locate 4,6
53560 print ":7  :8  :9" + chr$(13)
53570 color rgb(255,255,255)
53580 locate 4,8
53590 print ":4  :5  :6" + chr$(13)
53600 color rgb(255,255,255)
53610 locate 4,10
53620 print ":1  :2  :3" + chr$(13)
53630 locate 4,12
53640 print "    :0"
53650 locate 12,12
53660 color rgb(0,0,255)
53670 print ":Ok"
53680 sp_on 4,0: sp_on 5,0:sp_on 6,0
53690 sp_on 7,0:sp_on 8,0:sp_on 9,0
53700 sp_on 10,0:sp_on 11,0:sp_on 12,0
53710 sp_on 13,0:sp_on 14,1
53720 '-------------------------------------------------------------------------------------
53730 Danjyo_Aisyou_Input_Male_Born_Year2:
53740 key$="":bg=0:y=0:y2=0:bg2=0:
53750 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
53760 key$ = inkey$
53770 bg = strig(1)
53780 y = stick(1)
53790 y2 = stick(0)
53800 bg2=strig(0)
53810 pause 200
53820 wend
53830 '十字キー　ここから
53840 '上の矢印　または、十字キー上
53850 if ((y = -1) or (key$ = chr$(30))) then
53860 select case No
53870 'No=-1:okのとき:初期の状態
53880 '0kボタンから３に移動
53890 '上に行く 処理
53900 case -1:
53910 No=3:sp_on 12,1:sp_on 14,0
53920 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53930 '選択肢:3
53940 '3ボタンから 6に移動
53950 case 3:
53960 No=6:sp_on 12,0:sp_on 11,1
53970 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53980 '6ボタンから ９に移動
53990 case 6:
54000 No=9:sp_on 10,1:sp_on 11,0
54010 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54020 '6ボタンから ９に移動　ここまで
54030 '9で上を押して何もしない
54040 case 9:
54050 '何もしない
54060 No=9
54070 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54080 '9で上を押しても何もしない　ここまで
54090 '上　 0ボタンから2ボタン
54100 'sp_on 6,1:1
54110 'sp_on 8,1:5
54120 'sp_on 7,1:7
54130 case 0:
54140 No=2:sp_on 13,0:sp_on 9,1:
54150 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54160 '上  0ボタンから2ボタン　ここまで
54170 '2から５になる 上
54180 case 2:
54190 No=5:sp_on 8,1:sp_on 9,0:
54200 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54210 case 5:
54220 No=8:sp_on 7,1:sp_on 8,0
54230 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54240 case 8:
54250 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54260 case 1:
54270 No=4:sp_on 5,1:sp_on 6,0
54280 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54290 case 4:
54300 No=7:sp_on 4,1:sp_on 5,0
54310 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54320 case 7:
54330 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54340 end select
54350 endif
54360 '左３　ここまで
54370 '下の矢印
54380 '中央 2
54390 if ((y=1) or (key$ = chr$(31))) then
54400 select case No
54410 '9から６に下げる
54420 case 9:
54430 No=6:sp_on 11,1:sp_on 10,0
54440 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54450 '6から３に下げる
54460 case 6:
54470 No=3:sp_on 12,1:sp_on 11,0
54480 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54490 '3から０ｋに変える
54500 case 3:
54510 No=-1:sp_on 14,1:sp_on 12,0
54520 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54530 'Okから下のボタンを押しても何もしない
54540 case -1:
54550 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54560 case 8:
54570 No=5:sp_on 8,1:sp_on 7,0
54580 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54590 case 5:
54600 No=2:sp_on 9,1:sp_on 8,0
54610 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54620 case 2:
54630 No=0:sp_on 13,1:sp_on 9,0
54640 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54650 case 0:
54660 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54670 case 7:
54680 No=4:sp_on 5,1:sp_on 4,0
54690 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54700 case 4:
54710 No=1:sp_on 6,1:sp_on 5,0
54720 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54730 case 1:
54740 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54750 end select
54760 endif
54770 '左へボタン 十字キー　左　or 　カーソル左
54780 if ((y2 = -1) or (key$ = chr$(29))) then
54790 select case No
54800 'Ok ボタン  Okから　左　０に行く
54810 case -1:
54820 No=0:sp_on 13,1:sp_on 14,0
54830 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54840 '0 ボタン  左　何もしない
54850 case 0:
54860 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54870 case 3:
54880 No=2:sp_on 9,1:sp_on 12,0:
54890 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54900 case 2:
54910 No=1:sp_on 6,1:sp_on 9,0:
54920 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54930 case 1:
54940 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54950 case 6:
54960 No=5:sp_on 8,1:sp_on 11,0
54970 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54980 case 5:
54990 No=4:sp_on 5,1:sp_on 8,0
55000 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55010 case 4:
55020 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55030 case 9:
55040 No=8:sp_on 7,1:sp_on 10,0
55050 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55060 case 8:
55070 No=7:sp_on 4,1:sp_on 7,0
55080 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55090 case 7:
55100 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55110 end select
55120 endif
55130 '右  十字キー　右　or カーソル　右
55140 if ((y2 = 1) or (key$ = chr$(28))) then
55150 select case No
55160 '0ボタンからokボタン右に移動
55170 case 0:
55180 No=-1:sp_on 14,1:sp_on 13,0
55190 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55200 '0ボタンからokボタン 右に移動　ここまで
55210 'OKボタンで右を押して何もしない
55220 case -1:
55230 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55240 case 1:
55250 No=2:sp_on 9,1:sp_on 6,0
55260 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55270 case 2:
55280 No=3:sp_on 12,1:sp_on 9,0
55290 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55300 case 3:
55310 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55320 case 4:
55330 No=5:sp_on 8,1:sp_on 5,0
55340 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55350 case 5:
55360 No=6:sp_on 11,1:sp_on 8,0
55370 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55380 case 7:
55390 No=8:sp_on 7,1:sp_on 4,0
55400 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55410 case 8:
55420 No=9:sp_on 10,1:sp_on 7,0
55430 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55440 case 9:
55450 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55460 case 6:
55470 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
55480 end select
55490 'Okから右ボタンを押して何もしない ここまで
55500 endif
55510 '十字キー　ここまで
55520 '==============================
55530 'ここから
55540 '==============================
55550 if ((bg = 2) or (key$ = chr$(13))) then
55560 select case count
55570 case 0:
55580 count = 1
55590 if (No = -1) then
55600 count = 0:No=0
55610 buf_male_year(0) = No
55620 'Okボタンを押したとき
55630 goto Danjyo_Aisyou_Input_Male_Born_Year2:
55640 else
55650 'Okボタン以外が押されたとき
55660 if (No >= 1 and No <= 2) then
55670 buf_year$="":buf_year$ = str$(No) + "***"
55680 buf_year = No:a= No
55690 buf_Jyoushi_Born_Day(0) = No
55700 if ex_info$(1)<>"JP" then
55710 locate 1,3
55720 color rgb(255,255,255)
55730 print "Year of birth of the male (4 digits AD):";buf_year$
55740 else
55750 count=0
55760 ui_msg"The number is out of range."
55770 endif
55780 else
55790 '****************************************************************************************************
55800 'WUXG(1920x1200)の時ここから
55810 '****************************************************************************************************
55820 locate 1,3
55830 color rgb(255,255,255)
55840 print "男性の生まれた年代(西暦4桁):";buf_year$
55850 goto Danjyo_Aisyou_Input_Male_Born_Year2:
55860 '****************************************************************************************************
55870 'WUXG(1920x1200)の時ここまで
55880 '****************************************************************************************************
55890 else
55900 count=0
55910 ui_msg"数字が範囲外になります。"
55920 endif
55930 buf_year$="":buf_year=0
55940 goto Danjyo_Aisyou_Input_Male_Born_Year2:
55950 endif
55960 'endif
55970 case 1:
55980 count = 2
55990 if (No = -1) then
56000 count = 1
56010 goto Danjyo_Aisyou_Input_Male_Born_Year2:
56020 else
56030 '****************************************************************************************************
56040 'WUXG(1920x1200)の時ここから
56050 '****************************************************************************************************
56060 buf_year = a * 10 + No
56070 b=buf_year
56080 buf_year$ = str$(buf_year) + "**"
56090 buf_male_year(0)=buf_year
56100 locate 1,3
56110 color rgb(255,255,255)
56120 print "                                                                "
56130 locate 1,3
56140 print "男性の生まれた年代(西暦4桁):" + buf_year$
56150 'if (No = -1) then
56160 'count=1
56170 goto Danjyo_Aisyou_Input_Male_Born_Year2:
56180 '****************************************************************************************************
56190 'WUXG(1920x1200)の時ここまで
56200 '****************************************************************************************************
56210 endif
56220 case 2:
56230 count=3
56240 if (No=-1) then
56250 count =2
56260 goto Danjyo_Aisyou_Input_Male_Born_Year2:
56270 else
56280 buf_year = b * 10 + No
56290 c=buf_year
56300 buf_year$ = str$(buf_year) + "*"
56310 buf_male_year(0) = buf_year
56320 locate 1,3
56330 color rgb(255,255,255)
56340 print " 　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　"
56350 if ex_info$(1)<>"JP" then
56360 locate 1,3
56370 print "Year of birth of the male (4 digits AD):";buf_year$
56380 else
56390 '****************************************************************************************************
56400 'WUXG(1920x1200)の時ここから
56410 '****************************************************************************************************
56420 locate 1,3
56430 print "男性の生まれた年代(西暦4桁):";buf_year$
56440 goto Danjyo_Aisyou_Input_Male_Born_Year2:
56450 '****************************************************************************************************
56460 'WUXG(1920x1200)の時ここまで
56470 '****************************************************************************************************
56480 endif
56490 endif
56500 case 3:
56510 count=4
56520 if (No = -1) then
56530 No=0
56540 goto Danjyo_Aisyou_Input_Male_Born_Year2:
56550 else
56560 buf_year = c * 10 + No
56570 buf_year$ = str$(buf_year)
56580 buf_male_year(0) = buf_year
56590 if ex_info$(1)<>"JP" then
56600 locate 1,3
56610 color RGB(255,255,255)
56620 print "                                      "
56630 locate 1,3
56640 print "Year of birth of the male (4 digits AD):";buf_year$
56650 else
56660 locate 1,3
56670 color RGB(255,255,255)
56680 print "                                      "
56690 locate 1,3
56700 print "男性の生まれた年代(西暦4桁):";buf_year$
56710 endif
56720 buf_year=val(buf_year$)
56730 'year=val(buf_year$)
56740 'if (No=-1) then
56750 'goto Input_Born_Month:
56760 'else
56770 goto Danjyo_Aisyou_Input_Male_Born_Year2:
56780 endif
56790 case 4:
56800 'bufyear=buf_year
56810 if (No=-1) then
56820 buf_year = val(buf_year$)
56830 buf_male_year(0)=buf_year
56840 sp_on 14,0:No=0
56850 goto Danjyo_Aisyou_Input_Male_Born_Year2:
56860 else
56870 goto Danjyo_Aisyou_Input_Male_Born_Year2:
56880 endif
56890 end select
56900 endif
56910 '===========================
56920 'ここまでを部下のところにコピーする.
56930 '===========================
56940 if (bg2 = 2) then
56950 select case count2
56960 case 0:
56970 if (No = -1) then
56980 buf_male_year=0:buf_male_year$=trim$(""):buf_male_year$=trim$("****")
56990 count=0
57000 if ex_info$(1)<>"JP" then
57010 locate 1,3
57020 color rgb(255,255,255)
57030 print "                                      "
57040 locate 1,3
57050 print "Year of birth of the male (4 digits AD):" + buf_male_year$
57060 goto Danjyo_Aisyou_Input_Male_Born_Year2:
57070 else
57080 '(buf_year=0) then
57090 buf_male_year=0:buf_male_year$="****"
57100 locate 1,3
57110 print "                                       "
57120 locate 1,3
57130 print "Year of birth of the male (4 digits AD):"+buf_male_year$
57140 goto Danjyo_Aisyou_Input_Male_Born_Year2:
57150 else
57160 locate 1,3
57170 color rgb(255,255,255)
57180 print "                                      "
57190 locate 1,3
57200 print "男性の生まれた年代（西暦4桁):" + buf_male_year$
57210 goto Danjyo_Aisyou_Input_Male_Born_Year2:
57220 else
57230 '(buf_year=0) then
57240 buf_male_year=0:buf_male_year$="****"
57250 locate 1,3
57260 print "                                       "
57270 locate 1,3
57280 print "男性の生まれた年代(西暦4桁):"+buf_male_year$
57290 goto Danjyo_Aisyou_Input_Male_Born_Year2:
57300 endif
57310 endif
57320 end select
57330 endif
57340 '-------生まれた年代　男性-------------
57350 '-------生まれた月　男性-------------
57360 '1-2:男性の生まれた月
57370 Danjyo_Aisyou_Input_Male_Born_Month:
57380 cls 3:play "":count=0:count2=0
57390 'No=-1:Okのとき
57400 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_male_Month$ = "**":buf_male_month=0
57410 for i=0 to 1
57420 buf_male_month(i)=0
57430 next i
57440 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
57450 '****************************************************************************************************
57460 'WUXG(1920x1200)の時ここから
57470 '****************************************************************************************************
57480 gload Gazo$ + "Screen1.png",0,0,0
57490 gload Gazo$ + "downscreen.png",0,0,800
57500 '****************************************************************************************************
57510 'WUXG(1920x1200)の時ここまで
57520 '****************************************************************************************************
57530 'Init"kb:4"
57540 '音声ファイル再生 2023.06.07
57550 play Voice$ + "Input_Born_Month_Jyoushi_20230831.mp3"
57560 '****************************************************************************************************
57570 'WUXG(1920x1200)の時ここから
57580 '****************************************************************************************************
57590 font 48
57600 '****************************************************************************************************
57610 'WUXG(1920x1200)の時ここまで
57620 '****************************************************************************************************
57630 locate 0,1
57640 '文字色：黒　 color rgb(0,0,0)
57650 '文字色:白
57660 color rgb(255,255,255)
57670 print "男性の生まれた月を入れて下さい" + chr$(13)
57680 '文字色:白
57690 color rgb(255,255,255)
57700 locate 1,3
57710 '文字色:白
57720 print "男性の生まれた月(1月~12月):"+buf_male_Month$
57730 color rgb(255,255,255)
57740 'locate 4,6:print ":7"
57750 'locate 9,6:print ":8"
57760 'locate 12,6:print ":9"
57770 locate 4,6
57780 '文字色:赤
57790 print ":7  :8  :9" + chr$(13)
57800 color rgb(255,255,255)
57810 locate 4,8
57820 print ":4  :5  :6" + chr$(13)
57830 color rgb(255,255,255)
57840 locate 4,10
57850 print ":1  :2  :3" + chr$(13)
57860 locate 4,12
57870 print "    :0"
57880 locate 12,12
57890 color rgb(0,0,255)
57900 print ":Ok"
57910 sp_on 4,0: sp_on 5,0:sp_on 6,0
57920 sp_on 7,0:sp_on 8,0:sp_on 9,0
57930 sp_on 10,0:sp_on 11,0:sp_on 12,0
57940 sp_on 13,0:sp_on 14,1
57950 '----------------------------------------------------------------------------------------
57960 Danjyo_Aisyou_Input_Male_Born_Month2:
57970 key$="":bg=0:y=0:y2=0:bg2=0
57980 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
57990 key$ = inkey$
58000 bg = strig(1)
58010 y = stick(1)
58020 y2 = stick(0)
58030 bg2 = strig(0)
58040 pause 200
58050 wend
58060 '十字キー　ここから
58070 '上の矢印　または、十字キー上
58080 if ((y = -1) or (key$ = chr$(30))) then
58090 select case No
58100 'No=-1:okのとき:初期の状態
58110 '0kボタンから３に移動
58120 '上に行く 処理
58130 case -1:
58140 No=3:sp_on 12,1:sp_on 14,0
58150 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58160 '選択肢:3
58170 '3ボタンから 6に移動
58180 case 3:
58190 No=6:sp_on 12,0:sp_on 11,1
58200 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58210 '6ボタンから ９に移動
58220 case 6:
58230 No=9:sp_on 10,1:sp_on 11,0
58240 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58250 '6ボタンから ９に移動　ここまで
58260 '9で上を押して何もしない
58270 case 9:
58280 '何もしない
58290 No=9
58300 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58310 '9で上を押しても何もしない　ここまで
58320 '上　 0ボタンから2ボタン
58330 'sp_on 6,1:1
58340 'sp_on 8,1:5
58350 'sp_on 7,1:7
58360 case 0:
58370 No=2:sp_on 13,0:sp_on 9,1:
58380 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58390 '上  0ボタンから2ボタン　ここまで
58400 '2から５になる 上
58410 case 2:
58420 No=5:sp_on 8,1:sp_on 9,0:
58430 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58440 case 5:
58450 No=8:sp_on 7,1:sp_on 8,0
58460 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58470 case 8:
58480 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58490 case 1:
58500 No=4:sp_on 5,1:sp_on 6,0
58510 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58520 case 4:
58530 No=7:sp_on 4,1:sp_on 5,0
58540 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58550 case 7:
58560 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58570 end select
58580 endif
58590 '左３　ここまで
58600 '下の矢印
58610 '中央 2
58620 if ((y=1) or (key$ = chr$(31))) then
58630 select case No
58640 '9から６に下げる
58650 case 9:
58660 No=6:sp_on 11,1:sp_on 10,0
58670 pause 200:gotoDanjyo_Aisyou_Input_Male_Born_Month2:
58680 '6から３に下げる
58690 case 6:
58700 No=3:sp_on 12,1:sp_on 11,0
58710 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58720 '3から０ｋに変える
58730 case 3:
58740 No=-1:sp_on 14,1:sp_on 12,0
58750 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58760 'Okから下のボタンを押しても何もしない
58770 case -1:
58780 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58790 case 8:
58800 No=5:sp_on 8,1:sp_on 7,0
58810 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58820 case 5:
58830 No=2:sp_on 9,1:sp_on 8,0
58840 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58850 case 2:
58860 No=0:sp_on 13,1:sp_on 9,0
58870 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58880 case 0:
58890 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58900 case 7:
58910 No=4:sp_on 5,1:sp_on 4,0
58920 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58930 case 4:
58940 No=1:sp_on 6,1:sp_on 5,0
58950 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58960 case 1:
58970 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58980 end select
58990 endif
59000 '左へボタン 十字キー　左　or 　カーソル左
59010 if ((y2 = -1) or (key$ = chr$(29))) then
59020 select case No
59030 'Ok ボタン  Okから　左　０に行く
59040 case -1:
59050 No=0:sp_on 13,1:sp_on 14,0
59060 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59070 '0 ボタン  左　何もしない
59080 case 0:
59090 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59100 case 3:
59110 No=2:sp_on 9,1:sp_on 12,0:
59120 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59130 case 2:
59140 No=1:sp_on 6,1:sp_on 9,0:
59150 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59160 case 1:
59170 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59180 case 6:
59190 No=5:sp_on 8,1:sp_on 11,0
59200 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59210 case 5:
59220 No=4:sp_on 5,1:sp_on 8,0
59230 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59240 case 4:
59250 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59260 case 9:
59270 No=8:sp_on 7,1:sp_on 10,0
59280 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59290 case 8:
59300 No=7:sp_on 4,1:sp_on 7,0
59310 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59320 case 7:
59330 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59340 end select
59350 endif
59360 '右  十字キー　右　or カーソル　右
59370 if ((y2 = 1) or (key$ = chr$(28))) then
59380 select case No
59390 '0ボタンからokボタン右に移動
59400 case 0:
59410 No=-1:sp_on 14,1:sp_on 13,0
59420 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59430 '0ボタンからokボタン 右に移動　ここまで
59440 'OKボタンで右を押して何もしない
59450 case -1:
59460 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59470 case 1:
59480 No=2:sp_on 9,1:sp_on 6,0
59490 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59500 case 2:
59510 No=3:sp_on 12,1:sp_on 9,0
59520 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59530 case 3:
59540 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59550 case 4:
59560 No=5:sp_on 8,1:sp_on 5,0
59570 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59580 case 5:
59590 No=6:sp_on 11,1:sp_on 8,0
59600 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59610 case 7:
59620 No=8:sp_on 7,1:sp_on 4,0
59630 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59640 case 8:
59650 No=9:sp_on 10,1:sp_on 7,0
59660 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59670 case 9:
59680 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59690 case 6:
59700 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
59710 end select
59720 'Okから右ボタンを押して何もしない ここまで
59730 endif
59740 '十字キー　ここまで
59750 '右の丸ボタン + Enter key 決定キー
59760 if ((bg=2) or (key$=chr$(13))) then
59770 select case count
59780 case 0:
59790 if (No=-1) then No=0
59800 count = 1:buf_male_Month$ = "**":buf_male_Month$ = str$(No):buf_male_month = No:c=No
59810 if (buf_male_month > 1 and buf_male_month < 10)  then
59820 buf_male_Month$ = str$(buf_male_month)
59830 'buf_month=No
59840 endif
59850 if (buf_male_month = 1)  then
59860 buf_male_Month$ = str$(buf_male_month) + "*"
59870 'c=buf_month
59880 endif
59890 locate 1,3
59900 print "                                     "
59910 color RGB(255,255,255)
59920 locate 1,3
59930 print "男性の生まれた月(1月~12月):" + buf_male_Month$
59940 goto Danjyo_Aisyou_Input_Male_Born_Month2:
59950 case 1:
59960 count = 2:
59970 'c = val(buf_Month$)
59980 if (No = -1) then
59990 'count=0
60000 No=0
60010 month=buf_male_month
60020 buf_male_month=val(buf_male_Month$)
60030 month=buf_male_month
60040 buf_Jyoushi_Born_Day(1)=month
60050 '生まれた日に飛ぶ
60060 goto Danjyo_Aisyou_Input_Male_Born_Day:
60070 else
60080 buf_male_month = c*10 + No
60090 'if (buf_month = 1) then
60100 'buf_Month$ = str$(buf_month)
60110 'endif
60120 buf_male_Month$ = str$(buf_male_month)
60130 buf_Jyoushi_Born_Day(1) = buf_male_month
60140 locate 0,3
60150 print "                                           "
60160 locate 1,3
60170 color Rgb(255,255,255)
60180 print "男性の生まれた月(1月~12月):" + buf_male_Month$
60190 goto Danjyo_Aisyou_Input_Male_Born_Month2:
60200 endif
60210 case 2:
60220 '==================================
60230 '何もしない
60240 'coun = 2
60250 '==================================
60260 'c= val(buf_Month$)
60270 'buf_month = c*10 + No
60280 'buf_Month$ = str$(buf_month)
60290 'locate 2,3
60300 'print "上司の生まれた月(1月～12月):";buf_Month$
60310 'goto Jyoushi_Input_Born_Month2:
60320 'case 3:
60330 'count=4
60340 'b=val(buf_month$)
60350 'buf_month=c*10+No
60360 'buf_Month$=str$(buf_month)
60370 'locate 2,3
60380 'print "上司の生まれた月(1月～12月):";buf_Month$
60390 'buf_month=val(buf_Month$)
60400 'year=val(buf_year$)
60410 if (No=-1) then
60420 No=0
60430 goto Danjyo_Aisyou_Input_Male_Born_Day:
60440 else
60450 goto Danjyo_Aisyou_Input_Male_Born_Day2:
60460 endif
60470 'case 4:
60480 'bufyear=buf_year
60490 'if (No=-1) then
60500 'buf_month = val(buf_Month$)
60510 'month = buf_month
60520 'sp_on 14,0
60530 'goto Input_Born_Day:
60540 'else
60550 'goto Input_Born_Month2:
60560 'endif
60570 end select
60580 endif
60590 '左の丸ボタン　キャンセル
60600 if (bg2=2) then
60610 select case count2
60620 case 0:
60630 if (No = -1) then
60640 buf_male_month=0:buf_male_Month$="**"
60650 count=0
60660 'goto rewrite2:
60670 else
60680 if ((No >= 1 and No <= 9) or (No >= 10 and No <= 12)) then
60690 buf_male_month = 0:buf_male_Month$ = "**"
60700 locate 0,3
60710 color rgb(255,255,255)
60720 print "                                       "
60730 goto rewrite2:
60740 if (No>12) then
60750 ui_msg"値が範囲外です。"
60760 goto rewrite2:
60770 endif
60780 endif
60790 endif
60800 rewrite2:
60810 locate 2,3
60820 color rgb(255,255,255)
60830 print "                                      "
60840 locate 2,3
60850 print "男性の生まれた月(1月~12月):"+buf_male_Month$
60860 goto Danjyo_Aisyou_Input_Male_Born_Month2:
60870 end select
60880 'endif
60890 endif
60900 end
60910 '-------生まれた月　男性 ここまで-------------
60920 '-------生まれた日　男性 ここから-------------
60930 Danjyo_Aisyou_Input_Male_Born_Day:
60940 cls 3:play "":count=0:count2=0
60950 'No=-1:Okのとき
60960 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_male_Day$ = "**":buf_male_day = 0
60970 for i=0 to 1
60980 buf_day(i)=0
60990 next i
61000 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
61010 '****************************************************************************************************
61020 'WUXG(1920x1200)の時ここから
61030 '****************************************************************************************************
61040 gload Gazo$ + "Screen1.png",0,0,0
61050 gload Gazo$ + "downscreen.png",0,0,800
61060 '****************************************************************************************************
61070 'WUXG(1920x1200)の時ここまで
61080 '****************************************************************************************************
61090 'Init"kb:4"
61100 '音声ファイル再生 2023.06.07
61110 play Voice$ + "Input_Born_Month_Jyoushi_20230831.mp3"
61120 font 48
61130 locate 0,1
61140 '文字色：黒　 color rgb(0,0,0)
61150 '文字色:白
61160 color rgb(255,255,255)
61170 print "男性の生まれた日を入れて下さい" + chr$(13)
61180 '文字色:白
61190 color rgb(255,255,255)
61200 locate 1,3
61210 '文字色:白
61220 print "男性の生まれた日(1月~31月):" + buf_Day$
61230 color rgb(255,255,255)
61240 'locate 4,6:print ":7"
61250 'locate 9,6:print ":8"
61260 'locate 12,6:print ":9"
61270 locate 4,6
61280 '文字色:赤
61290 print ":7  :8  :9" + chr$(13)
61300 color rgb(255,255,255)
61310 locate 4,8
61320 print ":4  :5  :6" + chr$(13)
61330 color rgb(255,255,255)
61340 locate 4,10
61350 print ":1  :2  :3" + chr$(13)
61360 locate 4,12
61370 print "    :0"
61380 locate 12,12
61390 color rgb(0,0,255)
61400 print ":Ok"
61410 sp_on 4,0: sp_on 5,0:sp_on 6,0
61420 sp_on 7,0:sp_on 8,0:sp_on 9,0
61430 sp_on 10,0:sp_on 11,0:sp_on 12,0
61440 sp_on 13,0:sp_on 14,1
61450 '-------------------------------------------------
61460 Danjyo_Aisyou_Input_Male_Born_Day2:
61470 key$="":bg=0:y=0:y2=0:bg2=0
61480 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
61490 key$ = inkey$
61500 bg = strig(1)
61510 y = stick(1)
61520 y2 = stick(0)
61530 bg2 = strig(0)
61540 pause 200
61550 wend
61560 '十字キー　ここから
61570 '上の矢印　または、十字キー上
61580 if ((y = -1) or (key$ = chr$(30))) then
61590 select case No
61600 'No=-1:okのとき:初期の状態
61610 '0kボタンから３に移動
61620 '上に行く 処理
61630 case -1:
61640 No=3:sp_on 12,1:sp_on 14,0
61650 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61660 '選択肢:3
61670 '3ボタンから 6に移動
61680 case 3:
61690 No=6:sp_on 12,0:sp_on 11,1
61700 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61710 '6ボタンから ９に移動
61720 case 6:
61730 No=9:sp_on 10,1:sp_on 11,0
61740 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61750 '6ボタンから ９に移動　ここまで
61760 '9で上を押して何もしない
61770 case 9:
61780 '何もしない
61790 No=9
61800 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61810 '9で上を押しても何もしない　ここまで
61820 '上　 0ボタンから2ボタン
61830 'sp_on 6,1:1
61840 'sp_on 8,1:5
61850 'sp_on 7,1:7
61860 case 0:
61870 No=2:sp_on 13,0:sp_on 9,1:
61880 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61890 '上  0ボタンから2ボタン　ここまで
61900 '2から５になる 上
61910 case 2:
61920 No=5:sp_on 8,1:sp_on 9,0:
61930 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61940 case 5:
61950 No=8:sp_on 7,1:sp_on 8,0
61960 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61970 case 8:
61980 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61990 case 1:
62000 No=4:sp_on 5,1:sp_on 6,0
62010 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62020 case 4:
62030 No=7:sp_on 4,1:sp_on 5,0
62040 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62050 case 7:
62060 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62070 end select
62080 endif
62090 '左３　ここまで
62100 '下の矢印
62110 '中央 2
62120 if ((y=1) or (key$ = chr$(31))) then
62130 select case No
62140 '9から６に下げる
62150 case 9:
62160 No=6:sp_on 11,1:sp_on 10,0
62170 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62180 '6から３に下げる
62190 case 6:
62200 No=3:sp_on 12,1:sp_on 11,0
62210 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62220 '3から０ｋに変える
62230 case 3:
62240 No=-1:sp_on 14,1:sp_on 12,0
62250 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62260 'Okから下のボタンを押しても何もしない
62270 case -1:
62280 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62290 case 8:
62300 No=5:sp_on 8,1:sp_on 7,0
62310 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62320 case 5:
62330 No=2:sp_on 9,1:sp_on 8,0
62340 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62350 case 2:
62360 No=0:sp_on 13,1:sp_on 9,0
62370 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62380 case 0:
62390 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62400 case 7:
62410 No=4:sp_on 5,1:sp_on 4,0
62420 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62430 case 4:
62440 No=1:sp_on 6,1:sp_on 5,0
62450 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62460 case 1:
62470 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62480 end select
62490 endif
62500 '左へボタン 十字キー　左　or 　カーソル左
62510 if ((y2 = -1) or (key$ = chr$(29))) then
62520 select case No
62530 'Ok ボタン  Okから　左　０に行く
62540 case -1:
62550 No=0:sp_on 13,1:sp_on 14,0
62560 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62570 '0 ボタン  左　何もしない
62580 case 0:
62590 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62600 case 3:
62610 No=2:sp_on 9,1:sp_on 12,0:
62620 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62630 case 2:
62640 No=1:sp_on 6,1:sp_on 9,0:
62650 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62660 case 1:
62670 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62680 case 6:
62690 No=5:sp_on 8,1:sp_on 11,0
62700 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62710 case 5:
62720 No=4:sp_on 5,1:sp_on 8,0
62730 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62740 case 4:
62750 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62760 case 9:
62770 No=8:sp_on 7,1:sp_on 10,0
62780 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62790 case 8:
62800 No=7:sp_on 4,1:sp_on 7,0
62810 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62820 case 7:
62830 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62840 end select
62850 endif
62860 '右  十字キー　右　or カーソル　右
62870 if ((y2 = 1) or (key$ = chr$(28))) then
62880 select case No
62890 '0ボタンからokボタン右に移動
62900 case 0:
62910 No=-1:sp_on 14,1:sp_on 13,0
62920 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62930 '0ボタンからokボタン 右に移動　ここまで
62940 'OKボタンで右を押して何もしない
62950 case -1:
62960 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62970 case 1:
62980 No=2:sp_on 9,1:sp_on 6,0
62990 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
63000 case 2:
63010 No=3:sp_on 12,1:sp_on 9,0
63020 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
63030 case 3:
63040 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
63050 case 4:
63060 No=5:sp_on 8,1:sp_on 5,0
63070 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
63080 case 5:
63090 No=6:sp_on 11,1:sp_on 8,0
63100 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
63110 case 7:
63120 No=8:sp_on 7,1:sp_on 4,0
63130 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
63140 case 8:
63150 No=9:sp_on 10,1:sp_on 7,0
63160 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
63170 case 9:
63180 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
63190 case 6:
63200 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
63210 end select
63220 'Okから右ボタンを押して何もしない ここまで
63230 endif
63240 '十字キー　ここまで
63250 '右の丸ボタン + Enter key 決定キー
63260 if ((bg=2) or (key$=chr$(13))) then
63270 select case count
63280 case 0:
63290 if (No=-1) then No=0
63300 count = 1:buf_male_Day$ = "**":buf_male_Day$ = str$(No):buf_male_day = No:c=No
63310 if (buf_male_day > 1 and buf_male_day < 10)  then
63320 buf_male_Day$ = str$(buf_male_day)
63330 'buf_month=No
63340 endif
63350 if (buf_male_day = 1)  then
63360 buf_male_Day$ = str$(buf_male_day) + "*"
63370 'c=buf_month
63380 endif
63390 locate 1,3
63400 print "                                     "
63410 color RGB(255,255,255)
63420 locate 1,3
63430 print "男性の生まれた日(1月~31月):" + buf_male_Day$
63440 goto Danjyo_Aisyou_Input_Male_Born_Day2:
63450 case 1:
63460 count = 2:
63470 'c = val(buf_Month$)
63480 if (No = -1) then
63490 'count=0
63500 No=0
63510 day=buf_male_Day
63520 buf_male_Day=val(buf_male_Day$)
63530 day=buf_male_Day
63540 buf_Jyoushi_Born_Day(2)=day
63550 '生まれた日に飛ぶ
63560 goto Danjyo_Aisyou_Input_Male_Born_Day:
63570 else
63580 buf_male_Day = c*10 + No
63590 'if (buf_month = 1) then
63600 'buf_Month$ = str$(buf_month)
63610 'endif
63620 buf_male_Day$ = str$(buf_male_Day)
63630 buf_male_Born_Day(2) = buf_male_Day:
63640 locate 0,3
63650 print "                                           "
63660 locate 1,3
63670 color Rgb(255,255,255)
63680 print "男性の生まれた月(1月~12月):" + buf_male_Day$
63690 goto Danjyo_Aisyou_Input_Male_Born_Day2:
63700 endif
63710 case 2:
63720 '==================================
63730 '何もしない
63740 'coun = 2
63750 '==================================
63760 'c= val(buf_Month$)
63770 'buf_month = c*10 + No
63780 'buf_Month$ = str$(buf_month)
63790 'locate 2,3
63800 'print "上司の生まれた月(1月～12月):";buf_Month$
63810 'goto Jyoushi_Input_Born_Month2:
63820 'case 3:
63830 'count=4
63840 'b=val(buf_month$)
63850 'buf_month=c*10+No
63860 'buf_Month$=str$(buf_month)
63870 'locate 2,3
63880 'print "上司の生まれた月(1月～12月):";buf_Month$
63890 'buf_month=val(buf_Month$)
63900 'year=val(buf_year$)
63910 if (No=-1) then
63920 No=0
63930 goto Danjyo_Aisyou_Input_Male_Born_Day:
63940 else
63950 goto Danjyo_Aisyou_Input_Male_Born_Day2:
63960 endif
63970 'case 4:
63980 'bufyear=buf_year
63990 'if (No=-1) then
64000 'buf_month = val(buf_Month$)
64010 'month = buf_month
64020 'sp_on 14,0
64030 'goto Input_Born_Day:
64040 'else
64050 'goto Input_Born_Month2:
64060 'endif
64070 end select
64080 endif
64090 '左の丸ボタン　キャンセル
64100 if (bg2=2) then
64110 select case count2
64120 case 0:
64130 if (No = -1) then
64140 buf_male_day=0:buf_male_Day$="**"
64150 count=0
64160 'goto rewrite2:
64170 else
64180 if ((No >= 1 and No <= 9) or (No >= 10 and No <= 12)) then
64190 buf_male_day = 0:buf_male_Day$ = "**"
64200 locate 0,3
64210 color rgb(255,255,255)
64220 print "                                       "
64230 goto rewrite2:
64240 if (No>12) then
64250 ui_msg"値が範囲外です。"
64260 goto rewrite2:
64270 endif
64280 endif
64290 endif
64300 rewrite2:
64310 locate 2,3
64320 color rgb(255,255,255)
64330 print "                                      "
64340 locate 2,3
64350 print "男性の生まれた日(1月~31月):"+buf_male_Day$
64360 goto Danjyo_Aisyou_Input_Male_Born_Day2:
64370 end select
64380 'endif
64390 endif
64400 end
64410 '-------生まれた日　女性　ここまで-------------
64420 '1-1.女性の名前を入力
64430 Danjyo_Aisyou_Input_Name_female:
64440 No=0:color RGB(255,255,255)
64450 '入力:キーボード
64460 cls 3:init "kb:2"
64470 '****************************************************************************************************
64480 'WUXG(1920x1200)の時ここから
64490 '****************************************************************************************************
64500 gload Gazo$ + "Screen1.png",0,0,0
64510 gload Gazo$ + "downscreen.png",0,0,800
64520 '****************************************************************************************************
64530 'WUXG(1920x1200)の時ここまで
64540 '****************************************************************************************************
64550 play "":color rgb(255,0,0):female_name$ = ""
64560 locate 0,1
64570 print "女性の相性" + chr$(13) + chr$(13)
64580 color rgb(255,255,255):
64590 locate 0,3
64600 print "女性の相性を求めます。男性の名前を" + chr$(13)
64610 print "入れてください" + chr$(13)
64620 locate 0,15:color rgb(0,0,0)
64630 Input "女性の名前:",female_name$
64640 '-------------------------------------------
64650 '-------生まれた年代　女性 ここから-------------
64660 Danjyo_Aisyou_Input_feMale_Born_Year:
64670 cls 3:play "":count=0:count2=0
64680 'No=-1:Okのとき
64690 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_female_Year$ = "****":buf_female_year = 0
64700 for i=0 to 1
64710 buf_day(i)=0
64720 next i
64730 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
64740 gload Gazo$ + "Screen1.png",0,0,0
64750 gload Gazo$ + "downscreen.png",0,0,800
64760 'Init"kb:4"
64770 '音声ファイル再生 2023.06.07
64780 play Voice$ + "Input_Born_Month_Jyoushi_20230831.mp3"
64790 '****************************************************************************************************
64800 'WUXG(1920x1200)の時ここから
64810 '****************************************************************************************************
64820 font 48
64830 '****************************************************************************************************
64840 'WUXG(1920x1200)の時ここまで
64850 '****************************************************************************************************
64860 locate 0,1
64870 '文字色：黒　 color rgb(0,0,0)
64880 '文字色:白
64890 color rgb(255,255,255)
64900 print "女性の生まれた年代を入れて下さい" + chr$(13)
64910 '文字色:白
64920 color rgb(255,255,255)
64930 locate 1,3
64940 '文字色:白
64950 print "女性の生まれた年代(西暦4桁):" + buf_female_Year$
64960 color rgb(255,255,255)
64970 'locate 4,6:print ":7"
64980 'locate 9,6:print ":8"
64990 'locate 12,6:print ":9"
65000 locate 4,6
65010 '文字色:赤
65020 print ":7  :8  :9" + chr$(13)
65030 color rgb(255,255,255)
65040 locate 4,8
65050 print ":4  :5  :6" + chr$(13)
65060 color rgb(255,255,255)
65070 locate 4,10
65080 print ":1  :2  :3" + chr$(13)
65090 locate 4,12
65100 print "    :0"
65110 locate 12,12
65120 color rgb(0,0,255)
65130 print ":Ok"
65140 sp_on 4,0: sp_on 5,0:sp_on 6,0
65150 sp_on 7,0:sp_on 8,0:sp_on 9,0
65160 sp_on 10,0:sp_on 11,0:sp_on 12,0
65170 sp_on 13,0:sp_on 14,1
65180 '---------------------------------------------
65190 Danjyo_Aisyou_Input_feMale_Born_Year2:
65200 key$="":bg=0:y=0:y2=0:bg2=0:
65210 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
65220 key$ = inkey$
65230 bg = strig(1)
65240 y = stick(1)
65250 y2 = stick(0)
65260 bg2=strig(0)
65270 pause 200
65280 wend
65290 '十字キー　ここから
65300 '上の矢印　または、十字キー上
65310 if ((y = -1) or (key$ = chr$(30))) then
65320 select case No
65330 'No=-1:okのとき:初期の状態
65340 '0kボタンから３に移動
65350 '上に行く 処理
65360 case -1:
65370 No=3:sp_on 12,1:sp_on 14,0
65380 pause 200:gotoDanjyo_Aisyou_Input_feMale_Born_Year2:
65390 '選択肢:3
65400 '3ボタンから 6に移動
65410 case 3:
65420 No=6:sp_on 12,0:sp_on 11,1
65430 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65440 '6ボタンから ９に移動
65450 case 6:
65460 No=9:sp_on 10,1:sp_on 11,0
65470 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65480 '6ボタンから ９に移動　ここまで
65490 '9で上を押して何もしない
65500 case 9:
65510 '何もしない
65520 No=9
65530 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65540 '9で上を押しても何もしない　ここまで
65550 '上　 0ボタンから2ボタン
65560 'sp_on 6,1:1
65570 'sp_on 8,1:5
65580 'sp_on 7,1:7
65590 case 0:
65600 No=2:sp_on 13,0:sp_on 9,1:
65610 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65620 '上  0ボタンから2ボタン　ここまで
65630 '2から５になる 上
65640 case 2:
65650 No=5:sp_on 8,1:sp_on 9,0:
65660 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65670 case 5:
65680 No=8:sp_on 7,1:sp_on 8,0
65690 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65700 case 8:
65710 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65720 case 1:
65730 No=4:sp_on 5,1:sp_on 6,0
65740 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65750 case 4:
65760 No=7:sp_on 4,1:sp_on 5,0
65770 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65780 case 7:
65790 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65800 end select
65810 endif
65820 '左３　ここまで
65830 '下の矢印
65840 '中央 2
65850 if ((y=1) or (key$ = chr$(31))) then
65860 select case No
65870 '9から６に下げる
65880 case 9:
65890 No=6:sp_on 11,1:sp_on 10,0
65900 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65910 '6から３に下げる
65920 case 6:
65930 No=3:sp_on 12,1:sp_on 11,0
65940 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65950 '3から０ｋに変える
65960 case 3:
65970 No=-1:sp_on 14,1:sp_on 12,0
65980 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65990 'Okから下のボタンを押しても何もしない
66000 case -1:
66010 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66020 case 8:
66030 No=5:sp_on 8,1:sp_on 7,0
66040 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66050 case 5:
66060 No=2:sp_on 9,1:sp_on 8,0
66070 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66080 case 2:
66090 No=0:sp_on 13,1:sp_on 9,0
66100 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66110 case 0:
66120 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66130 case 7:
66140 No=4:sp_on 5,1:sp_on 4,0
66150 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66160 case 4:
66170 No=1:sp_on 6,1:sp_on 5,0
66180 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66190 case 1:
66200 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66210 end select
66220 endif
66230 '左へボタン 十字キー　左　or 　カーソル左
66240 if ((y2 = -1) or (key$ = chr$(29))) then
66250 select case No
66260 'Ok ボタン  Okから　左　０に行く
66270 case -1:
66280 No=0:sp_on 13,1:sp_on 14,0
66290 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66300 '0 ボタン  左　何もしない
66310 case 0:
66320 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66330 case 3:
66340 No=2:sp_on 9,1:sp_on 12,0:
66350 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66360 case 2:
66370 No=1:sp_on 6,1:sp_on 9,0:
66380 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66390 case 1:
66400 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66410 case 6:
66420 No=5:sp_on 8,1:sp_on 11,0
66430 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66440 case 5:
66450 No=4:sp_on 5,1:sp_on 8,0
66460 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66470 case 4:
66480 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66490 case 9:
66500 No=8:sp_on 7,1:sp_on 10,0
66510 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66520 case 8:
66530 No=7:sp_on 4,1:sp_on 7,0
66540 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66550 case 7:
66560 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66570 end select
66580 endif
66590 '右  十字キー　右　or カーソル　右
66600 if ((y2 = 1) or (key$ = chr$(28))) then
66610 select case No
66620 '0ボタンからokボタン右に移動
66630 case 0:
66640 No=-1:sp_on 14,1:sp_on 13,0
66650 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66660 '0ボタンからokボタン 右に移動　ここまで
66670 'OKボタンで右を押して何もしない
66680 case -1:
66690 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66700 case 1:
66710 No=2:sp_on 9,1:sp_on 6,0
66720 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66730 case 2:
66740 No=3:sp_on 12,1:sp_on 9,0
66750 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66760 case 3:
66770 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66780 case 4:
66790 No=5:sp_on 8,1:sp_on 5,0
66800 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66810 case 5:
66820 No=6:sp_on 11,1:sp_on 8,0
66830 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66840 case 7:
66850 No=8:sp_on 7,1:sp_on 4,0
66860 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66870 case 8:
66880 No=9:sp_on 10,1:sp_on 7,0
66890 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66900 case 9:
66910 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66920 case 6:
66930 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66940 end select
66950 'Okから右ボタンを押して何もしない ここまで
66960 endif
66970 '十字キー　ここまで
66980 '==============================
66990 'ここから
67000 '==============================
67010 if ((bg = 2) or (key$ = chr$(13))) then
67020 select case count
67030 case 0:
67040 count = 1
67050 if (No = -1) then
67060 count = 0:No=0
67070 buf_feMale_Born_Day(0) = No
67080 'Okボタンを押したとき
67090 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67100 else
67110 'Okボタン以外が押されたとき
67120 if (No >= 1 and No <= 2) then
67130 buf_female_year$="":buf_female_year$ = str$(No) + "***"
67140 buf_female_year = No:a= No
67150 buf_Jyoushi_Born_Day(0) = No
67160 locate 1,3
67170 color rgb(255,255,255)
67180 print "女性の生まれた年代(西暦4桁):";buf_female_year$
67190 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67200 else
67210 count=0
67220 ui_msg"数字が範囲外になります。"
67230 buf_female_year$="":buf_female_year=0
67240 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67250 endif
67260 endif
67270 case 1:
67280 count = 2
67290 if (No = -1) then
67300 count = 1
67310 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67320 else
67330 buf_female_year = a * 10 + No
67340 b=buf_female_year
67350 buf_year$ = str$(buf_female_year) + "**"
67360 buf_Jyoushi_Born_Day(0)=buf_female_year
67370 locate 1,3
67380 color rgb(255,255,255)
67390 print "                                                                "
67400 locate 1,3
67410 print "女性の生まれた年代(西暦4桁):" + buf_female_year$
67420 'if (No = -1) then
67430 'count=1
67440 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67450 endif
67460 case 2:
67470 count=3
67480 if (No=-1) then
67490 count =2
67500 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67510 else
67520 buf_female_year = b * 10 + No
67530 c=buf_female_year
67540 buf_female_year$ = str$(buf_female_year) + "*"
67550 buf_Jyoushi_Born_Day(0) = buf_female_year
67560 locate 1,3
67570 color rgb(255,255,255)
67580 print "                                        "
67590 locate 1,3
67600 print "女性の生まれた年代(西暦4桁):";buf_female_year$
67610 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67620 endif
67630 case 3:
67640 count=4
67650 if (No = -1) then
67660 No=0
67670 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67680 else
67690 buf_female_year = c * 10 + No
67700 buf_female_year$ = str$(buf_female_year)
67710 buf_Jyoushi_Born_Day(0) = buf_female_year
67720 locate 1,3
67730 color RGB(255,255,255)
67740 print "                                      "
67750 locate 1,3
67760 print "女性の生まれた年代(西暦4桁):";buf_female_year$
67770 buf_female_year=val(buf_female_year$)
67780 'year=val(buf_year$)
67790 'if (No=-1) then
67800 'goto Input_Born_Month:
67810 'else
67820 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67830 endif
67840 case 4:
67850 'bufyear=buf_year
67860 if (No=-1) then
67870 buf_female_year = val(buf_female_year$)
67880 buf_Jyoushi_Born_Day(0)=buf_female_year
67890 sp_on 14,0:No=0
67900 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67910 else
67920 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67930 endif
67940 end select
67950 endif
67960 '===========================
67970 'ここまでを部下のところにコピーする.
67980 '===========================
67990 if (bg2 = 2) then
68000 select case count2
68010 case 0:
68020 if (No = -1) then
68030 buf_female_year=0:buf_female_year$=trim$(""):buf_female_year$=trim$("****")
68040 count=0
68050 locate 1,3
68060 color rgb(255,255,255)
68070 print "                                      "
68080 locate 1,3
68090 print "女性の生まれた年代（西暦4桁):" + buf_female_year$
68100 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
68110 else
68120 '(buf_year=0) then
68130 buf_female_year=0:buf_year$="****"
68140 locate 1,3
68150 print "                                       "
68160 locate 1,3
68170 print "女性の生まれた年代(西暦4桁):"+buf_female_year$
68180 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
68190 'endif
68200 endif
68210 end select
68220 endif
68230 '-------生まれた年代　女性 ここまで-------------
68240 '-------生まれた月　女性 ここまで--------------
68250 Danjyo_Aisyou_Input_feMale_Born_Month:
68260 cls 3:play "":count=0:count2=0
68270 'No=-1:Okのとき
68280 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_female_Month$ = "**":buf_female_month=0
68290 for i=0 to 1
68300 buf_month(i)=0
68310 next i
68320 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
68330 '****************************************************************************************************
68340 'WUXG(1920x1200)の時ここから
68350 '****************************************************************************************************
68360 gload Gazo$ + "Screen1.png",0,0,0
68370 gload Gazo$ + "downscreen.png",0,0,800
68380 '****************************************************************************************************
68390 'WUXG(1920x1200)の時ここから
68400 '****************************************************************************************************
68410 'Init"kb:4"
68420 '音声ファイル再生 2023.06.07
68430 play Voice$ + "Input_Born_Month_Jyoushi_20230831.mp3"
68440 font 48
68450 locate 0,1
68460 '文字色：黒　 color rgb(0,0,0)
68470 '文字色:白
68480 color rgb(255,255,255)
68490 print "女性の生まれた月を入れて下さい" + chr$(13)
68500 '文字色:白
68510 color rgb(255,255,255)
68520 locate 1,3
68530 '文字色:白
68540 print "女性の生まれた月(1月~12月):"+buf_female_Month$
68550 color rgb(255,255,255)
68560 'locate 4,6:print ":7"
68570 'locate 9,6:print ":8"
68580 'locate 12,6:print ":9"
68590 locate 4,6
68600 '文字色:赤
68610 print ":7  :8  :9" + chr$(13)
68620 color rgb(255,255,255)
68630 locate 4,8
68640 print ":4  :5  :6" + chr$(13)
68650 color rgb(255,255,255)
68660 locate 4,10
68670 print ":1  :2  :3" + chr$(13)
68680 locate 4,12
68690 print "    :0"
68700 locate 12,12
68710 color rgb(0,0,255)
68720 print ":Ok"
68730 sp_on 4,0: sp_on 5,0:sp_on 6,0
68740 sp_on 7,0:sp_on 8,0:sp_on 9,0
68750 sp_on 10,0:sp_on 11,0:sp_on 12,0
68760 sp_on 13,0:sp_on 14,1
68770 '---------------------------------------------
68780 Danjyo_Aisyou_Input_feMale_Born_Month2:
68790 key$="":bg=0:y=0:y2=0:bg2=0
68800 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
68810 key$ = inkey$
68820 bg = strig(1)
68830 y = stick(1)
68840 y2 = stick(0)
68850 bg2 = strig(0)
68860 pause 200
68870 wend
68880 '十字キー　ここから
68890 '上の矢印　または、十字キー上
68900 if ((y = -1) or (key$ = chr$(30))) then
68910 select case No
68920 'No=-1:okのとき:初期の状態
68930 '0kボタンから３に移動
68940 '上に行く 処理
68950 case -1:
68960 No=3:sp_on 12,1:sp_on 14,0
68970 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68980 '選択肢:3
68990 '3ボタンから 6に移動
69000 case 3:
69010 No=6:sp_on 12,0:sp_on 11,1
69020 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69030 '6ボタンから ９に移動
69040 case 6:
69050 No=9:sp_on 10,1:sp_on 11,0
69060 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69070 '6ボタンから ９に移動　ここまで
69080 '9で上を押して何もしない
69090 case 9:
69100 '何もしない
69110 No=9
69120 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69130 '9で上を押しても何もしない　ここまで
69140 '上　 0ボタンから2ボタン
69150 'sp_on 6,1:1
69160 'sp_on 8,1:5
69170 'sp_on 7,1:7
69180 case 0:
69190 No=2:sp_on 13,0:sp_on 9,1:
69200 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69210 '上  0ボタンから2ボタン　ここまで
69220 '2から５になる 上
69230 case 2:
69240 No=5:sp_on 8,1:sp_on 9,0:
69250 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69260 case 5:
69270 No=8:sp_on 7,1:sp_on 8,0
69280 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69290 case 8:
69300 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69310 case 1:
69320 No=4:sp_on 5,1:sp_on 6,0
69330 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69340 case 4:
69350 No=7:sp_on 4,1:sp_on 5,0
69360 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69370 case 7:
69380 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69390 end select
69400 endif
69410 '左３　ここまで
69420 '下の矢印
69430 '中央 2
69440 if ((y=1) or (key$ = chr$(31))) then
69450 select case No
69460 '9から６に下げる
69470 case 9:
69480 No=6:sp_on 11,1:sp_on 10,0
69490 pause 200:goto　Danjyo_Aisyou_Input_feMale_Born_Month2:
69500 '6から３に下げる
69510 case 6:
69520 No=3:sp_on 12,1:sp_on 11,0
69530 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69540 '3から０ｋに変える
69550 case 3:
69560 No=-1:sp_on 14,1:sp_on 12,0
69570 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69580 'Okから下のボタンを押しても何もしない
69590 case -1:
69600 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69610 case 8:
69620 No=5:sp_on 8,1:sp_on 7,0
69630 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69640 case 5:
69650 No=2:sp_on 9,1:sp_on 8,0
69660 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69670 case 2:
69680 No=0:sp_on 13,1:sp_on 9,0
69690 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69700 case 0:
69710 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69720 case 7:
69730 No=4:sp_on 5,1:sp_on 4,0
69740 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69750 case 4:
69760 No=1:sp_on 6,1:sp_on 5,0
69770 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69780 case 1:
69790 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69800 end select
69810 endif
69820 '左へボタン 十字キー　左　or 　カーソル左
69830 if ((y2 = -1) or (key$ = chr$(29))) then
69840 select case No
69850 'Ok ボタン  Okから　左　０に行く
69860 case -1:
69870 No=0:sp_on 13,1:sp_on 14,0
69880 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69890 '0 ボタン  左　何もしない
69900 case 0:
69910 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69920 case 3:
69930 No=2:sp_on 9,1:sp_on 12,0:
69940 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69950 case 2:
69960 No=1:sp_on 6,1:sp_on 9,0:
69970 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69980 case 1:
69990 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70000 case 6:
70010 No=5:sp_on 8,1:sp_on 11,0
70020 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70030 case 5:
70040 No=4:sp_on 5,1:sp_on 8,0
70050 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70060 case 4:
70070 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70080 case 9:
70090 No=8:sp_on 7,1:sp_on 10,0
70100 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70110 case 8:
70120 No=7:sp_on 4,1:sp_on 7,0
70130 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70140 case 7:
70150 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70160 end select
70170 endif
70180 '右  十字キー　右　or カーソル　右
70190 if ((y2 = 1) or (key$ = chr$(28))) then
70200 select case No
70210 '0ボタンからokボタン右に移動
70220 case 0:
70230 No=-1:sp_on 14,1:sp_on 13,0
70240 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70250 '0ボタンからokボタン 右に移動　ここまで
70260 'OKボタンで右を押して何もしない
70270 case -1:
70280 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70290 case 1:
70300 No=2:sp_on 9,1:sp_on 6,0
70310 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70320 case 2:
70330 No=3:sp_on 12,1:sp_on 9,0
70340 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70350 case 3:
70360 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70370 case 4:
70380 No=5:sp_on 8,1:sp_on 5,0
70390 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70400 case 5:
70410 No=6:sp_on 11,1:sp_on 8,0
70420 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70430 case 7:
70440 No=8:sp_on 7,1:sp_on 4,0
70450 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70460 case 8:
70470 No=9:sp_on 10,1:sp_on 7,0
70480 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70490 case 9:
70500 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70510 case 6:
70520 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70530 end select
70540 'Okから右ボタンを押して何もしない ここまで
70550 endif
70560 '十字キー　ここまで
70570 '右の丸ボタン + Enter key 決定キー
70580 if ((bg=2) or (key$=chr$(13))) then
70590 select case count
70600 case 0:
70610 if (No=-1) then No=0
70620 count = 1:buf_female_Month$ = "**":buf_female_Month$ = str$(No):buf_female_month = No:c=No
70630 if (buf_female_month > 1 and buf_female_month < 10)  then
70640 buf_female_Month$ = str$(buf_female_month)
70650 'buf_month=No
70660 endif
70670 if (buf_female_month = 1)  then
70680 buf_female_Month$ = str$(buf_female_month) + "*"
70690 'c=buf_month
70700 endif
70710 locate 1,3
70720 print "                                     "
70730 color RGB(255,255,255)
70740 locate 1,3
70750 print "女性の生まれた月(1月~12月):" + buf_female_Month$
70760 goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70770 case 1:
70780 count = 2:
70790 'c = val(buf_Month$)
70800 if (No = -1) then
70810 'count=0
70820 No=0
70830 month=buf_female_month
70840 buf_female_month=val(buf_female_Month$)
70850 month=buf_female_month
70860 buf_Jyoushi_Born_Day(1)=month
70870 '生まれた日に飛ぶ
70880 goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70890 else
70900 buf_female_month = c*10 + No
70910 'if (buf_month = 1) then
70920 'buf_Month$ = str$(buf_month)
70930 'endif
70940 buf_female_Month$ = str$(buf_female_month)
70950 buf_Jyoushi_Born_Day(1) = buf_female_month
70960 locate 0,3
70970 print "                                           "
70980 locate 1,3
70990 color Rgb(255,255,255)
71000 print "女性の生まれた月(1月~12月):" + buf_female_Month$
71010 goto Danjyo_Aisyou_Input_feMale_Born_Month2:
71020 endif
71030 case 2:
71040 '==================================
71050 '何もしない
71060 'coun = 2
71070 '==================================
71080 'c= val(buf_Month$)
71090 'buf_month = c*10 + No
71100 'buf_Month$ = str$(buf_month)
71110 'locate 2,3
71120 'print "上司の生まれた月(1月～12月):";buf_Month$
71130 'goto Jyoushi_Input_Born_Month2:
71140 'case 3:
71150 'count=4
71160 'b=val(buf_month$)
71170 'buf_month=c*10+No
71180 'buf_Month$=str$(buf_month)
71190 'locate 2,3
71200 'print "上司の生まれた月(1月～12月):";buf_Month$
71210 'buf_month=val(buf_Month$)
71220 'year=val(buf_year$)
71230 if (No=-1) then
71240 No=0
71250 goto Danjyo_Aisyou_Input_Male_Born_Day:
71260 else
71270 goto Danjyo_Aisyou_Input_Male_Born_Day2:
71280 endif
71290 'case 4:
71300 'bufyear=buf_year
71310 'if (No=-1) then
71320 'buf_month = val(buf_Month$)
71330 'month = buf_month
71340 'sp_on 14,0
71350 'goto Input_Born_Day:
71360 'else
71370 'goto Input_Born_Month2:
71380 'endif
71390 end select
71400 endif
71410 '左の丸ボタン　キャンセル
71420 if (bg2=2) then
71430 select case count2
71440 case 0:
71450 if (No = -1) then
71460 buf_female_month=0:buf_female_Month$="**"
71470 count=0
71480 'goto rewrite2:
71490 else
71500 if ((No >= 1 and No <= 9) or (No >= 10 and No <= 12)) then
71510 buf_female_month = 0:buf_female_Month$ = "**"
71520 locate 0,3
71530 color rgb(255,255,255)
71540 print "                                       "
71550 goto rewrite2:
71560 if (No>12) then
71570 ui_msg"値が範囲外です。"
71580 goto rewrite2:
71590 endif
71600 endif
71610 endif
71620 rewrite2:
71630 locate 2,3
71640 color rgb(255,255,255)
71650 print "                                      "
71660 locate 2,3
71670 print "女性の生まれた月(1月~12月):"+buf_female_Month$
71680 goto Danjyo_Aisyou_Input_feMale_Born_Month2:
71690 end select
71700 'endif
71710 endif
71720 end
71730 '-------生まれた月　女性 ここまで-------------
71740 '-------生まれた日　女性 ここまで-------------
71750 Danjyo_Aisyou_Input_feMale_Born_Day:
71760 cls 3:play "":count=0:count2=0
71770 'No=-1:Okのとき
71780 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_female_Day$ = "**":buf_female_day = 0
71790 for i=0 to 1
71800 buf_female_day(i)=0
71810 next i
71820 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
71830 '****************************************************************************************************
71840 'WUXG(1920x1200)の時ここから
71850 '****************************************************************************************************
71860 gload Gazo$ + "Screen1.png",0,0,0
71870 gload Gazo$ + "downscreen.png",0,0,800
71880 '****************************************************************************************************
71890 'WUXG(1920x1200)の時ここまで
71900 '****************************************************************************************************
71910 'Init"kb:4"
71920 '音声ファイル再生 2023.06.07
71930 play Voice$ + "Input_Born_Month_Jyoushi_20230831.mp3"
71940 font 48
71950 locate 0,1
71960 '文字色：黒　 color rgb(0,0,0)
71970 '文字色:白
71980 color rgb(255,255,255)
71990 print "女性の生まれた日を入れて下さい" + chr$(13)
72000 '文字色:白
72010 color rgb(255,255,255)
72020 locate 1,3
72030 '文字色:白
72040 print "女性の生まれた日(1月~31月):" + buf_female_Day$
72050 color rgb(255,255,255)
72060 'locate 4,6:print ":7"
72070 'locate 9,6:print ":8"
72080 'locate 12,6:print ":9"
72090 locate 4,6
72100 '文字色:赤
72110 print ":7  :8  :9" + chr$(13)
72120 color rgb(255,255,255)
72130 locate 4,8
72140 print ":4  :5  :6" + chr$(13)
72150 color rgb(255,255,255)
72160 locate 4,10
72170 print ":1  :2  :3" + chr$(13)
72180 locate 4,12
72190 print "    :0"
72200 locate 12,12
72210 color rgb(0,0,255)
72220 print ":Ok"
72230 sp_on 4,0: sp_on 5,0:sp_on 6,0
72240 sp_on 7,0:sp_on 8,0:sp_on 9,0
72250 sp_on 10,0:sp_on 11,0:sp_on 12,0
72260 sp_on 13,0:sp_on 14,1
72270 '---------------------------------------------
72280 Danjyo_Aisyou_Input_feMale_Born_Day2:
72290 key$="":bg=0:y=0:y2=0:bg2=0
72300 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
72310 key$ = inkey$
72320 bg = strig(1)
72330 y = stick(1)
72340 y2 = stick(0)
72350 bg2 = strig(0)
72360 pause 200
72370 wend
72380 '十字キー　ここから
72390 '上の矢印　または、十字キー上
72400 if ((y = -1) or (key$ = chr$(30))) then
72410 select case No
72420 'No=-1:okのとき:初期の状態
72430 '0kボタンから３に移動
72440 '上に行く 処理
72450 case -1:
72460 No=3:sp_on 12,1:sp_on 14,0
72470 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72480 '選択肢:3
72490 '3ボタンから 6に移動
72500 case 3:
72510 No=6:sp_on 12,0:sp_on 11,1
72520 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72530 '6ボタンから ９に移動
72540 case 6:
72550 No=9:sp_on 10,1:sp_on 11,0
72560 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72570 '6ボタンから ９に移動　ここまで
72580 '9で上を押して何もしない
72590 case 9:
72600 '何もしない
72610 No=9
72620 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72630 '9で上を押しても何もしない　ここまで
72640 '上　 0ボタンから2ボタン
72650 'sp_on 6,1:1
72660 'sp_on 8,1:5
72670 'sp_on 7,1:7
72680 case 0:
72690 No=2:sp_on 13,0:sp_on 9,1:
72700 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72710 '上  0ボタンから2ボタン　ここまで
72720 '2から５になる 上
72730 case 2:
72740 No=5:sp_on 8,1:sp_on 9,0:
72750 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72760 case 5:
72770 No=8:sp_on 7,1:sp_on 8,0
72780 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72790 case 8:
72800 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72810 case 1:
72820 No=4:sp_on 5,1:sp_on 6,0
72830 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72840 case 4:
72850 No=7:sp_on 4,1:sp_on 5,0
72860 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72870 case 7:
72880 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72890 end select
72900 endif
72910 '左３　ここまで
72920 '下の矢印
72930 '中央 2
72940 if ((y=1) or (key$ = chr$(31))) then
72950 select case No
72960 '9から６に下げる
72970 case 9:
72980 No=6:sp_on 11,1:sp_on 10,0
72990 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73000 '6から３に下げる
73010 case 6:
73020 No=3:sp_on 12,1:sp_on 11,0
73030 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73040 '3から０ｋに変える
73050 case 3:
73060 No=-1:sp_on 14,1:sp_on 12,0
73070 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73080 'Okから下のボタンを押しても何もしない
73090 case -1:
73100 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73110 case 8:
73120 No=5:sp_on 8,1:sp_on 7,0
73130 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73140 case 5:
73150 No=2:sp_on 9,1:sp_on 8,0
73160 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73170 case 2:
73180 No=0:sp_on 13,1:sp_on 9,0
73190 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73200 case 0:
73210 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73220 case 7:
73230 No=4:sp_on 5,1:sp_on 4,0
73240 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73250 case 4:
73260 No=1:sp_on 6,1:sp_on 5,0
73270 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73280 case 1:
73290 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73300 end select
73310 endif
73320 '左へボタン 十字キー　左　or 　カーソル左
73330 if ((y2 = -1) or (key$ = chr$(29))) then
73340 select case No
73350 'Ok ボタン  Okから　左　０に行く
73360 case -1:
73370 No=0:sp_on 13,1:sp_on 14,0
73380 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73390 '0 ボタン  左　何もしない
73400 case 0:
73410 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73420 case 3:
73430 No=2:sp_on 9,1:sp_on 12,0:
73440 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73450 case 2:
73460 No=1:sp_on 6,1:sp_on 9,0:
73470 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73480 case 1:
73490 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73500 case 6:
73510 No=5:sp_on 8,1:sp_on 11,0
73520 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73530 case 5:
73540 No=4:sp_on 5,1:sp_on 8,0
73550 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73560 case 4:
73570 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73580 case 9:
73590 No=8:sp_on 7,1:sp_on 10,0
73600 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73610 case 8:
73620 No=7:sp_on 4,1:sp_on 7,0
73630 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73640 case 7:
73650 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73660 end select
73670 endif
73680 '右  十字キー　右　or カーソル　右
73690 if ((y2 = 1) or (key$ = chr$(28))) then
73700 select case No
73710 '0ボタンからokボタン右に移動
73720 case 0:
73730 No=-1:sp_on 14,1:sp_on 13,0
73740 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73750 '0ボタンからokボタン 右に移動　ここまで
73760 'OKボタンで右を押して何もしない
73770 case -1:
73780 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73790 case 1:
73800 No=2:sp_on 9,1:sp_on 6,0
73810 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73820 case 2:
73830 No=3:sp_on 12,1:sp_on 9,0
73840 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73850 case 3:
73860 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73870 case 4:
73880 No=5:sp_on 8,1:sp_on 5,0
73890 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73900 case 5:
73910 No=6:sp_on 11,1:sp_on 8,0
73920 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73930 case 7:
73940 No=8:sp_on 7,1:sp_on 4,0
73950 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73960 case 8:
73970 No=9:sp_on 10,1:sp_on 7,0
73980 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73990 case 9:
74000 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
74010 case 6:
74020 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
74030 end select
74040 'Okから右ボタンを押して何もしない ここまで
74050 endif
74060 '十字キー　ここまで
74070 '右の丸ボタン + Enter key 決定キー
74080 if ((bg=2) or (key$=chr$(13))) then
74090 select case count
74100 case 0:
74110 if (No=-1) then No=0
74120 count = 1:buf_female_Day$ = "**":buf_female_Day$ = str$(No):buf_female_day = No:c=No
74130 if (buf_female_day > 1 and buf_female_day < 10)  then
74140 buf_female_Day$ = str$(buf_female_day)
74150 'buf_month=No
74160 endif
74170 if (buf_female_day = 1)  then
74180 buf_female_Day$ = str$(buf_female_day) + "*"
74190 'c=buf_month
74200 endif
74210 locate 1,3
74220 print "                                     "
74230 color RGB(255,255,255)
74240 locate 1,3
74250 print "女性の生まれた日(1月~31月):" + buf_female_Day$
74260 goto Danjyo_Aisyou_Input_feMale_Born_Day2:
74270 case 1:
74280 count = 2:
74290 'c = val(buf_Month$)
74300 if (No = -1) then
74310 'count=0
74320 No=0
74330 day=buf_female_day
74340 buf_female_day=val(buf_female_day$)
74350 day=bu_female_day
74360 buf_female_day(1)=day
74370 '生まれた日に飛ぶ
74380 goto Danjyo_Aisyou_Input_feMale_Born_Day2:
74390 else
74400 bu_female_day = c*10 + No
74410 'if (buf_month = 1) then
74420 'buf_Month$ = str$(buf_month)
74430 'endif
74440 buf_female_day$ = str$(buf_female_day)
74450 buf_female_day(1) = buf_female_day
74460 locate 0,3
74470 print "                                           "
74480 locate 1,3
74490 color Rgb(255,255,255)
74500 print "女性の生まれた日(1月~31月):" + buf_female_Day$
74510 goto Danjyo_Aisyou_Input_feMale_Born_Day2:
74520 endif
74530 case 2:
74540 '==================================
74550 '何もしない
74560 'coun = 2
74570 '==================================
74580 'c= val(buf_Month$)
74590 'buf_month = c*10 + No
74600 'buf_Month$ = str$(buf_month)
74610 'locate 2,3
74620 'print "上司の生まれた月(1月～12月):";buf_Month$
74630 'goto Jyoushi_Input_Born_Month2:
74640 'case 3:
74650 'count=4
74660 'b=val(buf_month$)
74670 'buf_month=c*10+No
74680 'buf_Month$=str$(buf_month)
74690 'locate 2,3
74700 'print "上司の生まれた月(1月～12月):";buf_Month$
74710 'buf_month=val(buf_Month$)
74720 'year=val(buf_year$)
74730 if (No=-1) then
74740 No=0
74750 goto Danjyo_Aisyou_Input_Male_Born_Day:
74760 else
74770 goto Danjyo_Aisyou_Input_feMale_Born_Day2:
74780 endif
74790 'case 4:
74800 'bufyear=buf_year
74810 'if (No=-1) then
74820 'buf_month = val(buf_Month$)
74830 'month = buf_month
74840 'sp_on 14,0
74850 'goto Input_Born_Day:
74860 'else
74870 'goto Input_Born_Month2:
74880 'endif
74890 end select
74900 endif
74910 '左の丸ボタン　キャンセル
74920 if (bg2=2) then
74930 select case count2
74940 case 0:
74950 if (No = -1) then
74960 buf_female_day=0:buf_female_Day$="**"
74970 count=0
74980 'goto rewrite2:
74990 else
75000 if ((No >= 1 and No <= 9) or (No >= 10 and No <= 12)) then
75010 buf_female_day = 0:buf_female_Day$ = "**"
75020 locate 0,3
75030 color rgb(255,255,255)
75040 print "                                       "
75050 goto rewrite2:
75060 if (No>12) then
75070 ui_msg"値が範囲外です。"
75080 goto rewrite2:
75090 endif
75100 endif
75110 endif
75120 rewrite2:
75130 locate 2,3
75140 color rgb(255,255,255)
75150 print "                                      "
75160 locate 2,3
75170 print "女性の生まれた日(1月~31月):"+buf_female_Day$
75180 goto Danjyo_Aisyou_Input_feMale_Born_Day2:
75190 end select
75200 'endif
75210 endif
75220 end
75230 '-------生まれた日　女性 ここまで-------------
75240 '1.男女の相性 ここまで
75250 '2.ビジネスの相性　
75260 '1.1人目のビジネスの相性　名前入力　1人目
75270 Business_Aishou_Input_1_parson:
75280 No=0:color RGB(255,255,255)
75290 cls 3:init "kb:2"
75300 '****************************************************************************************************
75310 'WUXG(1920x1200)の時ここから
75320 '****************************************************************************************************
75330 gload Gazo$ + "Screen1.png",0,0,0
75340 gload Gazo$ + "downscreen.png",0,0,800
75350 '****************************************************************************************************
75360 'WUXG(1920x1200)の時ここまで
75370 '****************************************************************************************************
75380 play "":color rgb(255,0,0):name$ = ""
75390 locate 0,1
75400 print "ビジネスの相性 1人目" + chr$(13) + chr$(13)
75410 color rgb(255,255,255):
75420 locate 0,3
75430 print "ビジネスの相性を求めます。1人目の名前を" + chr$(13)
75440 print "入れてください" + chr$(13)
75450 locate 0,15:color rgb(0,0,0)
75460 Input "1人目の名前:",name$
75470 'color rgb(0,0,0)
75480 'locate 0,13:print "                                     "
75490 'locate 0,13:print "1人目の名前を入力してエンターキー":
75500 'buffer_name$(0):1人目の名前
75510 buffer_name$(0) = name$:
75520 goto Business_Aishou_Input_2_Parson:
75530 '2.2人目のビジネスの相性 名前入力 2人目
75540 Business_Aishou_Input_2_Parson:
75550 cls 3:init "kb:2":name$ = "":No=0
75560 '****************************************************************************************************
75570 'WUXG(1920x1200)の時ここから
75580 '****************************************************************************************************
75590 gload Gazo$ + "Screen1.png",0,0,0
75600 gload Gazo$ + "downscreen.png",0,0,800
75610 '****************************************************************************************************
75620 'WUXG(1920x1200)の時ここまで
75630 '****************************************************************************************************
75640 color rgb(255,0,0)
75650 'Title
75660 locate 0,1
75670 print "ビジネスの相性　2人目"
75680 locate 0,3
75690 color rgb(255,255,255)
75700 print "ビジネスの相性を求めます。2人目の名前を" + chr$(13)
75710 print "入れてください" + chr$(13)
75720 locate 0,15:color rgb(0,0,0)
75730 Input "2人目の名前:",name$
75740 'color rgb(0,0,0)
75750 'locate 0,15:print "                                              "
75760 'locate 0,15:print "2人目の名前を入力してエンター ":
75770 '2人目
75780 '2人目の名前を入れるに代入
75790 buffer_name$(1) = name$:
75800 goto Select_jyoushi:
75810 '3.上司の選択
75820 Select_jyoushi:
75830 '****************************************************************************************************
75840 'WUXG(1920x1200)の時ここから
75850 '****************************************************************************************************
75860 cls 3:gload Gazo$ + "Screen1.png",0,0,0
75870 gload Gazo$ + "downscreen.png",0,0,800
75880 '****************************************************************************************************
75890 'WUXG(1920x1200)の時ここまで
75900 '****************************************************************************************************
75910 init "kb:4":No=0
75920 color rgb(0,0,255)
75930 locate 1,1
75940 print "上司の選択"
75950 color rgb(255,255,255)
75960 locate 0,4:print "名前から上司の方を選んでください"
75970 locate 0,6
75980 print " :";buffer_name$(0);"が上 司";chr$(13)
75990 locate 0,8
76000 print " :";buffer_name$(1);"が上 司";chr$(13)
76010 locate 0,15:
76020 print "                                     "
76030 locate 0,15:color rgb(0,0,0)
76040 print "上司の方を選んで右の丸ボタン"
76050 sp_on 0,1:sp_on 1,0:sp_on 2,0
76060 Select_jyoushi2:
76070 'ここでNo=0をおいてはいけない
76080 y=0:key$="":bg=0:
76090 while ((key$ <> chr$(13)) and (y <> 1) and (y <> -1) and (bg <> 2))
76100 y = stick(1)
76110 key$ = inkey$
76120 bg = strig(1)
76130 pause 5
76140 wend
76150 '1.カーソル下の処理　or 十字キーの下処理
76160 if ((key$ = chr$(31)) or (y = 1)) then
76170 select case No
76180 case 0:
76190 No=1:sp_on 1,1:sp_on 0,0:pause 200:goto Select_jyoushi2:'上司の方を選択
76200 case 1:
76210 No=0:sp_on 0,1:sp_on 1,0:pause 200:goto Select_jyoushi2:'上司の方を選択
76220 end select
76230 endif
76240 '2.カーソル上処理　or 十字キーの上の処理
76250 if ((key$ = chr$(30)) or (y = -1)) then
76260 select case No
76270 case 0:
76280 No=1:sp_on 1,1:sp_on 0,0:pause 200:goto Select_jyoushi2:
76290 case 1:
76300 No=0:sp_on 0,1:sp_on 1,0:pause 200:goto Select_jyoushi2:
76310 end select
76320 endif
76330 if ((key$ = chr$(13)) or (bg = 2)) then
76340 select case No
76350 case 0:
76360 '上司(name1)を配列に代入
76370 buffer_name$(2) = buffer_name$(0):cls 3:color rgb(255,255,255):print buffer_name$(2);chr$(13):sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:goto Jyoushi_Input_Seireki:
76380 case 1:
76390 '上司（name2)を配列に代入
76400 buffer_name$(2) = buffer_name$(1):print buffer_name$(2);chr$(13):sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:goto Jyoushi_Input_Seireki:
76410 end select
76420 endif
76430 '3.決定ボタン　Enter or 右の丸ボタン
76440 '1.誕生日入力
76450 '1-1.生まれた年を入力
76460 'Jyoushi_born_year:
76470 'cls 3:gload Gazo$ + "Screen1.png",0,0,0
76480 '---------------------------------------------'
76490 '誕生日入力(生れた年代)
76500 Jyoushi_Input_Seireki:
76510 'buf_Jyoushi_Born_Year:上司の生まれた年代
76520 'buf_Jyoushi_Born_Day(0) = born_year
76530 cls 3:play "":count=0:count2=0
76540 init"kb:4"
76550 'No=-1:Okのとき
76560 :key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_year$ = "****"
76570 for i=0 to 3
76580 buf_Jyoushi_Born_Day(i)=0
76590 next i
76600 '****************************************************************************************************
76610 'WUXG(1920x1200)の時ここから
76620 '****************************************************************************************************
76630 gload Gazo$ + "Screen2.png",0,0,0
76640 gload Gazo$ + "downscreen.png",0,0,800
76650 '****************************************************************************************************
76660 'WUXG(1920x1200)の時ここまで
76670 '****************************************************************************************************
76680 'Init"kb:2"
76690 '音声ファイル再生 2023.06.07
76700 play Voice$ + "Input_Born_Year_Jyoushi_20230831.mp3"
76710 font 48
76720 locate 0,1
76730 '文字色：黒　 color rgb(0,0,0)
76740 color rgb(255,255,255)
76750 print "上司の生まれた年代を入れて下さい" + chr$(13)
76760 color rgb(255,255,255)
76770 locate 1,3
76780 print "上司の生まれた年代(西暦4桁):";buf_year$
76790 color rgb(255,255,255)
76800 'locate 4,6:print ":7"
76810 'locate 9,6:print ":8"
76820 'locate 12,6:print ":9"
76830 'locate 4,6
76840 'print ":7  :8  :9" + chr$(13)
76850 'color rgb(255,255,255)
76860 'locate 4,8
76870 'print ":4  :5  :6" + chr$(13)
76880 'color rgb(255,255,255)
76890 'locate 4,10
76900 'print ":1  :2  :3" + chr$(13)
76910 'locate 4,12
76920 'print "    :0"
76930 'locate 12,12
76940 'color rgb(0,0,255)
76950 'print ":Ok"
76960 sp_on 4,0: sp_on 5,0:sp_on 6,0
76970 sp_on 7,0:sp_on 8,0:sp_on 9,0
76980 sp_on 10,0:sp_on 11,0:sp_on 12,0
76990 sp_on 13,0:sp_on 14,1
77000 Jyoushi_Input_Seireki2:
77010 key$="":bg=0:y=0:y2=0:bg2=0:
77020 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
77030 key$ = inkey$
77040 bg = strig(1)
77050 y = stick(1)
77060 y2 = stick(0)
77070 bg2=strig(0)
77080 pause 200
77090 wend
77100 '十字キー　ここから
77110 '上の矢印　または、十字キー上
77120 if ((y = -1) or (key$ = chr$(30))) then
77130 select case No
77140 'No=-1:okのとき:初期の状態
77150 '0kボタンから３に移動
77160 '上に行く 処理
77170 case -1:
77180 No=3:sp_on 12,1:sp_on 14,0
77190 pause 200:goto Jyoushi_Input_Seireki2:
77200 '選択肢:3
77210 '3ボタンから 6に移動
77220 case 3:
77230 No=6:sp_on 12,0:sp_on 11,1
77240 pause 200:goto Jyoushi_Input_Seireki2:
77250 '6ボタンから ９に移動
77260 case 6:
77270 No=9:sp_on 10,1:sp_on 11,0
77280 pause 200:goto Jyoushi_Input_Seireki2:
77290 '6ボタンから ９に移動　ここまで
77300 '9で上を押して何もしない
77310 case 9:
77320 '何もしない
77330 No=9
77340 pause 200:goto Jyoushi_Input_Seireki2:
77350 '9で上を押しても何もしない　ここまで
77360 '上　 0ボタンから2ボタン
77370 'sp_on 6,1:1
77380 'sp_on 8,1:5
77390 'sp_on 7,1:7
77400 case 0:
77410 No=2:sp_on 13,0:sp_on 9,1:
77420 pause 200:goto Jyoushi_Input_Seireki2:
77430 '上  0ボタンから2ボタン　ここまで
77440 '2から５になる 上
77450 case 2:
77460 No=5:sp_on 8,1:sp_on 9,0:
77470 pause 200:goto Jyoushi_Input_Seireki2:
77480 case 5:
77490 No=8:sp_on 7,1:sp_on 8,0
77500 pause 200:goto Jyoushi_Input_Seireki2:
77510 case 8:
77520 pause 200:goto Jyoushi_Input_Seireki2:
77530 case 1:
77540 No=4:sp_on 5,1:sp_on 6,0
77550 pause 200:goto Jyoushi_Input_Seireki2:
77560 case 4:
77570 No=7:sp_on 4,1:sp_on 5,0
77580 pause 200:goto Jyoushi_Input_Seireki2:
77590 case 7:
77600 pause 200:goto Jyoushi_Input_Seireki2:
77610 end select
77620 endif
77630 '左３　ここまで
77640 '下の矢印
77650 '中央 2
77660 if ((y=1) or (key$ = chr$(31))) then
77670 select case No
77680 '9から６に下げる
77690 case 9:
77700 No=6:sp_on 11,1:sp_on 10,0
77710 pause 200:goto Jyoushi_Input_Seireki2:
77720 '6から３に下げる
77730 case 6:
77740 No=3:sp_on 12,1:sp_on 11,0
77750 pause 200:goto Jyoushi_Input_Seireki2:
77760 '3から０ｋに変える
77770 case 3:
77780 No=-1:sp_on 14,1:sp_on 12,0
77790 pause 200:goto Jyoushi_Input_Seireki2:
77800 'Okから下のボタンを押しても何もしない
77810 case -1:
77820 pause 200:goto Jyoushi_Input_Seireki2:
77830 case 8:
77840 No=5:sp_on 8,1:sp_on 7,0
77850 pause 200:goto Jyoushi_Input_Seireki2:
77860 case 5:
77870 No=2:sp_on 9,1:sp_on 8,0
77880 pause 200:goto Jyoushi_Input_Seireki2:
77890 case 2:
77900 No=0:sp_on 13,1:sp_on 9,0
77910 pause 200:goto Jyoushi_Input_Seireki2:
77920 case 0:
77930 pause 200:goto Jyoushi_Input_Seireki2:
77940 case 7:
77950 No=4:sp_on 5,1:sp_on 4,0
77960 pause 200:goto Jyoushi_Input_Seireki2:
77970 case 4:
77980 No=1:sp_on 6,1:sp_on 5,0
77990 pause 200:goto Jyoushi_Input_Seireki2:
78000 case 1:
78010 pause 200:goto Jyoushi_Input_Seireki2:
78020 end select
78030 endif
78040 '左へボタン 十字キー　左　or 　カーソル左
78050 if ((y2 = -1) or (key$ = chr$(29))) then
78060 select case No
78070 'Ok ボタン  Okから　左　０に行く
78080 case -1:
78090 No=0:sp_on 13,1:sp_on 14,0
78100 pause 200:goto Jyoushi_Input_Seireki2:
78110 '0 ボタン  左　何もしない
78120 case 0:
78130 pause 200:goto Jyoushi_Input_Seireki2:
78140 case 3:
78150 No=2:sp_on 9,1:sp_on 12,0:
78160 pause 200:goto Jyoushi_Input_Seireki2:
78170 case 2:
78180 No=1:sp_on 6,1:sp_on 9,0:
78190 pause 200:goto Jyoushi_Input_Seireki2:
78200 case 1:
78210 pause 200:goto Jyoushi_Input_Seireki2:
78220 case 6:
78230 No=5:sp_on 8,1:sp_on 11,0
78240 pause 200:goto Jyoushi_Input_Seireki2:
78250 case 5:
78260 No=4:sp_on 5,1:sp_on 8,0
78270 pause 200:goto Jyoushi_Input_Seireki2:
78280 case 4:
78290 pause 200:goto Jyoushi_Input_Seireki2:
78300 case 9:
78310 No=8:sp_on 7,1:sp_on 10,0
78320 pause 200:goto Jyoushi_Input_Seireki2:
78330 case 8:
78340 No=7:sp_on 4,1:sp_on 7,0
78350 pause 200:goto Jyoushi_Input_Seireki2:
78360 case 7:
78370 pause 200:goto Jyoushi_Input_Seireki2:
78380 end select
78390 endif
78400 '右  十字キー　右　or カーソル　右
78410 if ((y2 = 1) or (key$ = chr$(28))) then
78420 select case No
78430 '0ボタンからokボタン右に移動
78440 case 0:
78450 No=-1:sp_on 14,1:sp_on 13,0
78460 pause 200:goto Jyoushi_Input_Seireki2:
78470 '0ボタンからokボタン 右に移動　ここまで
78480 'OKボタンで右を押して何もしない
78490 case -1:
78500 pause 200:goto Jyoushi_Input_Seireki2:
78510 case 1:
78520 No=2:sp_on 9,1:sp_on 6,0
78530 pause 200:goto Jyoushi_Input_Seireki2:
78540 case 2:
78550 No=3:sp_on 12,1:sp_on 9,0
78560 pause 200:goto Jyoushi_Input_Seireki2:
78570 case 3:
78580 pause 200:goto Jyoushi_Input_Seireki2:
78590 case 4:
78600 No=5:sp_on 8,1:sp_on 5,0
78610 pause 200:goto Jyoushi_Input_Seireki2:
78620 case 5:
78630 No=6:sp_on 11,1:sp_on 8,0
78640 pause 200:goto Jyoushi_Input_Seireki2:
78650 case 7:
78660 No=8:sp_on 7,1:sp_on 4,0
78670 pause 200:goto Jyoushi_Input_Seireki2:
78680 case 8:
78690 No=9:sp_on 10,1:sp_on 7,0
78700 pause 200:goto Jyoushi_Input_Seireki2:
78710 case 9:
78720 pause 200:goto Jyoushi_Input_Seireki2:
78730 case 6:
78740 pause 200:goto Jyoushi_Input_Seireki2:
78750 end select
78760 'Okから右ボタンを押して何もしない ここまで
78770 endif
78780 '十字キー　ここまで
78790 '==============================
78800 'ここから
78810 '==============================
78820 if ((bg = 2) or (key$ = chr$(13))) then
78830 select case count
78840 case 0:
78850 count = 1
78860 if (No = -1) then
78870 count = 0:No=0
78880 buf_Jyoushi_Born_Day(0) = No
78890 'Okボタンを押したとき
78900 goto Jyoushi_Input_Seireki2:
78910 else
78920 'Okボタン以外が押されたとき
78930 if (No >= 1 and No <= 2) then
78940 buf_year$="":buf_year$ = str$(No) + "***"
78950 buf_year = No:a= No
78960 buf_Jyoushi_Born_Day(0) = No
78970 locate 1,3
78980 color rgb(255,255,255)
78990 print "上司の生まれた年代(西暦4桁):";buf_year$
79000 goto Jyoushi_Input_Seireki2:
79010 else
79020 count=0
79030 ui_msg"数字が範囲外になります。"
79040 buf_year$="":buf_year=0
79050 goto Jyoushi_Input_Seireki2:
79060 endif
79070 endif
79080 case 1:
79090 count = 2
79100 if (No = -1) then
79110 count = 1
79120 goto Jyoushi_Input_Seireki2:
79130 else
79140 buf_year = a * 10 + No
79150 b=buf_year
79160 buf_year$ = str$(buf_year) + "**"
79170 buf_Jyoushi_Born_Day(0)=buf_year
79180 locate 1,3
79190 color rgb(255,255,255)
79200 print "                                                                "
79210 locate 1,3
79220 print "上司の生まれた年代(西暦4桁):" + buf_year$
79230 'if (No = -1) then
79240 'count=1
79250 goto Jyoushi_Input_Seireki2:
79260 endif
79270 case 2:
79280 count=3
79290 if (No=-1) then
79300 count =2
79310 goto Jyoushi_Input_Seireki2:
79320 else
79330 buf_year = b * 10 + No
79340 c=buf_year
79350 buf_year$ = str$(buf_year) + "*"
79360 buf_Jyoushi_Born_Day(0) = buf_year
79370 locate 1,3
79380 color rgb(255,255,255)
79390 print "                                        "
79400 locate 1,3
79410 print "上司の生まれた年代(西暦4桁):";buf_year$
79420 goto Jyoushi_Input_Seireki2:
79430 endif
79440 case 3:
79450 count=4
79460 if (No = -1) then
79470 No=0
79480 goto Jyoushi_Input_Seireki2:
79490 else
79500 buf_year = c * 10 + No
79510 buf_year$ = str$(buf_year)
79520 buf_Jyoushi_Born_Day(0) = buf_year
79530 locate 1,3
79540 color RGB(255,255,255)
79550 print "                                      "
79560 locate 1,3
79570 print "上司の生まれた年代(西暦4桁):";buf_year$
79580 buf_year=val(buf_year$)
79590 'year=val(buf_year$)
79600 'if (No=-1) then
79610 'goto Input_Born_Month:
79620 'else
79630 goto Jyoushi_Input_Seireki2:
79640 endif
79650 case 4:
79660 'bufyear=buf_year
79670 if (No=-1) then
79680 buf_year = val(buf_year$)
79690 buf_Jyoushi_Born_Day(0)=buf_year
79700 sp_on 14,0:No=0
79710 goto Jyoushi_Input_Born_Month:
79720 else
79730 goto Jyoushi_Input_Seireki2:
79740 endif
79750 end select
79760 endif
79770 '===========================
79780 'ここまでを部下のところにコピーする.
79790 '===========================
79800 if (bg2 = 2) then
79810 select case count2
79820 case 0:
79830 if (No = -1) then
79840 buf_year=0:buf_year$=trim$(""):buf_year$=trim$("****")
79850 count=0
79860 locate 1,3
79870 color rgb(255,255,255)
79880 print "                                      "
79890 locate 1,3
79900 print "上司の生まれた年代（西暦4桁):" + buf_year$
79910 goto Jyoushi_Input_Seireki2:
79920 else
79930 '(buf_year=0) then
79940 buf_year=0:buf_year$="****"
79950 locate 1,3
79960 print "                                       "
79970 locate 1,3
79980 print "上司の生まれた年代(西暦4桁):"+buf_year$
79990 goto Jyoushi_Input_Seireki2:
80000 'endif
80010 endif
80020 end select
80030 endif
80040 'Input"上司の生れた年代(4桁,〜2025年):",year
80050 'if year > 2025 then goto Jyoushi_Input_Seireki:
80060 'if year = 123 then cls 3:cls 4:goto Main_Screen:
80070 '"4桁目"
80080 'bufyear4 = fix(year / 1000)
80090 '"3桁目"
80100 'bufyear3 = fix((year - (bufyear4 * 1000)) / 100)
80110 '"2桁目"
80120 'bufyear2 = fix((year - ((bufyear4 * 1000)+(bufyear3*100)))/10)
80130 '"1桁目"
80140 'bufyear1 = fix((year - ((bufyear4*
80150 'bufyear = bufyear1+bufyear2+bufyear3+bufyear4
80160 '2.生まれた月を入力
80170 Jyoushi_Input_Born_Month:
80180 cls 3:play "":count=0:count2=0
80190 'No=-1:Okのとき
80200 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_Month$ = "**":buf_month=0
80210 for i=0 to 1
80220 buf_month(i)=0
80230 next i
80240 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
80250 '****************************************************************************************************
80260 'WUXG(1920x1200)の時ここから
80270 '****************************************************************************************************
80280 gload Gazo$ + "Screen2.png",0,0,0
80290 gload Gazo$ + "downscreen.png",0,0,800
80300 '****************************************************************************************************
80310 'WUXG(1920x1200)の時ここまで
80320 '****************************************************************************************************
80330 'Init"kb:4"
80340 '音声ファイル再生 2023.06.07
80350 play Voice$ + "Input_Born_Month_Jyoushi_20230831.mp3"
80360 font 48
80370 locate 0,1
80380 '文字色：黒　 color rgb(0,0,0)
80390 '文字色:白
80400 color rgb(255,255,255)
80410 print "上司の生まれた月を入れて下さい" + chr$(13)
80420 '文字色:白
80430 color rgb(255,255,255)
80440 locate 1,3
80450 '文字色:白
80460 print "上司の生まれた月(1月~12月):"+buf_Month$
80470 color rgb(255,255,255)
80480 'locate 4,6:print ":7"
80490 'locate 9,6:print ":8"
80500 'locate 12,6:print ":9"
80510 'locate 4,6
80520 '文字色:赤
80530 'print ":7  :8  :9" + chr$(13)
80540 'color rgb(255,255,255)
80550 'locate 4,8
80560 'print ":4  :5  :6" + chr$(13)
80570 'color rgb(255,255,255)
80580 'locate 4,10
80590 'print ":1  :2  :3" + chr$(13)
80600 'locate 4,12
80610 'print "    :0"
80620 'locate 12,12
80630 'color rgb(0,0,255)
80640 'print ":Ok"
80650 sp_on 4,0: sp_on 5,0:sp_on 6,0
80660 sp_on 7,0:sp_on 8,0:sp_on 9,0
80670 sp_on 10,0:sp_on 11,0:sp_on 12,0
80680 sp_on 13,0:sp_on 14,1
80690 Jyoushi_Input_Born_Month2:
80700 key$="":bg=0:y=0:y2=0:bg2=0
80710 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
80720 key$ = inkey$
80730 bg = strig(1)
80740 y = stick(1)
80750 y2 = stick(0)
80760 bg2 = strig(0)
80770 pause 200
80780 wend
80790 '十字キー　ここから
80800 '上の矢印　または、十字キー上
80810 if ((y = -1) or (key$ = chr$(30))) then
80820 select case No
80830 'No=-1:okのとき:初期の状態
80840 '0kボタンから３に移動
80850 '上に行く 処理
80860 case -1:
80870 No=3:sp_on 12,1:sp_on 14,0
80880 pause 200:goto Jyoushi_Input_Born_Month2:
80890 '選択肢:3
80900 '3ボタンから 6に移動
80910 case 3:
80920 No=6:sp_on 12,0:sp_on 11,1
80930 pause 200:goto Jyoushi_Input_Born_Month2:
80940 '6ボタンから ９に移動
80950 case 6:
80960 No=9:sp_on 10,1:sp_on 11,0
80970 pause 200:goto Jyoushi_Input_Born_Month2:
80980 '6ボタンから ９に移動　ここまで
80990 '9で上を押して何もしない
81000 case 9:
81010 '何もしない
81020 No=9
81030 pause 200:goto Jyoushi_Input_Born_Month2:
81040 '9で上を押しても何もしない　ここまで
81050 '上　 0ボタンから2ボタン
81060 'sp_on 6,1:1
81070 'sp_on 8,1:5
81080 'sp_on 7,1:7
81090 case 0:
81100 No=2:sp_on 13,0:sp_on 9,1:
81110 pause 200:goto Jyoushi_Input_Born_Month2:
81120 '上  0ボタンから2ボタン　ここまで
81130 '2から５になる 上
81140 case 2:
81150 No=5:sp_on 8,1:sp_on 9,0:
81160 pause 200:goto Jyoushi_Input_Born_Month2:
81170 case 5:
81180 No=8:sp_on 7,1:sp_on 8,0
81190 pause 200:goto Jyoushi_Input_Born_Month2:
81200 case 8:
81210 pause 200:goto Input_Born_Month2:
81220 case 1:
81230 No=4:sp_on 5,1:sp_on 6,0
81240 pause 200:goto Jyoushi_Input_Born_Month2:
81250 case 4:
81260 No=7:sp_on 4,1:sp_on 5,0
81270 pause 200:goto Jyoushi_Input_Born_Month2:
81280 case 7:
81290 pause 200:goto Input_Born_Month2:
81300 end select
81310 endif
81320 '左３　ここまで
81330 '下の矢印
81340 '中央 2
81350 if ((y=1) or (key$ = chr$(31))) then
81360 select case No
81370 '9から６に下げる
81380 case 9:
81390 No=6:sp_on 11,1:sp_on 10,0
81400 pause 200:goto Jyoushi_Input_Born_Month2:
81410 '6から３に下げる
81420 case 6:
81430 No=3:sp_on 12,1:sp_on 11,0
81440 pause 200:goto Jyoushi_Input_Born_Month2:
81450 '3から０ｋに変える
81460 case 3:
81470 No=-1:sp_on 14,1:sp_on 12,0
81480 pause 200:goto Jyoushi_Input_Born_Month2:
81490 'Okから下のボタンを押しても何もしない
81500 case -1:
81510 pause 200:goto Jyoushi_Input_Born_Month2:
81520 case 8:
81530 No=5:sp_on 8,1:sp_on 7,0
81540 pause 200:goto Jyoushi_Input_Born_Month2:
81550 case 5:
81560 No=2:sp_on 9,1:sp_on 8,0
81570 pause 200:goto Jyoushi_Input_Born_Month2:
81580 case 2:
81590 No=0:sp_on 13,1:sp_on 9,0
81600 pause 200:goto Jyoushi_Input_Born_Month2:
81610 case 0:
81620 pause 200:goto Jyoushi_Input_Born_Month2:
81630 case 7:
81640 No=4:sp_on 5,1:sp_on 4,0
81650 pause 200:goto Jyoushi_Input_Born_Month2:
81660 case 4:
81670 No=1:sp_on 6,1:sp_on 5,0
81680 pause 200:goto Jyoushi_Input_Born_Month2:
81690 case 1:
81700 pause 200:goto Jyoushi_Input_Born_Month2:
81710 end select
81720 endif
81730 '左へボタン 十字キー　左　or 　カーソル左
81740 if ((y2 = -1) or (key$ = chr$(29))) then
81750 select case No
81760 'Ok ボタン  Okから　左　０に行く
81770 case -1:
81780 No=0:sp_on 13,1:sp_on 14,0
81790 pause 200:goto Jyoushi_Input_Born_Month2:
81800 '0 ボタン  左　何もしない
81810 case 0:
81820 pause 200:goto Jyoushi_Input_Born_Month2:
81830 case 3:
81840 No=2:sp_on 9,1:sp_on 12,0:
81850 pause 200:goto Jyoushi_Input_Born_Month2:
81860 case 2:
81870 No=1:sp_on 6,1:sp_on 9,0:
81880 pause 200:goto Jyoushi_Input_Born_Month2:
81890 case 1:
81900 pause 200:goto Jyoushi_Input_Born_Month2:
81910 case 6:
81920 No=5:sp_on 8,1:sp_on 11,0
81930 pause 200:goto Jyoushi_Input_Born_Month2:
81940 case 5:
81950 No=4:sp_on 5,1:sp_on 8,0
81960 pause 200:goto Jyoushi_Input_Born_Month2:
81970 case 4:
81980 pause 200:goto Jyoushi_Input_Born_Month2:
81990 case 9:
82000 No=8:sp_on 7,1:sp_on 10,0
82010 pause 200:goto Input_Born_Month2:
82020 case 8:
82030 No=7:sp_on 4,1:sp_on 7,0
82040 pause 200:goto Jyoushi_Input_Born_Month2:
82050 case 7:
82060 pause 200:goto Jyoushi_Input_Born_Month2:
82070 end select
82080 endif
82090 '右  十字キー　右　or カーソル　右
82100 if ((y2 = 1) or (key$ = chr$(28))) then
82110 select case No
82120 '0ボタンからokボタン右に移動
82130 case 0:
82140 No=-1:sp_on 14,1:sp_on 13,0
82150 pause 200:goto Jyoushi_Input_Born_Month2:
82160 '0ボタンからokボタン 右に移動　ここまで
82170 'OKボタンで右を押して何もしない
82180 case -1:
82190 pause 200:goto Jyoushi_Input_Born_Month2:
82200 case 1:
82210 No=2:sp_on 9,1:sp_on 6,0
82220 pause 200:goto Jyoushi_Input_Born_Month2:
82230 case 2:
82240 No=3:sp_on 12,1:sp_on 9,0
82250 pause 200:goto Jyoushi_Input_Born_Month2:
82260 case 3:
82270 pause 200:goto Jyoushi_Input_Born_Month2:
82280 case 4:
82290 No=5:sp_on 8,1:sp_on 5,0
82300 pause 200:goto Jyoushi_Input_Born_Month2:
82310 case 5:
82320 No=6:sp_on 11,1:sp_on 8,0
82330 pause 200:goto Jyoushi_Input_Born_Month2:
82340 case 7:
82350 No=8:sp_on 7,1:sp_on 4,0
82360 pause 200:goto Jyoushi_Input_Born_Month2:
82370 case 8:
82380 No=9:sp_on 10,1:sp_on 7,0
82390 pause 200:goto Jyoushi_Input_Born_Month2:
82400 case 9:
82410 pause 200:goto Jyoushi_Input_Born_Month2:
82420 case 6:
82430 pause 200:goto Jyoushi_Input_Born_Month2:
82440 end select
82450 'Okから右ボタンを押して何もしない ここまで
82460 endif
82470 '十字キー　ここまで
82480 '右の丸ボタン + Enter key 決定キー
82490 if ((bg=2) or (key$=chr$(13))) then
82500 select case count
82510 case 0:
82520 if (No=-1) then No=0
82530 count = 1:buf_Month$ = "**":buf_Month$ = str$(No):buf_month = No:c=No
82540 if (buf_month > 1 and buf_month < 10)  then
82550 buf_Month$ = str$(buf_month)
82560 'buf_month=No
82570 endif
82580 if (buf_month = 1)  then
82590 buf_Month$ = str$(buf_month) + "*"
82600 'c=buf_month
82610 endif
82620 locate 1,3
82630 print "                                     "
82640 color RGB(255,255,255)
82650 locate 1,3
82660 print "上司の生まれた月(1月~12月):" + buf_Month$
82670 goto Jyoushi_Input_Born_Month2:
82680 case 1:
82690 count = 2:
82700 'c = val(buf_Month$)
82710 if (No = -1) then
82720 'count=0
82730 No=0
82740 month=buf_month
82750 buf_month=val(buf_Month$)
82760 month=buf_month
82770 buf_Jyoushi_Born_Day(1)=month
82780 '生まれた日に飛ぶ
82790 goto Jyoushi_Input_Born_Day:
82800 else
82810 buf_month = c*10 + No
82820 'if (buf_month = 1) then
82830 'buf_Month$ = str$(buf_month)
82840 'endif
82850 buf_Month$ = str$(buf_month)
82860 buf_Jyoushi_Born_Day(1) = buf_month
82870 locate 0,3
82880 print "                                           "
82890 locate 1,3
82900 color Rgb(255,255,255)
82910 print "上司の生まれた月(1月~12月):" + buf_Month$
82920 goto Jyoushi_Input_Born_Month2:
82930 endif
82940 case 2:
82950 '==================================
82960 '何もしない
82970 'coun = 2
82980 '==================================
82990 'c= val(buf_Month$)
83000 'buf_month = c*10 + No
83010 'buf_Month$ = str$(buf_month)
83020 'locate 2,3
83030 'print "上司の生まれた月(1月～12月):";buf_Month$
83040 'goto Jyoushi_Input_Born_Month2:
83050 'case 3:
83060 'count=4
83070 'b=val(buf_month$)
83080 'buf_month=c*10+No
83090 'buf_Month$=str$(buf_month)
83100 'locate 2,3
83110 'print "上司の生まれた月(1月～12月):";buf_Month$
83120 'buf_month=val(buf_Month$)
83130 'year=val(buf_year$)
83140 if (No=-1) then
83150 No=0
83160 goto Jyoushi_Input_Born_Day:
83170 else
83180 goto Jyoushi_Input_Born_Month2:
83190 endif
83200 'case 4:
83210 'bufyear=buf_year
83220 'if (No=-1) then
83230 'buf_month = val(buf_Month$)
83240 'month = buf_month
83250 'sp_on 14,0
83260 'goto Input_Born_Day:
83270 'else
83280 'goto Input_Born_Month2:
83290 'endif
83300 end select
83310 endif
83320 '左の丸ボタン　キャンセル
83330 if (bg2=2) then
83340 select case count2
83350 case 0:
83360 if (No = -1) then
83370 buf_month=0:buf_Month$="**"
83380 count=0
83390 'goto rewrite2:
83400 else
83410 if ((No >= 1 and No <= 9) or (No >= 10 and No <= 12)) then
83420 buf_month = 0:buf_Month$ = "**"
83430 locate 0,3
83440 color rgb(255,255,255)
83450 print "                                       "
83460 goto rewrite2:
83470 if (No>12) then
83480 ui_msg"値が範囲外です。"
83490 goto rewrite2:
83500 endif
83510 endif
83520 endif
83530 rewrite2:
83540 locate 2,3
83550 color rgb(255,255,255)
83560 print "                                      "
83570 locate 2,3
83580 print "上司の生まれた月(1月~12月):"+buf_Month$
83590 goto Jyoushi_Input_Born_Month2:
83600 end select
83610 'endif
83620 endif
83630 end
83640 'end
83650 '生れた日を入力
83660 Jyoushi_Input_Born_Day:
83670 '生まれた日入力
83680 cls 3:play ""
83690 'No=-1:Okのとき
83700 init"kb:4":key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_Day$ = "**":count=0:bg2=0:count2=0
83710 for i=0 to 1
83720 buf_day(i)=0
83730 next i
83740 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
83750 '****************************************************************************************************
83760 'WUXG(1920x1200)の時ここから
83770 '****************************************************************************************************
83780 gload Gazo$ + "Screen2.png",0,0,0
83790 gload Gazo$ + "downscreen.png",0,0,800
83800 '****************************************************************************************************
83810 'WUXG(1920x1200)の時ここまで
83820 '****************************************************************************************************
83830 'Init"kb:2"
83840 '音声ファイル再生 2023.06.07
83850 play Voice$ + "Input_Born_Day_Jyoushi_20230831.mp3"
83860 font 48
83870 locate 1,1
83880 '文字色：黒　 color rgb(0,0,0)
83890 color rgb(255,255,255)
83900 print "上司の生まれた日を入れて下さい" + chr$(13)
83910 locate 1,3
83920 color rgb(255,255,255)
83930 print "                                      "
83940 locate 1,3
83950 print "上司の生まれた日(1日~31日):"+buf_Day$
83960 color rgb(255,255,255)
83970 'locate 4,6:print ":7"
83980 'locate 9,6:print ":8"
83990 'locate 12,6:print ":9"
84000 'locate 4,6
84010 'print ":7  :8  :9" + chr$(13)
84020 'color rgb(255,255,255)
84030 'locate 4,8
84040 'print ":4  :5  :6" + chr$(13)
84050 'color rgb(255,255,255)
84060 'locate 4,10
84070 'print ":1  :2  :3" + chr$(13)
84080 'locate 4,12
84090 'print "    :0"
84100 'locate 12,12
84110 'color rgb(0,0,255)
84120 'print ":Ok"
84130 sp_on 4,0: sp_on 5,0:sp_on 6,0
84140 sp_on 7,0:sp_on 8,0:sp_on 9,0
84150 sp_on 10,0:sp_on 11,0:sp_on 12,0
84160 sp_on 13,0:sp_on 14,1
84170 Jyoushi_Input_Born_Day2:
84180 key$="":bg=0:y=0:y2=0:bg2=0:
84190 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
84200 key$ = inkey$
84210 bg = strig(1)
84220 y = stick(1)
84230 y2 = stick(0)
84240 bg2 = strig(0)
84250 pause 200
84260 wend
84270 '十字キー　ここから
84280 '上の矢印　または、十字キー上
84290 if ((y = -1) or (key$ = chr$(30))) then
84300 select case No
84310 'No=-1:okのとき:初期の状態
84320 '0kボタンから３に移動
84330 '上に行く 処理
84340 case -1:
84350 No=3:sp_on 12,1:sp_on 14,0
84360 pause 200:goto Jyoushi_Input_Born_Day2:
84370 '選択肢:3
84380 '3ボタンから 6に移動
84390 case 3:
84400 No=6:sp_on 12,0:sp_on 11,1
84410 pause 200:goto Jyoushi_Input_Born_Day2:
84420 '6ボタンから ９に移動
84430 case 6:
84440 No=9:sp_on 10,1:sp_on 11,0
84450 pause 200:goto Jyoushi_Input_Born_Day2:
84460 '6ボタンから ９に移動　ここまで
84470 '9で上を押して何もしない
84480 case 9:
84490 '何もしない
84500 No=9
84510 pause 200:goto Jyoushi_Input_Born_Day2:
84520 '9で上を押しても何もしない　ここまで
84530 '上　 0ボタンから2ボタン
84540 'sp_on 6,1:1
84550 'sp_on 8,1:5
84560 'sp_on 7,1:7
84570 case 0:
84580 No=2:sp_on 13,0:sp_on 9,1:
84590 pause 200:goto Jyoushi_Input_Born_Day2:
84600 '上  0ボタンから2ボタン　ここまで
84610 '2から５になる 上
84620 case 2:
84630 No=5:sp_on 8,1:sp_on 9,0:
84640 pause 200:goto Jyoushi_Input_Born_Day2:
84650 case 5:
84660 No=8:sp_on 7,1:sp_on 8,0
84670 pause 200:goto Jyoushi_Input_Born_Day2:
84680 case 8:
84690 pause 200:goto Jyoushi_Input_Born_Day2:
84700 case 1:
84710 No=4:sp_on 5,1:sp_on 6,0
84720 pause 200:goto Jyoushi_Input_Born_Day2:
84730 case 4:
84740 No=7:sp_on 4,1:sp_on 5,0
84750 pause 200:goto Jyoushi_Input_Born_Day2:
84760 case 7:
84770 pause 200:goto Jyoushi_Input_Born_Day2:
84780 end select
84790 endif
84800 '左３　ここまで
84810 '下の矢印
84820 '中央 2
84830 if ((y=1) or (key$ = chr$(31))) then
84840 select case No
84850 '9から６に下げる
84860 case 9:
84870 No=6:sp_on 11,1:sp_on 10,0
84880 pause 200:goto Jyoushi_Input_Born_Day2:
84890 '6から３に下げる
84900 case 6:
84910 No=3:sp_on 12,1:sp_on 11,0
84920 pause 200:goto Jyoushi_Input_Born_Day2:
84930 '3から０ｋに変える
84940 case 3:
84950 No=-1:sp_on 14,1:sp_on 12,0
84960 pause 200:goto Jyoushi_Input_Born_Day2:
84970 'Okから下のボタンを押しても何もしない
84980 case -1:
84990 pause 200:goto Jyoushi_Input_Born_Day2:
85000 case 8:
85010 No=5:sp_on 8,1:sp_on 7,0
85020 pause 200:goto Jyoushi_Input_Born_Day2:
85030 case 5:
85040 No=2:sp_on 9,1:sp_on 8,0
85050 pause 200:goto Jyoushi_Input_Born_Day2:
85060 case 2:
85070 No=0:sp_on 13,1:sp_on 9,0
85080 pause 200:goto Jyoushi_Input_Born_Day2:
85090 case 0:
85100 pause 200:goto Jyoushi_Input_Born_Day2:
85110 case 7:
85120 No=4:sp_on 5,1:sp_on 4,0
85130 pause 200:goto Jyoushi_Input_Born_Day2:
85140 case 4:
85150 No=1:sp_on 6,1:sp_on 5,0
85160 pause 200:goto Jyoushi_Input_Born_Day2:
85170 case 1:
85180 pause 200:goto Jyoushi_Input_Born_Day2:
85190 end select
85200 endif
85210 '左へボタン 十字キー　左　or 　カーソル左
85220 if ((y2 = -1) or (key$ = chr$(29))) then
85230 select case No
85240 'Ok ボタン  Okから　左　０に行く
85250 case -1:
85260 No=0:sp_on 13,1:sp_on 14,0
85270 pause 200:goto Jyoushi_Input_Born_Day2:
85280 '0 ボタン  左　何もしない
85290 case 0:
85300 pause 200:goto Jyoushi_Input_Born_Day2:
85310 case 3:
85320 No=2:sp_on 9,1:sp_on 12,0:
85330 pause 200:goto Jyoushi_Input_Born_Day2:
85340 case 2:
85350 No=1:sp_on 6,1:sp_on 9,0:
85360 pause 200:goto Jyoushi_Input_Born_Day2:
85370 case 1:
85380 pause 200:goto Jyoushi_Input_Born_Day2:
85390 case 6:
85400 No=5:sp_on 8,1:sp_on 11,0
85410 pause 200:goto Jyoushi_Input_Born_Day2:
85420 case 5:
85430 No=4:sp_on 5,1:sp_on 8,0
85440 pause 200:goto Jyoushi_Input_Born_Day2:
85450 case 4:
85460 pause 200:goto Jyoushi_Input_Born_Day2:
85470 case 9:
85480 No=8:sp_on 7,1:sp_on 10,0
85490 pause 200:goto Jyoushi_Input_Born_Day2:
85500 case 8:
85510 No=7:sp_on 4,1:sp_on 7,0
85520 pause 200:goto Jyoushi_Input_Born_Day2:
85530 case 7:
85540 pause 200:goto Jyoushi_Input_Born_Day2:
85550 end select
85560 endif
85570 '右  十字キー　右　or カーソル　右
85580 if ((y2 = 1) or (key$ = chr$(28))) then
85590 select case No
85600 '0ボタンからokボタン右に移動
85610 case 0:
85620 No=-1:sp_on 14,1:sp_on 13,0
85630 pause 200:goto Jyoushi_Input_Born_Day2:
85640 '0ボタンからokボタン 右に移動　ここまで
85650 'OKボタンで右を押して何もしない
85660 case -1:
85670 pause 200:goto Jyoushi_Input_Born_Day2:
85680 case 1:
85690 No=2:sp_on 9,1:sp_on 6,0
85700 pause 200:goto Jyoushi_Input_Born_Day2:
85710 case 2:
85720 No=3:sp_on 12,1:sp_on 9,0
85730 pause 200:goto Jyoushi_Input_Born_Day2:
85740 case 3:
85750 pause 200:goto Jyoushi_Input_Born_Day2:
85760 case 4:
85770 No=5:sp_on 8,1:sp_on 5,0
85780 pause 200:goto Jyoushi_Input_Born_Day2:
85790 case 5:
85800 No=6:sp_on 11,1:sp_on 8,0
85810 pause 200:goto Jyoushi_Input_Born_Day2:
85820 case 7:
85830 No=8:sp_on 7,1:sp_on 4,0
85840 pause 200:goto Jyoushi_Input_Born_Day2:
85850 case 8:
85860 No=9:sp_on 10,1:sp_on 7,0
85870 pause 200:goto Jyoushi_Input_Born_Day2:
85880 case 9:
85890 pause 200:goto Jyoushi_Input_Born_Day2:
85900 case 6:
85910 pause 200:goto Jyoushi_Input_Born_Day2:
85920 end select
85930 'Okから右ボタンを押して何もしない ここまで
85940 endif
85950 '十字キー　ここまで
85960 '右の丸ボタンを押したとき
85970 if ((bg = 2) or (key$ = chr$(13))) then
85980 'count :決定ボタンを押した回数
85990 select case (count)
86000 '1桁目入力
86010 case 0:
86020 count = 1:
86030 if (No = -1) then
86040 '1桁目　OKでは何もしない
86050 No=c
86060 'goto Jyoushi_Input_Born_Day2:
86070 else
86080 'ok以外のボタンを押したとき
86090 buf_day = No:buf_Day$ = str$(No)
86100 buf_Jyoushi_Born_Day(2)=buf_day
86110 c=No
86120 locate 1,3
86130 print "                                      "
86140 color RGB(255,255,255)
86150 locate 1,3
86160 print "上司の生まれた日(1日~31日):" + buf_Day$
86170 endif
86180 'check2:
86190 'if (buf_day >= 1 and buf_day <= 9) then
86200 'sp_on 14,0
86210 'goto complate_jyoushi:
86220 'else
86230 'sp_on 14,0
86240 goto Jyoushi_Input_Born_Day2:
86250 'end
86260 'endif
86270 case 1:
86280 '10未満の数字ボタン+okボタン or 2桁目の数字ボタン
86290 count = 2:
86300 'locate 2,3
86310 'color RGB(255,255,255)
86320 'print "生まれた日(1日~31日):";buf_Day$
86330 'Okボタンを押したときの処理
86340 '入力値　10未満のとき
86350 'buf_day = c * 10 + No
86360 if (No = -1) then
86370 c=buf_day:No=0
86380 'buf_day = c
86390 buf_Day$ = str$(buf_day)
86400 '10以下のとき
86410 'if (buf_day < 10) then
86420 sp_on 14,0
86430 goto complate_jyoushi:
86440 'end
86450 'endif
86460 else
86470 'c=No
86480 buf_day = c * 10 + No
86490 buf_Day$ = str$(buf_day)
86500 'buf_day = c:buf_Day$=str$(buf_day)
86510 buf_Jyoushi_Born_Day(2)=buf_day
86520 locate 1,3
86530 print "                                           "
86540 locate 1,3
86550 color Rgb(255,255,255)
86560 print "上司の生まれた日(1日~31日):" + buf_Day$
86570 goto Jyoushi_Input_Born_Day2:
86580 'goto
86590 endif
86600 'endif
86610 '生まれた日　2桁目の数字　or 1桁の数字 + ok
86620 case 2:
86630 'buf_day = c * 10 + No
86640 'buf_Jyoushi_Born_Day(2)=buf_day
86650 'locate 1,3
86660 'print "                                      "
86670 'locate 1,3
86680 'locate 2,3
86690 'print "生まれた日(1日〜31日):";buf_Day
86700 'No=-1:ok ボタンを押したとき
86710 if (No = -1) then
86720 'if ((buf_day > 0) and (buf_day < 32)) then
86730 No=0
86740 sp_on 14,0
86750 goto complate_jyoushi:
86760 'end
86770 else
86780 goto Jyoushi_Input_Born_Day2:
86790 'endif
86800 'Okボタン以外を押したとき
86810 'else
86820 'c=val(buf_Day$)
86830 'buf_day = c * 10 + No
86840 'buf_Jyoushi_Born_Day(2) = buf_day
86850 'buf_Day$ = str$(buf_day)
86860 'locate 1,3
86870 'print "上司の生まれた日(1日~31日):";buf_Day$
86880 'goto Jyoushi_Input_Born_Day2:
86890 endif
86900 'case 3:
86910 'count=4
86920 'c=val(buf_day$)
86930 'buf_day=c*10+No
86940 'buf_day$=str$(buf_day)
86950 'locate 2,3
86960 'print "生まれた日を入れてください:";buf_day$
86970 'year=val(buf_year$)
86980 'if (No = -1) then
86990 'goto Jyoushi_Input_Born_Day:
87000 'sp_on 14,0:
87010 'goto complate_jyoushi:
87020 'else
87030 'goto Jyoushi_Input_Born_Month2:
87040 'endif
87050 'case 4:
87060 'bufyear=buf_year
87070 'if (No=-1) then
87080 'buf_day = val(buf_day$)
87090 'bufday = buf_day
87100 'sp_on 14,0
87110 'goto Jyoushi_Input_Born_Day2:
87120 'else
87130 'goto Jyoushi_Input_Born_Day2:
87140 'endif
87150 end select
87160 endif
87170 if (bg2=2) then
87180 select case count2
87190 case 0:
87200 if (No=-1) then
87210 buf_day=0:buf_Day$="**":No=0
87220 if (buf_day >= 1 and buf_day <= 31) then
87230 count=0
87240 buf_day=0:buf_Day$ = "**"
87250 goto rewrite_day3:
87260 else
87270 buf_day=0:buf_Day$ = "**"
87280 ui_msg"値が範囲外です"
87290 endif
87300 goto rewrite_day3:
87310 else
87320 goto rewrite_day3:
87330 endif
87340 rewrite_day3:
87350 locate 2,3
87360 color rgb(255,255,255)
87370 print "                                      "
87380 locate 2,3
87390 print "生まれた日(1日~31日):" + buf_Day$
87400 goto Jyoushi_Input_Born_Day2:
87410 end select
87420 endif
87430 '--------------------------------------------'
87440 'locate 2,0:color rgb(255,0,0)
87450 'print "上司の生まれた年代を入力"
87460 'color rgb(255,255,255)
87470 'locate 2,3:print "生まれた年代を西暦4桁で入れてください"
87480 'locate 2,4:Input "上司の生まれた年:",born_year
87490 '誕生日データーを配列に代入
87500 'buf_Jyoushi_Born_Year:上司の生まれた年代
87510 'buf_Jyoushi_Born_Day(0) = born_year
87520 'born_year = 0
87530 '---------------------------------------------'
87540 'goto Jyoushi_born_month:
87550 '1-2.生まれた月を入力
87560 'Jyoushi_born_month:
87570 'cls 3:gload Gazo$ + "Screen1.png",0,0,0
87580 'init "kb:4"
87590 'locate 2,1:
87600 'color rgb(255,0,0)
87610 'print "上司の生まれた月入力"
87620 'color rgb(255,255,255)
87630 'locate 2,4:print "生まれた月を入力してください"
87640 'locate 2,5
87650 'Input "上司の生まれ月:",born_month
87660 'buf_Jyoushi_Born_Day(1) = born_month
87670 'born_month = 0
87680 'goto Jyoushi_born_day:
87690 'buf_Jyoushi_Born_day
87700 '1-3.生まれた日を入力
87710 'Jyoushi_born_day:
87720 'cls 3:gload Gazo$ + "Screen1.png",0,0,0
87730 'init "kb:4"
87740 'locate 2,1:color rgb(255,0,0)
87750 'print "上司の生まれた日　入力"
87760 'locate 2,4:color rgb(255,255,255)
87770 'print "生まれた日を入力してください"
87780 'locate 2,5
87790 'Input "上司の生まれた日:",born_day
87800 'buf_Jyoushi_Born_Day(2) = born_day
87810 'born_day = 0
87820 'goto buka_born_year:
87830 '2.部下の誕生日入力
87840 '2-1.生まれた年を入力
87850 'buka_born_year:
87860 'cls 3:gload Gazo$+"Screen1.png",0,0,0
87870 'init "kb:2"
87880 'locate 1,1:color rgb(255,0,0)
87890 'print "部下の生まれた年代入力"
87900 'locate 0,4:color rgb(255,255,255)
87910 'print "部下の生まれた年（西暦4桁）を入れてください"
87920 'locate 0,5
87930 'Input "部下の生まれた年(西暦4桁):",born_year
87940 'buf_Buka_Born_Day(0) = born_year
87950 'born_year = 0
87960 '2-2.生まれた月を入力
87970 'buka_born_month:
87980 'cls 3:gload Gazo$+"Screen1.png",0,0,0
87990 'init "kb:2"
88000 'locate 2,1:color rgb(255,0,0)
88010 'print "部下の生まれた月 入力"
88020 'locate 2,4:color rgb(255,255,255)
88030 'print "部下の生まれた月を入力してください"
88040 'locate 2,5:Input "部下の生まれた月:",born_month
88050 'buf_Buka_Born_Day(1) = born_month
88060 '2-3.生まれた日を入力
88070 'buka_born_day:
88080 'cls 3:gload Gazo$ + "Screen1.png",0,0,0
88090 'init "kb:2"
88100 'locate 2,1:color rgb(255,0,0)
88110 'print "生まれた日入力"
88120 'color rgb(255,255,255)
88130 'locate 2,4:print "生まれた日を入力してください"
88140 'locate 2,5:Input "部下の生まれた日:",born_day
88150 'buf_Buka_Born_Day(2) = born_day
88160 'born_day=0:goto Result_Business_Aisyou:
88170 '--------------------------------------------'
88180 complate_jyoushi:
88190 a = buf_Jyoushi_Born_Day(0):b = buf_Jyoushi_Born_Day(1):c = buf_Jyoushi_Born_Day(2)
88200 buf_Jyoushi = Kabara_Num(a,b,c)
88210 a_1=buf_Jyoushi
88220 goto Buka_Input_Seireki:
88230 '--------------------------------------------'
88240 '部下'
88250 '1.部下の生まれた年代'
88260 Buka_Input_Seireki:
88270 cls 3:play "":count=0:count2=0
88280 init"kb:4"
88290 'No=-1:Okのとき
88300 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_buka_year$ = "****":buf_buka_year=0
88310 for i=0 to 3
88320 buf_Buka_Born_Day(i)=0
88330 next i
88340 '****************************************************************************************************
88350 'WUXG(1920x1200)の時ここから
88360 '****************************************************************************************************
88370 gload Gazo$ + "Screen2.png",0,0,0
88380 gload Gazo$ + "downscreen.png",0,0,800
88390 '****************************************************************************************************
88400 'WUXG(1920x1200)の時ここまで
88410 '****************************************************************************************************
88420 'Init"kb:2"
88430 '音声ファイル再生 2023.06.07
88440 play Voice$ + "Input_Born_Year_Buka_20230831.mp3"
88450 font 48
88460 locate 0,1
88470 '文字色：黒　 color rgb(0,0,0)
88480 color rgb(255,255,255)
88490 print "部下の生まれた年代を入れて下さい" + chr$(13)
88500 color rgb(255,255,255)
88510 locate 1,3
88520 print "部下の生まれた年代(西暦4桁):"+buf_buka_year$
88530 color rgb(255,255,255)
88540 'locate 4,6:print ":7"
88550 'locate 9,6:print ":8"
88560 'locate 12,6:print ":9"
88570 'locate 4,6
88580 'print ":7  :8  :9" + chr$(13)
88590 'color rgb(255,255,255)
88600 'locate 4,8
88610 'print ":4  :5  :6" + chr$(13)
88620 'color rgb(255,255,255)
88630 'locate 4,10
88640 'print ":1  :2  :3" + chr$(13)
88650 'locate 4,12
88660 'print "    :0"
88670 'locate 12,12
88680 'color rgb(0,0,255)
88690 'print ":Ok"
88700 sp_on 4,0: sp_on 5,0:sp_on 6,0
88710 sp_on 7,0:sp_on 8,0:sp_on 9,0
88720 sp_on 10,0:sp_on 11,0:sp_on 12,0
88730 sp_on 13,0:sp_on 14,1
88740 Buka_Input_Seireki2:
88750 key$="":bg=0:y=0:y2=0:bg2=0:
88760 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
88770 key$ = inkey$
88780 bg = strig(1)
88790 y = stick(1)
88800 y2 = stick(0)
88810 bg2=strig(0)
88820 pause 200
88830 wend
88840 '十字キー　ここから
88850 '上の矢印　または、十字キー上
88860 if ((y = -1) or (key$ = chr$(30))) then
88870 select case No
88880 'No=-1:okのとき:初期の状態
88890 '0kボタンから３に移動
88900 '上に行く 処理
88910 case -1:
88920 No=3:sp_on 12,1:sp_on 14,0
88930 pause 200:goto Buka_Input_Seireki2:
88940 '選択肢:3
88950 '3ボタンから 6に移動
88960 case 3:
88970 No=6:sp_on 12,0:sp_on 11,1
88980 pause 200:goto Buka_Input_Seireki2:
88990 '6ボタンから ９に移動
89000 case 6:
89010 No=9:sp_on 10,1:sp_on 11,0
89020 pause 200:goto Buka_Input_Seireki2:
89030 '6ボタンから ９に移動　ここまで
89040 '9で上を押して何もしない
89050 case 9:
89060 '何もしない
89070 No=9
89080 pause 200:goto Buka_Input_Seireki2:
89090 '9で上を押しても何もしない　ここまで
89100 '上　 0ボタンから2ボタン
89110 'sp_on 6,1:1
89120 'sp_on 8,1:5
89130 'sp_on 7,1:7
89140 case 0:
89150 No=2:sp_on 13,0:sp_on 9,1:
89160 pause 200:goto Buka_Input_Seireki2:
89170 '上  0ボタンから2ボタン　ここまで
89180 '2から５になる 上
89190 case 2:
89200 No=5:sp_on 8,1:sp_on 9,0:
89210 pause 200:goto Buka_Input_Seireki2:
89220 case 5:
89230 No=8:sp_on 7,1:sp_on 8,0
89240 pause 200:goto Buka_Input_Seireki2:
89250 case 8:
89260 pause 200:goto Buka_Input_Seireki2:
89270 case 1:
89280 No=4:sp_on 5,1:sp_on 6,0
89290 pause 200:goto Buka_Input_Seireki2:
89300 case 4:
89310 No=7:sp_on 4,1:sp_on 5,0
89320 pause 200:goto Buka_Input_Seireki2:
89330 case 7:
89340 pause 200:goto Buka_Input_Seireki2:
89350 end select
89360 endif
89370 '左３　ここまで
89380 '下の矢印
89390 '中央 2
89400 if ((y=1) or (key$ = chr$(31))) then
89410 select case No
89420 '9から６に下げる
89430 case 9:
89440 No=6:sp_on 11,1:sp_on 10,0
89450 pause 200:goto Buka_Input_Seireki2:
89460 '6から３に下げる
89470 case 6:
89480 No=3:sp_on 12,1:sp_on 11,0
89490 pause 200:goto Buka_Input_Seireki2:
89500 '3から０ｋに変える
89510 case 3:
89520 No=-1:sp_on 14,1:sp_on 12,0
89530 pause 200:goto Buka_Input_Seireki2:
89540 'Okから下のボタンを押しても何もしない
89550 case -1:
89560 pause 200:goto Buka_Input_Seireki2:
89570 case 8:
89580 No=5:sp_on 8,1:sp_on 7,0
89590 pause 200:goto Buka_Input_Seireki2:
89600 case 5:
89610 No=2:sp_on 9,1:sp_on 8,0
89620 pause 200:goto Buka_Input_Seireki2:
89630 case 2:
89640 No=0:sp_on 13,1:sp_on 9,0
89650 pause 200:goto Buka_Input_Seireki2:
89660 case 0:
89670 pause 200:goto Buka_Input_Seireki2:
89680 case 7:
89690 No=4:sp_on 5,1:sp_on 4,0
89700 pause 200:goto Buka_Input_Seireki2:
89710 case 4:
89720 No=1:sp_on 6,1:sp_on 5,0
89730 pause 200:goto Buka_Input_Seireki2:
89740 case 1:
89750 pause 200:goto Buka_Input_Seireki2:
89760 end select
89770 endif
89780 '左へボタン 十字キー　左　or 　カーソル左
89790 if ((y2 = -1) or (key$ = chr$(29))) then
89800 select case No
89810 'Ok ボタン  Okから　左　０に行く
89820 case -1:
89830 No=0:sp_on 13,1:sp_on 14,0
89840 pause 200:goto Buka_Input_Seireki2:
89850 '0 ボタン  左　何もしない
89860 case 0:
89870 pause 200:goto Buka_Input_Seireki2:
89880 case 3:
89890 No=2:sp_on 9,1:sp_on 12,0:
89900 pause 200:goto Buka_Input_Seireki2:
89910 case 2:
89920 No=1:sp_on 6,1:sp_on 9,0:
89930 pause 200:goto Buka_Input_Seireki2:
89940 case 1:
89950 pause 200:goto Buka_Input_Seireki2:
89960 case 6:
89970 No=5:sp_on 8,1:sp_on 11,0
89980 pause 200:goto Buka_Input_Seireki2:
89990 case 5:
90000 No=4:sp_on 5,1:sp_on 8,0
90010 pause 200:goto Buka_Input_Seireki2:
90020 case 4:
90030 pause 200:goto Buka_Input_Seireki2:
90040 case 9:
90050 No=8:sp_on 7,1:sp_on 10,0
90060 pause 200:goto Buka_Input_Seireki2:
90070 case 8:
90080 No=7:sp_on 4,1:sp_on 7,0
90090 pause 200:goto Buka_Input_Seireki2:
90100 case 7:
90110 pause 200:goto Buka_Input_Seireki2:
90120 end select
90130 endif
90140 '右  十字キー　右　or カーソル　右
90150 if ((y2 = 1) or (key$ = chr$(28))) then
90160 select case No
90170 '0ボタンからokボタン右に移動
90180 case 0:
90190 No=-1:sp_on 14,1:sp_on 13,0
90200 pause 200:goto Buka_Input_Seireki2:
90210 '0ボタンからokボタン 右に移動　ここまで
90220 'OKボタンで右を押して何もしない
90230 case -1:
90240 pause 200:goto Buka_Input_Seireki2:
90250 case 1:
90260 No=2:sp_on 9,1:sp_on 6,0
90270 pause 200:goto Buka_Input_Seireki2:
90280 case 2:
90290 No=3:sp_on 12,1:sp_on 9,0
90300 pause 200:goto Buka_Input_Seireki2:
90310 case 3:
90320 pause 200:goto Buka_Input_Seireki2:
90330 case 4:
90340 No=5:sp_on 8,1:sp_on 5,0
90350 pause 200:goto Buka_Input_Seireki2:
90360 case 5:
90370 No=6:sp_on 11,1:sp_on 8,0
90380 pause 200:goto Buka_Input_Seireki2:
90390 case 7:
90400 No=8:sp_on 7,1:sp_on 4,0
90410 pause 200:goto Buka_Input_Seireki2:
90420 case 8:
90430 No=9:sp_on 10,1:sp_on 7,0
90440 pause 200:goto Buka_Input_Seireki2:
90450 case 9:
90460 pause 200:goto Buka_Input_Seireki2:
90470 case 6:
90480 pause 200:goto Buka_Input_Seireki2:
90490 end select
90500 'Okから右ボタンを押して何もしない ここまで
90510 endif
90520 '十字キー　ここまで
90530 '＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝
90540 'ここからコメント
90550 '右の丸ボタン決定を押した数:count
90560 'if ((bg=2) or (key$=chr$(13))) then
90570 'select case count
90580 'case 0:
90590 'count=1
90600 'if (No = -1) then
90610 'count = 0
90620 'Okボタンを押したとき
90630 '
90640 'goto Buka_Input_Seireki2:
90650 'else
90660 'Okボタン以外が押されたとき
90670 'if (No >= 1 and No <= 2) then
90680 'buf_buka_year$ = "":buf_buka_year$ = str$(No)
90690 'buf_buka_year = No
90700 'buf_Buka_Born_Day(0) = bufyear
90710 'locate 2,3
90720 'color rgb(255,255,255)
90730 'print "部下の生まれた年代(西暦4桁):";buf_buka_year$
90740 'goto Buka_Input_Seireki2:
90750 'else
90760 'count=0
90770 'ui_msg"数字が範囲外になります。"
90780 'buf_buka_year$ ="":buf_buka_year=0
90790 'goto Buka_Input_Seireki2:
90800 'endif
90810 'endif
90820 'case 1:
90830 'count = 2
90840 'if (No = -1) then
90850 'count = 1
90860 'goto Buka_Input_Seireki2:
90870 'else
90880 'b = val(buf_buka_year$)
90890 'buf_buka_year = b * 10 + No
90900 'buf_buka_year$ = str$(buf_buka_year)
90910 'buf_Buka_Born_Day(0) = bufyear
90920 'locate 1,3
90930 'color rgb(255,255,255)
90940 'print "                                                                "
90950 'locate 1,3
90960 'print "部下の生まれた年代(西暦4桁):";buf_buka_year$
90970 'if (No = -1) then
90980 'count=1
90990 'goto Buka_Input_Seireki2:
91000 'endif
91010 'case 2:
91020 'count = 3
91030 'if (No = -1) then
91040 'count = 2
91050 'buf_Buka_Born_Day(0)=bufyear
91060 'goto Buka_Input_Seireki2:
91070 'else
91080 'b = val(buf_buka_year$)
91090 'buf_buka_year = b*10 + No
91100 'buf_buka_year$ = str$(buf_buka_year)
91110 'locate 1,3
91120 'color rgb(255,255,255)
91130 'print "                                        "
91140 'locate 1,3
91150 'print "部下の生まれた年代(西暦4桁):"+buf_buka_year$
91160 'goto Buka_Input_Seireki2:
91170 'endif
91180 'case 3:
91190 'count=4
91200 'if (No = -1) then
91210 'count=3
91220 'goto Buka_Input_Seireki2:
91230 'else
91240 'b = buf_buka_year
91250 'buf_buka_year = b * 10 + No
91260 'buf_buka_year$=str$(buf_buka_year)
91270 'locate 1,3
91280 'color RGB(255,255,255)
91290 'print "                                      "
91300 'locate 1,3
91310 'print "部下の生まれた年代(西暦4桁):";buf_buka_year$
91320 'buf_year=val(buf_year$)
91330 'year=val(buf_year$)
91340 'if (No=-1) then
91350 'goto Input_Born_Month:
91360 'else
91370 'goto Buka_Input_Seireki2:
91380 'endif
91390 'case 4:
91400 'bufyear=buf_year
91410 'if (No=-1) then
91420 'buf_year = val(buf_year$)
91430 'bufyear = buf_year
91440 'sp_on 14,0
91450 'goto Buka_Input_Born_Month:
91460 'else
91470 'goto Buka_Input_Seireki2:
91480 'endif
91490 'end select
91500 'endif
91510 'if (bg2 = 2) then
91520 'select case count2
91530 'case 0:
91540 'if (No = -1) then
91550 'buf_buka_year=0:buf_buka_year$=trim$(""):buf_buka_year$=trim$("****")
91560 'count=0
91570 'locate 1,3
91580 'color rgb(255,255,255)
91590 'print "                                      "
91600 'locate 1,3
91610 'print "部下の生まれた年代（西暦4桁):";buf_buka_year$
91620 'goto Buka_Input_Seireki2:
91630 'else
91640 '(buf_year=0) then
91650 'buf_buka_year=0:buf_buka_year$="****"
91660 'goto Buka_Input_Seireki2:
91670 'endif
91680 'endif
91690 'end select
91700 'endif
91710 'end
91720 'ここまでコメント
91730 '================================================================
91740 if ((bg=2) or (key$=chr$(13))) then
91750 select case count
91760 case 0:
91770 count = 1
91780 if (No=-1) then
91790 count = 0
91800 buf_Buka_Born_Day(0) = No
91810 'Okボタンを押したとき
91820 goto Buka_Input_Seireki2:
91830 else
91840 'Okボタン以外が押されたとき
91850 if (No>=1 and No<=2) then
91860 buf_buka_year$="":buf_buka_year$=str$(No) + "***":a = No
91870 buf_buka_year = No
91880 buf_Buka_Born_Day(0) = No
91890 locate 1,3
91900 color rgb(255,255,255)
91910 print "部下の生まれた年代(西暦4桁):";buf_buka_year$
91920 goto Buka_Input_Seireki2:
91930 else
91940 count=0
91950 ui_msg"数字が範囲外になります。"
91960 buf_buka_year$="":buf_buka_year=0
91970 goto Buka_Input_Seireki2:
91980 endif
91990 endif
92000 case 1:
92010 count = 2
92020 if (No = -1) then
92030 count = 1
92040 goto Buka_Input_Seireki2:
92050 else
92060 'b = val(buf_buka_year$)
92070 buf_buka_year = a * 10 + No
92080 b=buf_buka_year
92090 buf_buka_year$ = str$(buf_buka_year)+"**"
92100 buf_Buka_Born_Day(0)=buf_buka_year
92110 locate 1,3
92120 color rgb(255,255,255)
92130 print "                                                                "
92140 locate 1,3
92150 print "部下の生まれた年代(西暦4桁):"+buf_buka_year$
92160 'if (No = -1) then
92170 'count=1
92180 goto Buka_Input_Seireki2:
92190 endif
92200 case 2:
92210 count=3
92220 if (No=-1) then
92230 count =2:No=0
92240 goto Buka_Input_Seireki2:
92250 else
92260 'b = val(buf_buka_year$)
92270 buf_buka_year = b * 10 + No
92280 c = buf_buka_year
92290 buf_buka_year$ = str$(buf_buka_year) + "*"
92300 buf_Buka_Born_Day(0) = buf_buka_year
92310 locate 1,3
92320 color rgb(255,255,255)
92330 print "                                        "
92340 locate 1,3
92350 print "部下の生まれた年代(西暦4桁):";buf_buka_year$
92360 goto Buka_Input_Seireki2:
92370 endif
92380 case 3:
92390 count=4
92400 if (No = -1) then
92410 'count=3:No=0
92420 goto Buka_Input_Seireki2:
92430 else
92440 'b = val(buf_buka_year$)
92450 buf_buka_year=c * 10 + No
92460 buf_buka_year$=str$(buf_buka_year)
92470 buf_Buka_Born_Day(0)=buf_buka_year
92480 locate 1,3
92490 color RGB(255,255,255)
92500 print "                                      "
92510 locate 1,3
92520 print "部下の生まれた年代(西暦4桁):";buf_buka_year$
92530 buf_buka_year=val(buf_buka_year$)
92540 'year=val(buf_year$)
92550 'if (No=-1) then
92560 'goto Input_Born_Month:
92570 'else
92580 goto Buka_Input_Seireki2:
92590 endif
92600 case 4:
92610 'bufyear=buf_year
92620 if (No = -1) then
92630 buf_buka_year = val(buf_buka_year$)
92640 buf_Buka_Born_Day(0)=buf_buka_year
92650 sp_on 14,0
92660 goto Buka_Input_Born_Month:
92670 else
92680 goto Buka_Input_Seireki2:
92690 endif
92700 end select
92710 endif
92720 '================================================================
92730 'ここにコピーする。
92740 '================================================================
92750 'Input"部下の生れた年代(4桁,〜2025年):",year
92760 'if year > 2025 then goto Jyoushi_Input_Seireki:
92770 'if year = 123 then cls 3:cls 4:goto Main_Screen:
92780 '"4桁目"
92790 'bufyear4 = fix(year / 1000)
92800 '"3桁目"
92810 'bufyear3 = fix((year - (bufyear4 * 1000)) / 100)
92820 '"2桁目"
92830 'bufyear2 = fix((year - ((bufyear4 * 1000)+(bufyear3*100)))/10)
92840 '"1桁目"
92850 'bufyear1 = fix((year - ((bufyear4*
92860 'bufyear = bufyear1+bufyear2+bufyear3+bufyear4
92870 '1.部下の生まれた年代'
92880 '2.部下の生まれた月'
92890 Buka_Input_Born_Month:
92900 cls 3:play "":count=0:count2=0
92910 'No=-1:Okのとき
92920 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_buka_Month$ = "**":buf_buka_month=0
92930 for i=0 to 1
92940 buf_month(i)=0
92950 next i
92960 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
92970 '****************************************************************************************************
92980 'WUXG(1920x1200)の時ここから
92990 '****************************************************************************************************
93000 gload Gazo$ + "Screen2.png",0,0,0
93010 gload Gazo$ + "downscreen.png",0,0,800
93020 '****************************************************************************************************
93030 'WUXG(1920x1200)の時ここから
93040 '****************************************************************************************************
93050 'Init"kb:4"
93060 '音声ファイル再生 2023.06.07
93070 play Voice$ + "Input_Born_Month_Buka_20230831.mp3"
93080 '****************************************************************************************************
93090 'WUXG(1920x1200)の時ここから
93100 '****************************************************************************************************
93110 font 48
93120 '****************************************************************************************************
93130 'WUXG(1920x1200)の時ここまで
93140 '****************************************************************************************************
93150 locate 0,1
93160 '文字色：黒　 color rgb(0,0,0)
93170 '文字色:白
93180 color rgb(255,255,255)
93190 print "部下の生まれた月を入れて下さい" + chr$(13)
93200 '文字色:白
93210 color rgb(255,255,255)
93220 locate 1,3
93230 '文字色:白
93240 print "部下の生まれた月(1月~12月):" + buf_buka_Month$
93250 color rgb(255,255,255)
93260 'locate 4,6:print ":7"
93270 'locate 9,6:print ":8"
93280 'locate 12,6:print ":9"
93290 'locate 4,6
93300 '文字色:赤
93310 'print ":7  :8  :9" + chr$(13)
93320 'color rgb(255,255,255)
93330 'locate 4,8
93340 'print ":4  :5  :6" + chr$(13)
93350 'color rgb(255,255,255)
93360 'locate 4,10
93370 'print ":1  :2  :3" + chr$(13)
93380 'locate 4,12
93390 'print "    :0"
93400 'locate 12,12
93410 'color rgb(0,0,255)
93420 'print ":Ok"
93430 sp_on 4,0: sp_on 5,0:sp_on 6,0
93440 sp_on 7,0:sp_on 8,0:sp_on 9,0
93450 sp_on 10,0:sp_on 11,0:sp_on 12,0
93460 sp_on 13,0:sp_on 14,1
93470 Buka_Input_Born_Month2:
93480 key$="":bg=0:y=0:y2=0:bg2=0
93490 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
93500 key$ = inkey$
93510 bg = strig(1)
93520 y = stick(1)
93530 y2 = stick(0)
93540 bg2 = strig(0)
93550 pause 200
93560 wend
93570 '十字キー　ここから
93580 '上の矢印　または、十字キー上
93590 if ((y = -1) or (key$ = chr$(30))) then
93600 select case No
93610 'No=-1:okのとき:初期の状態
93620 '0kボタンから３に移動
93630 '上に行く 処理
93640 case -1:
93650 No=3:sp_on 12,1:sp_on 14,0
93660 pause 200:goto Buka_Input_Born_Month2:
93670 '選択肢:3
93680 '3ボタンから 6に移動
93690 case 3:
93700 No=6:sp_on 12,0:sp_on 11,1
93710 pause 200:goto Buka_Input_Born_Month2:
93720 '6ボタンから ９に移動
93730 case 6:
93740 No=9:sp_on 10,1:sp_on 11,0
93750 pause 200:goto Buka_Input_Born_Month2:
93760 '6ボタンから ９に移動　ここまで
93770 '9で上を押して何もしない
93780 case 9:
93790 '何もしない
93800 No=9
93810 pause 200:goto Buka_Input_Born_Month2:
93820 '9で上を押しても何もしない　ここまで
93830 '上　 0ボタンから2ボタン
93840 'sp_on 6,1:1
93850 'sp_on 8,1:5
93860 'sp_on 7,1:7
93870 case 0:
93880 No=2:sp_on 13,0:sp_on 9,1:
93890 pause 200:goto Buka_Input_Born_Month2:
93900 '上  0ボタンから2ボタン　ここまで
93910 '2から５になる 上
93920 case 2:
93930 No=5:sp_on 8,1:sp_on 9,0:
93940 pause 200:goto Buka_Input_Born_Month2:
93950 case 5:
93960 No=8:sp_on 7,1:sp_on 8,0
93970 pause 200:goto Buka_Input_Born_Month2:
93980 case 8:
93990 pause 200:goto Buka_Input_Born_Month2:
94000 case 1:
94010 No=4:sp_on 5,1:sp_on 6,0
94020 pause 200:goto Buka_Input_Born_Month2:
94030 case 4:
94040 No=7:sp_on 4,1:sp_on 5,0
94050 pause 200:goto Buka_Input_Born_Month2:
94060 case 7:
94070 pause 200:goto Buka_Input_Born_Month2:
94080 end select
94090 endif
94100 '左３　ここまで
94110 '下の矢印
94120 '中央 2
94130 if ((y=1) or (key$ = chr$(31))) then
94140 select case No
94150 '9から６に下げる
94160 case 9:
94170 No=6:sp_on 11,1:sp_on 10,0
94180 pause 200:goto Buka_Input_Born_Month2:
94190 '6から３に下げる
94200 case 6:
94210 No=3:sp_on 12,1:sp_on 11,0
94220 pause 200:goto Buka_Input_Born_Month2:
94230 '3から０ｋに変える
94240 case 3:
94250 No=-1:sp_on 14,1:sp_on 12,0
94260 pause 200:goto Buka_Input_Born_Month2:
94270 'Okから下のボタンを押しても何もしない
94280 case -1:
94290 pause 200:goto Buka_Input_Born_Month2:
94300 case 8:
94310 No=5:sp_on 8,1:sp_on 7,0
94320 pause 200:goto Buka_Input_Born_Month2:
94330 case 5:
94340 No=2:sp_on 9,1:sp_on 8,0
94350 pause 200:goto Buka_Input_Born_Month2:
94360 case 2:
94370 No=0:sp_on 13,1:sp_on 9,0
94380 pause 200:goto Buka_Input_Born_Month2:
94390 case 0:
94400 pause 200:goto Buka_Input_Born_Month2:
94410 case 7:
94420 No=4:sp_on 5,1:sp_on 4,0
94430 pause 200:goto Buka_Input_Born_Month2:
94440 case 4:
94450 No=1:sp_on 6,1:sp_on 5,0
94460 pause 200:goto Buka_Input_Born_Month2:
94470 case 1:
94480 pause 200:goto Buka_Input_Born_Month2:
94490 end select
94500 endif
94510 '左へボタン 十字キー　左　or 　カーソル左
94520 if ((y2 = -1) or (key$ = chr$(29))) then
94530 select case No
94540 'Ok ボタン  Okから　左　０に行く
94550 case -1:
94560 No=0:sp_on 13,1:sp_on 14,0
94570 pause 200:goto Buka_Input_Born_Month2:
94580 '0 ボタン  左　何もしない
94590 case 0:
94600 pause 200:goto Buka_Input_Born_Month2:
94610 case 3:
94620 No=2:sp_on 9,1:sp_on 12,0:
94630 pause 200:goto Buka_Input_Born_Month2:
94640 case 2:
94650 No=1:sp_on 6,1:sp_on 9,0:
94660 pause 200:goto Buka_Input_Born_Month2:
94670 case 1:
94680 pause 200:goto Buka_Input_Born_Month2:
94690 case 6:
94700 No=5:sp_on 8,1:sp_on 11,0
94710 pause 200:goto Buka_Input_Born_Month2:
94720 case 5:
94730 No=4:sp_on 5,1:sp_on 8,0
94740 pause 200:goto Buka_Input_Born_Month2:
94750 case 4:
94760 pause 200:goto Buka_Input_Born_Month2:
94770 case 9:
94780 No=8:sp_on 7,1:sp_on 10,0
94790 pause 200:goto Buka_Input_Born_Month2:
94800 case 8:
94810 No=7:sp_on 4,1:sp_on 7,0
94820 pause 200:goto Buka_Input_Born_Month2:
94830 case 7:
94840 pause 200:goto Buka_Input_Born_Month2:
94850 end select
94860 endif
94870 '右  十字キー　右　or カーソル　右
94880 if ((y2 = 1) or (key$ = chr$(28))) then
94890 select case No
94900 '0ボタンからokボタン右に移動
94910 case 0:
94920 No=-1:sp_on 14,1:sp_on 13,0
94930 pause 200:goto Buka_Input_Born_Month2:
94940 '0ボタンからokボタン 右に移動　ここまで
94950 'OKボタンで右を押して何もしない
94960 case -1:
94970 pause 200:goto Buka_Input_Born_Month2:
94980 case 1:
94990 No=2:sp_on 9,1:sp_on 6,0
95000 pause 200:goto Buka_Input_Born_Month2:
95010 case 2:
95020 No=3:sp_on 12,1:sp_on 9,0
95030 pause 200:goto Buka_Input_Born_Month2:
95040 case 3:
95050 pause 200:goto Buka_Input_Born_Month2:
95060 case 4:
95070 No=5:sp_on 8,1:sp_on 5,0
95080 pause 200:goto Buka_Input_Born_Month2:
95090 case 5:
95100 No=6:sp_on 11,1:sp_on 8,0
95110 pause 200:goto Buka_Input_Born_Month2:
95120 case 7:
95130 No=8:sp_on 7,1:sp_on 4,0
95140 pause 200:goto Buka_Input_Born_Month2:
95150 case 8:
95160 No=9:sp_on 10,1:sp_on 7,0
95170 pause 200:goto Buka_Input_Born_Month2:
95180 case 9:
95190 pause 200:goto Buka_Input_Born_Month2:
95200 case 6:
95210 pause 200:goto Buka_Input_Born_Month2:
95220 end select
95230 'Okから右ボタンを押して何もしない ここまで
95240 endif
95250 '十字キー　ここまで
95260 '右の丸ボタン　決定キー
95270 if ((bg=2) or (key$=chr$(13))) then
95280 select case count
95290 case 0:
95300 count=1:buf_buka_Month$="*":buf_buka_Month$=str$(No)+"*":buf_buka_month=No
95310 buf_Buka_Born_Day(1)=buf_buka_month:a=buf_buka_month
95320 locate 1,3
95330 color RGB(255,255,255)
95340 print "部下の生まれた月(1月~12月):"+buf_buka_Month$
95350 goto Buka_Input_Born_Month2:
95360 case 1:
95370 count = 2:buf_buka_month=a*10+No
95380 if (No = -1) then
95390 'count=0
95400 month=buf_buka_month
95410 buf_buka_month=val(buf_buka_Month$)
95420 month=buf_buka_month
95430 '生まれた日に飛ぶ
95440 goto Buka_Input_Born_Day:
95450 else
95460 buf_buka_month = a * 10 + No
95470 buf_buka_Month$ = str$(buf_buka_month)
95480 buf_Buka_Born_Day(1) = buf_buka_month
95490 locate 1,3
95500 color Rgb(255,255,255)
95510 print "部下の生まれた月(1月~12月):" + buf_buka_Month$
95520 goto Buka_Input_Born_Month2:
95530 endif
95540 case 2:
95550 count=3
95560 'c= val(buf_Month$)
95570 'buf_month = c*10 + No
95580 'buf_Month$ = str$(buf_month)
95590 'locate 2,3
95600 'print "部下の生まれた月(1月～12月):";buf_Month$
95610 'goto Buka_Input_Born_Month2:
95620 'case 3:
95630 'count=4
95640 'b=val(buf_month$)
95650 'buf_month=c*10+No
95660 'buf_Month$=str$(buf_month)
95670 'locate 2,3
95680 'print "部下の生まれた月(1月～12月):";buf_Month$
95690 'buf_month=val(buf_Month$)
95700 'year=val(buf_year$)
95710 if (No=-1) then
95720 goto Buka_Input_Born_Day:
95730 else
95740 goto Input_Born_Month2:
95750 endif
95760 'case 4:
95770 'bufyear=buf_year
95780 'if (No=-1) then
95790 'buf_month = val(buf_Month$)
95800 'month = buf_month
95810 'sp_on 14,0
95820 'goto Input_Born_Day:
95830 'else
95840 'goto Input_Born_Month2:
95850 'endif
95860 end select
95870 endif
95880 '左の丸ボタン　キャンセル
95890 if (bg2=2) then
95900 select case count2
95910 case 0:
95920 if (No = -1) then
95930 buf_buka_month=0:buf_buka_Month$="**"
95940 count=0
95950 goto rewrite2:
95960 else
95970 if ((No>=1 and No<=9) or (No>=10 and No <=12)) then
95980 buf_month=0:buf_Month$="**"
95990 locate 2,3
96000 color rgb(255,255,255)
96010 print "                                       "
96020 goto rewrite2:
96030 if (No>12) then
96040 ui_msg"値が範囲外です。"
96050 goto rewrite2:
96060 endif
96070 endif
96080 endif
96090 rewrite2:
96100 locate 2,3
96110 color rgb(255,255,255)
96120 print "                                      "
96130 locate 2,3
96140 print "部下の生まれた月(1月~12月):";buf_buka_Month$
96150 goto Buka_Input_Born_Month2:
96160 end select
96170 'endif
96180 endif
96190 end
96200 '2.部下の生まれた月'
96210 '3.部下の生まれた日'
96220 '生れた日を入力
96230 Buka_Input_Born_Day:
96240 '生まれた日入力
96250 cls 3:play ""
96260 'No=-1:Okのとき
96270 init"kb:4":key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_Day$ = "**":count=0:bg2=0
96280 for i=0 to 1
96290 buf_day(i)=0
96300 next i
96310 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
96320 '****************************************************************************************************
96330 'WUXG(1920x1200)の時ここから
96340 '****************************************************************************************************
96350 gload Gazo$ + "Screen2.png",0,0,0
96360 gload Gazo$ + "downscreen.png",0,0,800
96370 '****************************************************************************************************
96380 'WUXG(1920x1200)の時ここまで
96390 '****************************************************************************************************
96400 'Init"kb:2"
96410 '音声ファイル再生 2023.06.07
96420 play Voice$ + "Input_Born_Day_Buka_20230831.mp3"
96430 font 48
96440 locate 0,1
96450 '文字色：黒　 color rgb(0,0,0)
96460 color rgb(255,255,255)
96470 print "部下の生まれた日を入れて下さい" + chr$(13)
96480 color rgb(255,255,255)
96490 locate 1,3
96500 print "部下の生まれた日(1日~31日):";buf_Day$
96510 color rgb(255,255,255)
96520 'locate 4,6:print ":7"
96530 'locate 9,6:print ":8"
96540 'locate 12,6:print ":9"
96550 'locate 4,6
96560 'print ":7  :8  :9" + chr$(13)
96570 'color rgb(255,255,255)
96580 'locate 4,8
96590 'print ":4  :5  :6" + chr$(13)
96600 'color rgb(255,255,255)
96610 'locate 4,10
96620 'print ":1  :2  :3" + chr$(13)
96630 'locate 4,12
96640 'print "    :0"
96650 'locate 12,12
96660 'color rgb(0,0,255)
96670 'print ":Ok"
96680 sp_on 4,0: sp_on 5,0:sp_on 6,0
96690 sp_on 7,0:sp_on 8,0:sp_on 9,0
96700 sp_on 10,0:sp_on 11,0:sp_on 12,0
96710 sp_on 13,0:sp_on 14,1
96720 Buka_Input_Born_Day2:
96730 '
96740 key$="":bg=0:y=0:y2=0:bg2=0
96750 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
96760 key$ = inkey$
96770 bg = strig(1)
96780 y = stick(1)
96790 y2 = stick(0)
96800 bg2 = strig(0)
96810 pause 200
96820 wend
96830 '十字キー　ここから
96840 '上の矢印　または、十字キー上
96850 if ((y = -1) or (key$ = chr$(30))) then
96860 select case No
96870 'No=-1:okのとき:初期の状態
96880 '0kボタンから３に移動
96890 '上に行く 処理
96900 case -1:
96910 No=3:sp_on 12,1:sp_on 14,0
96920 pause 200:goto Buka_Input_Born_Day2:
96930 '選択肢:3
96940 '3ボタンから 6に移動
96950 case 3:
96960 No=6:sp_on 12,0:sp_on 11,1
96970 pause 200:goto Buka_Input_Born_Day2:
96980 '6ボタンから ９に移動
96990 case 6:
97000 No=9:sp_on 10,1:sp_on 11,0
97010 pause 200:goto Buka_Input_Born_Day2:
97020 '6ボタンから ９に移動　ここまで
97030 '9で上を押して何もしない
97040 case 9:
97050 '何もしない
97060 No=9
97070 pause 200:goto Buka_Input_Born_Day2:
97080 '9で上を押しても何もしない　ここまで
97090 '上　 0ボタンから2ボタン
97100 'sp_on 6,1:1
97110 'sp_on 8,1:5
97120 'sp_on 7,1:7
97130 case 0:
97140 No=2:sp_on 13,0:sp_on 9,1:
97150 pause 200:goto Buka_Input_Born_Day2:
97160 '上  0ボタンから2ボタン　ここまで
97170 '2から５になる 上
97180 case 2:
97190 No=5:sp_on 8,1:sp_on 9,0:
97200 pause 200:goto Buka_Input_Born_Day2:
97210 case 5:
97220 No=8:sp_on 7,1:sp_on 8,0
97230 pause 200:goto Buka_Input_Born_Day2:
97240 case 8:
97250 pause 200:goto Buka_Input_Born_Day2:
97260 case 1:
97270 No=4:sp_on 5,1:sp_on 6,0
97280 pause 200:goto Buka_Input_Born_Day2:
97290 case 4:
97300 No=7:sp_on 4,1:sp_on 5,0
97310 pause 200:goto Buka_Input_Born_Day2:
97320 case 7:
97330 pause 200:goto Buka_Input_Born_Day2:
97340 end select
97350 endif
97360 '左３　ここまで
97370 '下の矢印
97380 '中央 2
97390 if ((y=1) or (key$ = chr$(31))) then
97400 select case No
97410 '9から６に下げる
97420 case 9:
97430 No=6:sp_on 11,1:sp_on 10,0
97440 pause 200:goto Buka_Input_Born_Day2:
97450 '6から３に下げる
97460 case 6:
97470 No=3:sp_on 12,1:sp_on 11,0
97480 pause 200:goto Buka_Input_Born_Day2:
97490 '3から０ｋに変える
97500 case 3:
97510 No=-1:sp_on 14,1:sp_on 12,0
97520 pause 200:goto Buka_Input_Born_Day2:
97530 'Okから下のボタンを押しても何もしない
97540 case -1:
97550 pause 200:goto Buka_Input_Born_Day2:
97560 case 8:
97570 No=5:sp_on 8,1:sp_on 7,0
97580 pause 200:goto Buka_Input_Born_Day2:
97590 case 5:
97600 No=2:sp_on 9,1:sp_on 8,0
97610 pause 200:goto Buka_Input_Born_Day2:
97620 case 2:
97630 No=0:sp_on 13,1:sp_on 9,0
97640 pause 200:goto Buka_Input_Born_Day2:
97650 case 0:
97660 pause 200:goto Buka_Input_Born_Day2:
97670 case 7:
97680 No=4:sp_on 5,1:sp_on 4,0
97690 pause 200:goto Buka_Input_Born_Day2:
97700 case 4:
97710 No=1:sp_on 6,1:sp_on 5,0
97720 pause 200:goto Buka_Input_Born_Day2:
97730 case 1:
97740 pause 200:goto Buka_Input_Born_Day2:
97750 end select
97760 endif
97770 '左へボタン 十字キー　左　or 　カーソル左
97780 if ((y2 = -1) or (key$ = chr$(29))) then
97790 select case No
97800 'Ok ボタン  Okから　左　０に行く
97810 case -1:
97820 No=0:sp_on 13,1:sp_on 14,0
97830 pause 200:goto Buka_Input_Born_Day2:
97840 '0 ボタン  左　何もしない
97850 case 0:
97860 pause 200:goto Buka_Input_Born_Day2:
97870 case 3:
97880 No=2:sp_on 9,1:sp_on 12,0:
97890 pause 200:goto Buka_Input_Born_Day2:
97900 case 2:
97910 No=1:sp_on 6,1:sp_on 9,0:
97920 pause 200:goto Buka_Input_Born_Day2:
97930 case 1:
97940 pause 200:goto Buka_Input_Born_Day2:
97950 case 6:
97960 No=5:sp_on 8,1:sp_on 11,0
97970 pause 200:goto Buka_Input_Born_Day2:
97980 case 5:
97990 No=4:sp_on 5,1:sp_on 8,0
98000 pause 200:goto Buka_Input_Born_Day2:
98010 case 4:
98020 pause 200:goto Buka_Input_Born_Day2:
98030 case 9:
98040 No=8:sp_on 7,1:sp_on 10,0
98050 pause 200:goto Buka_Input_Born_Day2:
98060 case 8:
98070 No=7:sp_on 4,1:sp_on 7,0
98080 pause 200:goto Buka_Input_Born_Day2:
98090 case 7:
98100 pause 200:goto Buka_Input_Born_Day2:
98110 end select
98120 endif
98130 '右  十字キー　右　or カーソル　右
98140 if ((y2 = 1) or (key$ = chr$(28))) then
98150 select case No
98160 '0ボタンからokボタン右に移動
98170 case 0:
98180 No=-1:sp_on 14,1:sp_on 13,0
98190 pause 200:goto Buka_Input_Born_Day2:
98200 '0ボタンからokボタン 右に移動　ここまで
98210 'OKボタンで右を押して何もしない
98220 case -1:
98230 pause 200:goto Buka_Input_Born_Day2:
98240 case 1:
98250 No=2:sp_on 9,1:sp_on 6,0
98260 pause 200:goto Buka_Input_Born_Day2:
98270 case 2:
98280 No=3:sp_on 12,1:sp_on 9,0
98290 pause 200:goto Buka_Input_Born_Day2:
98300 case 3:
98310 pause 200:goto Buka_Input_Born_Day2:
98320 case 4:
98330 No=5:sp_on 8,1:sp_on 5,0
98340 pause 200:goto Buka_Input_Born_Day2:
98350 case 5:
98360 No=6:sp_on 11,1:sp_on 8,0
98370 pause 200:goto Buka_Input_Born_Day2:
98380 case 7:
98390 No=8:sp_on 7,1:sp_on 4,0
98400 pause 200:goto Buka_Input_Born_Day2:
98410 case 8:
98420 No=9:sp_on 10,1:sp_on 7,0
98430 pause 200:goto Buka_Input_Born_Day2:
98440 case 9:
98450 pause 200:goto Buka_Input_Born_Day2:
98460 case 6:
98470 pause 200:goto Buka_Input_Born_Day2:
98480 end select
98490 'Okから右ボタンを押して何もしない ここまで
98500 endif
98510 '十字キー　ここまで
98520 '右の丸ボタンを押したとき
98530 if ((bg = 2) or (key$ = chr$(13))) then
98540 'count :決定ボタンを押した回数
98550 select case (count)
98560 '1桁目入力
98570 case 0:
98580 count = 1:
98590 if (No = -1) then
98600 '1桁目　OKでは何もしない
98610 'goto check:
98620 No=0
98630 else
98640 'ok以外のボタンを押したとき
98650 buf_buka_day = No:buf_buka_Day$ = str$(No)
98660 if (buf_buka_day = 1 or buf_buka_day=2 or buf_buka_buka_day=3 ) then
98670 buf_buka_Day$ = str$(No) + "*"
98680 endif
98690 a=No
98700 buf_Buka_Born_Day(2) = buf_buka_day
98710 locate 1,3
98720 print"                                      "
98730 color RGB(255,255,255)
98740 locate 1,3
98750 print "部下の生まれた日(1日~31日):" + buf_buka_Day$
98760 endif
98770 check2:
98780 if (No >= 1 and No <= 9) then
98790 sp_on 14,0
98800 goto Buka_Input_Born_Day2:
98810 else
98820 sp_on 14,0
98830 goto Result_Business_Aisyou:
98840 end
98850 endif
98860 case 1:
98870 '10未満の数字ボタン+okボタン or 2桁目の数字ボタン
98880 count = 2:
98890 'locate 2,3
98900 'color RGB(255,255,255)
98910 'print "生まれた日(1日~31日):";buf_Day$
98920 'Okボタンを押したときの処理
98930 '入力値　10未満のとき
98940 'c = buf_day
98950 if (No = -1) then
98960 'c=buf_day
98970 ' buf_day = c
98980 'buf_Day$ = str$(buf_day)
98990 '10以下のとき
99000 No=0
99010 if (buf_day < 10) then
99020 sp_on 14,0
99030 goto Result_Business_Aisyou:
99040 end
99050 endif
99060 else
99070 sp_on 14,0
99080 'c=No
99090 buf_buka_day = a * 10 + No
99100 buf_buka_Day$ = str$(buf_buka_day)
99110 buf_Buka_Born_Day(2) = buf_buka_day
99120 locate 0,3
99130 color Rgb(255,255,255)
99140 print "                                       "
99150 locate 1,3
99160 print "部下の生まれた日(1日~31日):" + buf_buka_Day$
99170 goto Buka_Input_Born_Day2:
99180 endif
99190 '生まれた日　2桁目の数字　or 1桁の数字 + ok
99200 case 2:
99210 count=0
99220 'c=val(buf_Day$)
99230 'buf_day=c*10+No
99240 'buf_Day$=str$(buf_day)
99250 'day=buf_day
99260 'locate 2,3
99270 'print "生まれた日(1日〜31日):";buf_Day$
99280 'No=-1:ok ボタンを押したとき
99290 if (No = -1) then No=0
99300 if ((buf_buka_day > 0) and (buf_buka_day < 32)) then
99310 sp_on 14,0
99320 goto Result_Business_Aisyou:
99330 else
99340 goto Buka_Input_Born_Day2:
99350 endif
99360 'Okボタン以外を押したとき
99370 else
99380 c=val(buf_buka_Day$)
99390 buf_buka_day = c * 10 + No
99400 buf_buka_Day$ = str$(buf_buka_day)
99410 locate 1,3
99420 print "                "
99430 locate 1,3
99440 print "生まれた日(1日~31日):"+buf_buka_Day$
99450 goto Buka_Input_Born_Day2:
99460 'endif
99470 case 3:
99480 count=4
99490 'c=val(buf_day$)
99500 'buf_day=c*10+No
99510 'buf_day$=str$(buf_day)
99520 'locate 2,3
99530 'print "生まれた日を入れてください:";buf_day$
99540 'year=val(buf_year$)
99550 if (No = -1) then
99560 'goto Buka_Input_Born_Day:
99570 sp_on 14,0:
99580 goto complate_jyoushi:
99590 else
99600 goto Buka_Input_Born_Month2:
99610 endif
99620 'case 4:
99630 'bufyear=buf_year
99640 'if (No=-1) then
99650 'buf_day = val(buf_day$)
99660 'bufday = buf_day
99670 'sp_on 14,0
99680 goto complate_jyoushi:
99690 'else
99700 'goto Buka_Input_Born_Day2:
99710 'endif
99720 end select
99730 endif
99740 if (bg2=2) then
99750 select case count2
99760 case 0:
99770 if (No=-1) then
99780 'buf_day=0:buf_Day$="**"
99790 if (buf_buka_day >= 1 and buf_buka_day <= 31) then
99800 count=0
99810 buf_buka_day=0:buf_buka_Day$="**"
99820 goto rewrite_day3:
99830 else
99840 buf_buka_day=0:buf_buka_Day$="**"
99850 ui_msg"値が範囲外です"
99860 endif
99870 goto rewrite_day3:
99880 else
99890 goto rewrite_day3:
99900 endif
99910 rewrite_day3:
99920 locate 2,3
99930 color rgb(255,255,255)
99940 print "                                      "
99950 locate 1,3
99960 print "生まれた日(1日~31日):"+buf_buka_Day$
99970 goto Buka_Input_Born_Day2:
99980 end select
99990 endif
100000 '3.部下の生まれた日'
100010 '部下'
100020 '--------------------------------------------'
100030 'ビジネの相性　結果表示
100040 Result_Business_Aisyou:
100050 cls 3:init "kb:4"
100060 a=0:b=0:c=0:d=0:e=0:f=0
100070 bg=0:key$=""
100080 '****************************************************************************************************
100090 'WUXG(1920x1200)の時ここから
100100 '****************************************************************************************************
100110 gload Gazo$ + "Screen1.png",0,0,0
100120 gload Gazo$ + "downscreen.png",0,0,800
100130 '****************************************************************************************************
100140 'WUXG(1920x1200)の時ここから
100150 '****************************************************************************************************
100160 sp_on 14,0
100170 d = buf_Buka_Born_Day(0):e = buf_Buka_Born_Day(1):f = buf_Buka_Born_Day(2)
100180 buf_Buka = Kabara_Num(d,e,f)
100190 a_2 = buf_Buka
100200 Result_Aisyou$ = Kabara_Aisyou$(a_1,a_2)
100210 locate 0,1
100220 color rgb(255,0,0)
100230 print "●.相性診断結果１"
100240 locate 0,4:
100250 color rgb(255,255,255)
100260 print "1.上司の名前:";buffer_name$(0)
100270 locate 0,6
100280 print buf_Jyoushi_Born_Day(0) ;"." ;buf_Jyoushi_Born_Day(1);"." ;buf_Jyoushi_Born_Day(2);",数秘:";buf_Jyoushi
100290 locate 0,8
100300 print "2.部下の名前:";buffer_name$(1)
100310 locate 0,10
100320 print buf_Buka_Born_Day(0);".";buf_Buka_Born_Day(1);".";buf_Buka_Born_Day(2); ",";"数秘:";buf_Buka
100330 locate 0,12
100340 print "3.上司と部下の相性:";Result_Aisyou$
100350 locate 1,15
100360 color rgb(0,0,0)
100370 print "丸ボタン右:相性の説明,丸ボタン左:再診断"
100380 while ((bg <> 2) and (key$ <> chr$(13)) and bg2<>2 )
100390 bg = strig(1)
100400 key$ = inkey$
100410 bg2 = strig(0)
100420 pause 5
100430 wend
100440 if ((bg = 2) or (key$ = chr$(13))) then goto Result_Business_Aisyou2:
100450 if (bg2 = 2) then
100460 cls 3:goto Business_Aishou_Input_1_parson:
100470 endif
100480 'ビジネスの相性占い　結果2　説明
100490 Result_Business_Aisyou2:
100500 cls 3:bg=0:bg2=0:key$="":buf$=read_explain$(Result_Aisyou$):init "kb:4"
100510 gload Gazo$ + "Screen1.png",0,0,0
100520 locate 0,1
100530 color rgb(255,0,0)
100540 print "●.相性の説明"
100550 color rgb(255,255,255)
100560 locate 0,4
100570 print "相性:";Result_Aisyou$
100580 locate 0,6:
100590 print "相性の説明:";buf$
100600 locate 0,15
100610 color rgb(0,0,0)
100620 print "右の丸ボタン:トップ,左のボタン:前の画面"
100630 while ((bg <> 2) and (key$ <> chr$(13)) and (bg2<>2))
100640 bg = strig(1)
100650 bg2 = strig(0)
100660 key$ = inkey$
100670 pause 200
100680 wend
100690 if ((bg = 2) or (key$ = chr$(13))) then goto Main_Screen:
100700 if ((bg2 = 2)) then goto Result_Business_Aisyou:
100710 'Birds Eye Menu List
100720 Result_Birtheye_List1:
100730 'dim List$(4) Topに定義
100740 List$(0) = "1.バーズアイグリッドをもう一度診断"
100750 List$(1) = "2.診断結果"
100760 List$(2) = "3.データーを保存"
100770 List$(3) = "4.トップ画面に戻る"
100780 Birds_List1 = ui_select("List$","Menu")
100790 select case (Birds_List1)
100800 case 0: '1.もう一度診断
100810 for i=0 to 8
100820 buffer(i)=0
100830 next i
100840 goto Input_name1_Birdseye:
100850 case 1: '2.次へ行く
100860 gosub BirdsEye_Result2:
100870 case 2: '3.データーを保存
100880 ui_msg "データーを保存します"
100890 goto BirdsEye_Save_data:
100900 case 3: '4.トップに戻る
100910 for i=0 to 8
100920 buffer(i)=0
100930 next i
100940 goto Main_Screen:
100950 end select
100960 'BirdsEye Data Save
100970 BirdsEye_Save_data:
100980 if dir$(Save_data_Birdseye$) = "" then
100990 Mkdir Save_data_Birdseye$
101000 endif
101010 open Save_data_Birdseye$ + "BirdsEyedata_List.dat" for append as #1
101020 print #1,ucase$(name1$) + "," + ucase$(name2$) + "," + str$(buffer(0))+ "," + str$(buffer(1)) + "," + str$(buffer(2))+"," + str$(buffer(3)) + "," + str$(buffer(4)) + "," + str$(buffer(5)) + "," + str$(buffer(6)) + "," + str$(buffer(7)) + "," + str$(buffer(8))
101030 close #1
101040 ui_msg "データーを保存しました"
101050 goto Result_Birtheye_List1:
101060 'return
101070 '自作関数 ここから
101080 BirdsEyeGrid_Entry:
101090 cls 3:init "kb:4":key$="":bg=0:flag=0:bg2=0:play""
101100 '****************************************************************************************************
101110 'WUXG(1920x1200)の時 1280x 800の時共通　ここから
101120 '****************************************************************************************************
101130 gload Gazo$ + "BirdsEyeGrid_Entry_1080x240_20231220.png",0,0,0
101140 '****************************************************************************************************
101150 'WUXG(1920x1200)の時 1280x 800の時共通 ここまで
101160 '****************************************************************************************************
101170 font FONT
101180 if dir$(Save_data_Birdseye$ + "BirdsEyedata_List.dat") = "" then
101190 locate 1,2:print "登録件数は0件です。" + chr$(13):flag=0
101200 locate 1,4:print "右の丸:メイン画面へ行く"
101210 else
101220 flag=1
101230 open Save_data_Birdseye$ + "BirdsEyedata_List.dat" for input as #1
101240 while (eof(1)=0)
101250 line input #1,a$
101260 n = n + 1
101270 wend
101280 close #1
101290 'endif
101300 talk "登録件数は"+str$(n)+"件です。"
101310 if ((size(0)<=1280) and (size(1)<=800)) then
101320 '*****************************************************************************************************
101330 '1280x800の時　ここから
101340 '*****************************************************************************************************
101350 locate 1,3:print "登録件数は";str$(n);"件です"
101360 locate 1,6:print "左の丸：メイン画面へ行く"
101370 '*****************************************************************************************************
101380 '1280x800の時　ここまで
101390 '*****************************************************************************************************
101400 else
101410 '*****************************************************************************************************
101420 'WUXG(1920x1280)の時　ここから
101430 '*****************************************************************************************************
101440 locate 1,2:print "登録件数は";str$(n);"件です"
101450 locate 1,4:print "左の丸：メイン画面へ行く"
101460 '*****************************************************************************************************
101470 'WUXG(1920x1280)の時　ここまで
101480 '*****************************************************************************************************
101490 endif
101500 endif
101510 Entry_Count:
101520 while (bg <> 2 and key$ <> chr$(13) and bg2 <> 2)
101530 key$ = inkey$
101540 bg = strig(1)
101550 bg2 = strig(0)
101560 pause 200
101570 wend
101580 if ((bg = 2) or (key$ = chr$(13))) then
101590 if (n = 0) then
101600 '登録件数　０件のとき　メイン画面に行く
101610 goto Main_Screen:
101620 else
101630 '登録件数1件以上　次へ行く
101640 'ここを変更する
101650 goto Entry_List:
101660 endif
101670 endif
101680 if (bg2 = 2) then
101690 if (n > 0) then
101700 goto Main_Screen:
101710 else
101720 goto Entry_Count:
101730 endif
101740 endif
101750 Entry_List:
101760 cls 3:play"":color rgb(255,255,255):init "kb:4"
101770 if ((size(0)<=1280) and (size(1)<=800)) then
101780 gload Gazo$ + Gazo_WXGA$ + "Result_Birtheye1_907x680_20240222.png",0,0,0
101790 else
101800 gload Gazo$ + "Result_Birtheye1_20230630.png",0,0,0
101810 endif
101820 dim buffer_List$(11,n)
101830 'ファイル読み込み ここから
101840 open Save_data_Birdseye$ + "BirdsEyedata_List.dat" for input as #1
101850 for i=0 to 10
101860 for j=0 to n-1
101870 input #1,a$
101880 buffer_List$(i,j)=a$
101890 next j
101900 next i
101910 close #1
101920 'erase buffer_List$
101930 'color rgb(255,255,255)
101940 i=0:key$="":bg=0:init"kb:4":bg2=0
101950 while (key$ <> chr$(13) and bg <> 2 and bg2 <> 2)
101960 key$ = inkey$
101970 bg = strig(1)
101980 bg2=strig(0)
101990 pause 200
102000 wend
102010 color rgb(0,0,0)
102020 locate 1,15:print "次へ"
102030 'show_ListData:
102040 'j=0
102050 repeat (j=0)
102060 show_ListData:
102070 cls
102080 color rgb(255,255,255)
102090 locate 6,3:print buffer_List$(0,j) + buffer_List$(1,j)
102100 '1の文字データー
102110 locate 4,14:print buffer_List$(2,j)
102120 '2の文字データー
102130 locate 4,9:print buffer_List$(3,j)
102140 '3の文字データー
102150 locate 4,5:print buffer_List$(4,j)
102160 '4の文字データー
102170 locate 11,14:print buffer_List$(5,j)
102180 '5の文字データー
102190 locate 11,9:PRINT buffer_List$(6,j)
102200 '6の文字データー
102210 locate 11,5:print buffer_List$(7,j)
102220 '7の文字データー
102230 locate 16,14:print buffer_List$(8,j)
102240 '8の文字データー
102250 locate 16,9:print buffer_List$(9,j)
102260 '9の文字データー
102270 locate 16,5:print buffer_List$(10,j)
102280 color rgb(0,0,0)
102290 locate 1,15:print "右の丸：次へ"
102300 if (bg=2 or key$=chr$(13)) then
102310 j=j+1
102320 endif
102330 if (bg2=2) then
102340 goto Main_Screen:
102350 endif
102360 until (j=n)
102370 'erase buffer_List$:
102380 goto show_ListData:
102390 'ファイル読み込み　ここまで
102400 func read_explain$(ba$)
102410 d$=""
102420 buf_String$=""
102430 if ba$="A" then
102440 open Business_Aisyou_Explain$ + "Business_Result_Explain_A.dat" for input as #1
102450 line input #1,a$
102460 a1$=mid$(a$,1,12)
102470 a2$=mid$(a$,13,17)
102480 a3$=mid$(a$,30,17)
102490 a4$=mid$(a$,47,18)
102500 a5$ = a1$ + chr$(13) + a2$ + chr$(13) + a3$+chr$(13)+a4$
102510 buf_String$ = a5$
102520 close #1
102530 endif
102540 if ba$="B"  then
102550 open Business_Aisyou_Explain$ + "Business_Result_Explain_B.dat" for input as #1
102560 line input #1,b$
102570 b1$=mid$(b$,1,15)
102580 b2$=mid$(b$,16,21)
102590 'b3$=mid$(b$,33,3)
102600 b4$ = b1$ + chr$(13) + b2$ + chr$(13)
102610 buf_String$ = b4$
102620 close #1
102630 endif
102640 if ba$="C"  then
102650 open Business_Aisyou_Explain$ + "Business_Result_Explain_C.dat" for input as #1
102660 line input #1,c$
102670 c1$ = Mid$(c$,1,15)
102680 c2$ = Mid$(c$,16,33)
102690 c3$ = c1$ + chr$(13) + c2$
102700 buf_String$ = c3$
102710 close #1
102720 endif
102730 if ba$="D" then
102740 open Business_Aisyou_Explain$ + "Business_Result_Explain_D.dat" for input as #1
102750 line input #1,d$
102760 d1$=mid$(d$,1,15)
102770 d2$=mid$(d$,16,22)
102780 d3$=mid$(d$,38,7)
102790 d4$ = d1$ + chr$(13) + d2$ + chr$(13) + d3$
102800 buf_String$ = d4$
102810 close #1
102820 endif
102830 if ba$="E"  then
102840 open Business_Aisyou_Explain$ + "Business_Result_Explain_E.dat" for input as #1
102850 line input #1,e$
102860 e1$=Mid$(e$,1,16)
102870 e2$=Mid$(e$,17,16)
102880 e3$=Mid$(e$,33,12)
102890 e4$=Mid$(e$,45,17)
102900 e5$=Mid$(e$,62,17)
102910 e6$ = e1$ +chr$(13) + e2$ + chr$(13) + e3$ + chr$(13) + e4$ + chr$(13) + e5$
102920 buf_String$ = e6$
102930 close #1
102940 endif
102950 if ba$="F" then
102960 '改行を追加して表示を調整
102970 open Business_Aisyou_Explain$ + "Business_Result_Explain_F.dat" for input as #1
102980 line input #1,f$
102990 f1$=Mid$(f$,1,15)
103000 f2$=Mid$(f$,16,12)
103010 buf_String$ = f1$+chr$(13)+f2$
103020 close #1
103030 endif
103040 if ba$="G" then
103050 open Business_Aisyou_Explain$ + "Business_Result_Explain_G.dat" for input as #1
103060 line input #1,g$
103070 g1$ = mid$(g$,1,16)
103080 g2$ = mid$(g$,17,18)
103090 g3$ = mid$(g$,36,21)
103100 g4$ = mid$(g$,56,6)
103110 g5$ = g1$ + chr$(13) + g2$ + chr$(13) + g3$ + chr$(13) +g4$
103120 buf_String$ = g5$
103130 close #1
103140 endif
103150 if ba$="H" then
103160 open Business_Aisyou_Explain$ + "Business_Result_Explain_H.dat" for input as #1
103170 line input #1,h$
103180 h1$=Mid$(h$,1,17)
103190 h2$=Mid$(h$,18,21)
103200 h3$=Mid$(h$,39,20)
103210 h$ = chr$(13) + h1$ + chr$(13) + h2$ + chr$(13) + h3$
103220 buf_String$ = h$
103230 close #1
103240 endif
103250 if ba$ = "I" then
103260 open Business_Aisyou_Explain$ + "Business_Result_Explain_I.dat" for input as #1
103270 line input #1,i$
103280 i1$=Mid$(i$,1,10)
103290 i2$=Mid$(i$,11,13)
103300 i3$=Mid$(i$,25,16)
103310 i$=i1$+chr$(13)+i2$+chr$(13)+i3$
103320 buf_String$ = i$
103330 close #1
103340 endif
103350 buffer$ = buf_String$
103360 endfunc buffer$
103370 'カバラ数（数秘番号を求める）
103380 func Kabara_Num(buffer_Year,month,day)
103390 '=============================
103400 'a1:4桁のうちの1桁目を求める
103410 '例 a1:1234の4が1桁目
103420 'a2:4桁のうちの2桁目を求める
103430 '例:a2:1234の3が2桁目
103440 'a3:4桁のうちの3桁目を求める
103450 '例 a3:1234の2が3桁目
103460 'a4:4桁のうちの4桁目を求める
103470 '例 a4:1234の1が4桁目
103480 '==============================
103490 a1=0:a2=0:a3=0:a4=0:a_=0:buffer=0
103500 Year = buffer_Year
103510 '処理1　整数部分を取り出す。
103520 a4 = fix(Year / 1000)
103530 a3 = fix(Year / 100) - (a4 * 10)
103540 a2 = fix(Year / 10) - (a4 * 100 + a3 * 10)
103550 a1 = fix(Year - (a4 * 1000 + a3 * 100 + a2 * 10))
103560 '処理　２　取り出した整数部分を足す。
103570 a_ = a1 + a2 + a3 + a4 +month + day
103580 'a1=0:a2=0:a3=0:a4=0
103590 if ((a_ = 11) or (a_ > 1 and a _< 9)) then
103600 buffer = a_
103610 'else
103620 goto recomp2:
103630 'if (a_ = 10) then
103640 '  buffer = 1
103650 endif
103660 recomp2:
103670 a5=0:a6=0
103680 a5 = fix(a_ / 10)
103690 a6 = (a_) - (a5 * 10)
103700 a_ = a5 + a6
103710 if ((a_>0 and a_<10) or (a_=11) or (a_=22)) then
103720 '結果に行く
103730 goto Res2:
103740 '  if ((a_>11) and (a_<99)) then
103750 else
103760 '再度計算
103770 goto recomp2:
103780 endif
103790 '     a1 = fix(a_ / 10)
103800 '     a2 = a_ - (a1 * 10)
103810 '     a_ = a1 + a2
103820 '     buffer = a_
103830 'endif
103840 'else
103850 '    bffer = a_
103860 'endif
103870 'endif
103880 'else
103890 'talk "プログラムを終了します。"
103900 'end
103910 'endif
103920 'kabara = 10
103930 Res2:
103940 kabara = a_
103950 endfunc kabara
103960 func Kabara_Aisyou$(buff1,buff2)
103970 a=0:b=0
103980 '範囲　1~9
103990 if ((buff1 > 0 and buff1 < 10)) then
104000 a = buff1
104010 else
104020 Select case buff1
104030 case 11:
104040 buff1=9:a=buff1
104050 case 22:
104060 buff1=10:a=buff1
104070 end select
104080 endif
104090 '範囲　１~９
104100 if ((buff2 > 0 and buff2 < 10)) then
104110 b = buff2
104120 else
104130 select case buff2
104140 case 11:
104150 buff2=9:b=buff2
104160 case 12:
104170 buff2=10:b=buff2
104180 end select
104190 endif
104200 Aisyou$ = Buffer_Business_Aisyou$(a,b)
104210 endfunc Aisyou$
104220 '**********************************************************
104230 '0-0.Top Screen Recheck: ここから
104240 '**********************************************************
104250 TopScreenRecheck:
104260 color rgb(217,255,212)
104270 locate 1,3:print  "                            "
104280 locate 1,4:print  "                            "
104290 locate 1,5
104300 print "番号を選んでください"
104310 locate 1,6:print  "                            "
104320 locate 1,7:print  " :1.数秘術占い"
104330 locate 1,8:print  "                            "
104340 locate 1,9:print  "                            "
104350 locate 1,10:print  "                            "
104360 locate 1,10:print  " :2.設 定"
104370 locate 1,11:print  "                            "
104380 locate 1,12:print  "                            "
104390 locate 1,13:print  " :3.ヘルプ"
104400 locate 1,14:print  "                            "
104410 locate 1,15:print  "                            "
104420 locate 1,16:print  "                            "
104430 locate 1,16:print  " :4.(プログラムを)終了する"
104440 locate 1,17:print  "                            "
104450 locate 1,18:print  "                            "
104460 return
104470 '**********************************************************
104480 '0-0.Top Screen Recheck:　ここまで
104490 '**********************************************************
104500 '***********************************************************
104510 '1-1.数秘術トップ画面 ここから
104520 '**********************************************************
104530 Kabara_TopScreen_Recheck:
104540 color rgb(255,255,255):font FONT
104550 locate 1,5
104560 print "番号を選んでください" + chr$(13)
104570 locate 1,7
104580 print " :1.数秘術占い" + chr$(13)
104590 locate 1,10
104600 print " :2.バーズアイグリット" + chr$(13)
104610 locate 1,13
104620 print " :3.相性占い" + chr$(13)
104630 locate 1,16
104640 print " :4.トップ画面に戻る" + chr$(13)
104650 return
104660 '***************************************************************
104670 '1-1.数秘術トップ画面　ここまで
104680 '*************************************************************
104690 '**********************************************************
104700 '2-1 Setting Top Screen ここから
104710 '**********************************************************
104720 Setting_Recheck:
104730 cls:color rgb(255,255,255)
104740 locate 1,3:print  "                            "
104750 locate 1,4:print  "                            "
104760 locate 1,5:
104770 print "番号を選んでください"
104780 locate 1,6:print  "                            "
104790 locate 1,7:
104800 print " :1.トップ画面に戻る"
104810 locate 1,8:print  "                            "
104820 locate 1,9:print  "                            "
104830 locate 1,10:
104840 print " :2.バーズアイグリッドデーターリスト"
104850 locate 1,11:print  "                            "
104860 locate 1,12:print  "                            "
104870 locate 1,13:
104880 print " :3.未実装" + chr$(13)
104890 locate 1,14:print  "                            "
104900 locate 1,15:print  "                            "
104910 locate 1,16:
104920 print " :4.未実装" + chr$(13)
104930 locate 1,17:print  "                            "
104940 locate 1,18:print  "                            "
104950 return
104960 '**********************************************************
104970 '2-1 Setting Top Screen ここまで
104980 '**********************************************************
104990 '**********************************************************
105000 '3-1Help Top ReCheck ここから
105010 '**********************************************************
105020 Help_Top_ReCheck:
105030 font FONT
105040 color rgb(217,255,212)
105050 locate 1,3:print  "                       "
105060 locate 1,4:print  "                       "
105070 locate 1,5:print "番号を選んでください"
105080 locate 1,6:print  "                       "
105090 '0
105100 locate 1,7:print " :1.ルールの説明"
105110 '1
105120 locate 1,8:print  "                       "
105130 locate 1,9:print  "                       "
105140 locate 1,10:print " :2.バージョンの表示"
105150 locate 1,11:print  "                      "
105160 locate 1,12:print  "                      "
105170 '2
105180 locate 1,13:print " :3.参考文献"
105190 locate 1,14:print  "                      "
105200 locate 1,15:print  "                      "
105210 '3
105220 locate 1,16:print " :4.トップ画面に戻る"
105230 return
105240 '**********************************************************
105250 '3-1.Help Top ReCheckここまで
105260 '**********************************************************
105270 '***********************************************************
105280 '**********************************************************
105290 Suhi_Rule_Screen_Recheck:
105300 color rgb(255,255,255)
105310 font FONT
105320 locate 1,3:print  "                       "
105330 locate 1,4:print  "                       "
105340 locate 1,5
105350 print "番号を選んでください"
105360 locate 1,6:print  "                       "
105370 locate 1,7:    '〇
105380 print " :1.数秘術のやり方"
105390 locate 1,8:print  "                       "
105400 locate 1,9:print  "                       "
105410 locate 1,10:   '〇
105420 print " :2.バーズアイグリットの説明"
105430 locate 1,11:print  "                       "
105440 locate 1,12:print  "                       "
105450 locate 1,13:    '〇
105460 print " :3.トップ画面に戻る"
105470 locate 1,14:print  "                       "
105480 locate 1,15:print  "                       "
105490 return
105500 '=============================
105510 '自作関数 ここまで
105520 '1.数秘術　トップ画面
105530 '
105540 'Data_erase:を一番最後に持ってくる
105550 '=============================
105560 Data_erase:
105570 'メモリー削除
105580 erase buf_male_year
105590 erase buf_male_month
105600 erase buf_male_Born_Day
105610 erase buf_feMale_Born_Day
105620 erase buf_female_day
105630 erase buf_name1$
105640 erase buf_name2$
105650 erase buffer
105660 erase buf_chart$
105670 erase Buffer_Business_Aisyou$
105680 erase buffer_name$
105690 '上司の誕生日
105700 erase buf_Jyoushi_Born_Day
105710 '部下の誕生日
105720 erase buf_Buka_Born_Day
105730 erase buf_year
105740 erase buf_month
105750 erase buf_day
105760 'フォーカスライン
105770 erase Forcus1_buffer$
105780 erase Forcus2_buffer$
105790 erase Forcus3_buffer$
105800 'erase buffer_List$
105810 'Birds eye List Data 配列
105820 erase List$
105830 buffer$ = ""
105840 buf$ = ""
105850 buf_year$ = ""
105860 buf_Jyoushi_Kabara_Num = 0
105870 buf_Buka_Kabara_Num = 0
105880 count = 0
105890 buf_Month$ = ""
105900 buf_Day$ = ""
105910 b=0
105920 c=0
105930 No=0
105940 count=0
105950 return
