100 '(プログラムを)終了するを選択
110 cls 3
120 'AC.2019
130 '数秘術占い 2019.08.16
140 '改変履歴
150 'AC.2021
160 '"2021.03.31 α版 画面背景アップデート"
170 '"2021.04.02 β版 更にアップデート音声追加"
180 '"2021.04.03 β2版 画面表示拡張"
190 'AC.2023
200 '"2023.05.20 β3版　入力方式拡張"
210 'Version 更新履歴
220 '2023.06.04:Ver100_20230604
230 '2023.06.11:Ver101_20230611
240 '2023.06.18:Ver102_20230618
250 '2023.06.25:Ver103_20230625
260 '2023.07.02:Ver104_20230702
270 '2023.07.09:Ver105_20230709
280 '2023.07.16:Ver106_20230716
290 '2023.07.23:Ver107_20230723
300 '2023.07.30:Ver108_20230730
310 '2023.08.06:Ver109_20230806
320 '2023.08.13:Ver110_20230813
330 '2023.08.20:Ver111_20230820
340 '2023.08.27:Ver112_20230827
350 '2023.09.03:Ver113_20230903
360 '2023.09.10:Ver114_20230910
370 '2023.09.17:Ver115_20230917
380 '2023.09.24:Ver116_20230924
390 '2023.10.01:Ver117_20231001
400 '2023.10.08:Ver118_20231008
410 '2023.10.15:Ver119_20231015
420 '2023.10.22:Ver120_20231022
430 '2023.10.29:Ver121_20231029
440 '2023.11.05:Ver122_20231105
450 '2023.11.12:Ver123_20231112
460 '2023.11.19:Ver124_20231119
470 '2023.11.26:Ver125_20231126
480 '2023.12.03:Ver126_20231203
490 '2023.12.10:Ver127_20231210
500 '2023.12.17:Ver128_20231217
510 '2023.12.24:Ver129_20231224
520 '2023.12.31:Ver130_20231231
530 'AC.2024.01(Jan)
540 '2024.01.07:Ver131_20240107
550 '2024.01.14:Ver132_20240114
560 '2024.01.21:Ver133_20240121
570 '2024.01.28:Ver134_20240128
580 'AC.2024.02(Feb)
590 '2024.02.04:Ver135_20240204
600 '2024.02.11:Ver136_20240211
610 '2024.02.18:Ver137_20240218
620 '2024.02.25:Ver138_20240225
630 'AC.2024.03 (March)
640 '2024.03.03:Ver139_20240303
650 '2024.03.11:Ver140_20240311
660 '2024.03.18:Ver141_20240317
670 Version$ = "Ver:1.4.1_20240317"
680 'Gazo Folder Japan
690 Gazo$ = "./data/Picture/"
700 'Gazo Size folder
710 Gazo_1920x1200$ = "./1920x1200/"
720 Gazo_WXGA$ = "./907x680/"
730 'Gazo Folder English
740 Gazo_Eng$ = "./data/Picture/English/"
750 'Voice Folder 2023
760 Voice$ = "./data/Voice/Voice/"
770 'BirtheyeChart Data:20230626
780 Birth_eye_chart$ = "./data/chart_data/"
790 'Data Folder
800 Data$ = "./data/data/"
810 'Business Aisyou 結果説明保存フォルダ
820 Business_Aisyou_Explain$ = "./data/data/Business_Aisyou/"
830 'Save BirdsEyeGrit List Folder
840 Save_data_Birdseye$ = "./data/Parsonal_data/"
850 '変数定義 パート
860 b=0:c=0:n=0:count=0
870 '***********************************************************
880 '1.WXGAの時
890 '(1200 x 800)
900 '***********************************************************
910 if (((size(1) <= 1200) and (size(1) <= 800))) then
920 X=5:Y=200
930 FONT=32
940 '***********************************************************
950 '1.WXGAの時
960 '(1200 x 800)
970 '***********************************************************
980 else
990 '***********************************************************
1000 '2.WUXGAの時(WXGA以外の時)
1010 '(1920 gload Gazo$ + "Selection.png",1,60,240
1020 '***********************************************************
1030 X=5:Y=300
1040 FONT=48
1050 '***********************************************************
1060 '2.WUXGAの時(WXGA以外の時)
1070 '(1920 x 1200)
1080 '***********************************************************
1090 endif
1100 'dim buffer_List$(11,1)
1110 dim buf_name1$(10),buf_name2$(10)
1120 dim buffer(9),buf_chart$(26,2)
1130 'ビジネスの相性　データー
1140 dim Buffer_Business_Aisyou$(12,12)
1150 '男女の相性
1160 dim Buffer_Bitween_sexes_Aisyou$(12,12)
1170 '生れた年代
1180 dim buf_year(4):buf_year$ = ""
1190 dim buf_month(2)
1200 dim buf_day(2)
1210 'フォーカスライン　配列
1220 dim Forcus1_buffer$(3)
1230 dim Forcus2_buffer$(3)
1240 dim Forcus3_buffer$(2)
1250 '生れた月
1260 buf_Month$ = ""
1270 '生れた日
1280 buf_Day$ = ""
1290 'buffer_name$(3):Name Data x 2 & 上司の名前 (文字データー)
1300 dim buffer_name$(3)
1310 '1-1.上司の誕生日(数値データー)
1320 dim buf_Jyoushi_Born_Day(3)
1330 '1-2.上司の数秘ナンバー(数値データー)
1340 buf_Jyoushi_Kabara_Num = 0
1350 '2-1.部下の誕生日(数値データー)
1360 dim buf_Buka_Born_Day(3)
1370 '2-2.部下の数秘ナンバー(数秘データー)
1380 buf_Buka_Kabara_Num = 0
1390 dim buf_male_year(4)
1400 dim buf_male_month(2)
1410 dim buf_male_Born_Day(2)
1420 dim buf_feMale_Born_Day(2)
1430 dim buf_female_day(2)
1440 count=0
1450 'Birds Eye List 配列
1460 dim List$(6)
1470 '部下の数秘ナンバー
1480 'File 読み込み
1490 '1.ビジネスの相性占い
1500 open Data$ + "Kabara_Business_Aisyou.csv" for input as #1
1510 for i=0 to 11
1520 for j=0 to 11
1530 input #1,a$
1540 Buffer_Business_Aisyou$(j,i) = a$
1550 next j
1560 next i
1570 close #1
1580 '2.男女の相性占い
1590 open Data$ + "Kabara_bitween_sexes_Aisyou.csv" for input as #1
1600 for i=0 to 11
1610 for j=0 to 11
1620 input #1,a$
1630 Buffer_Bitween_sexes_Aisyou$(j,i) = a$
1640 next j
1650 next i
1660 close #1
1670 '2.Birth Eye chart$
1680 '2.バーズアイグリッドを読み込む
1690 open Birth_eye_chart$ + "Birtheyechart.dat" for input as #1
1700 for j=0 to 25
1710 for i=0 to 1
1720 input #1,a$
1730 buf_chart$(j,i) = a$
1740 next i
1750 next j
1760 close #1
1770 'File 読み込み　ここまで
1780 'Main画面
1790 screen 1,1,1,1
1800 Main_Screen:
1810 cls 3:
1820 No=0
1830 '***********************************************************
1840 '1.WXGAの時
1850 '(1200 x 800)
1860 '***********************************************************
1870 if ((size(0) <= 1280) and (size(1) <= 800)) then
1880 gload Gazo$ + "Selection.png",1,5,220
1890 gload Gazo$ + "Selection.png",1,5,320
1900 gload Gazo$ + "Selection.png",1,5,420
1910 gload Gazo$ + "Selection.png",1,5,520
1920 '***********************************************************
1930 '1(4)
1940 gload Gazo$ + "Selection.png",1,130,420
1950 '2(5)
1960 gload Gazo$ + "Selection.png",1,280,420
1970 '3(6)
1980 gload Gazo$ + "Selection.png",1,430,420
1990 '4(7)
2000 gload Gazo$ + "Selection.png",1,130,330
2010 '5(8)
2020 gload Gazo$ + "Selection.png",1,280,330
2030 '6(9)
2040 'gload Gazo$ + "Selection.png",1,70,500
2050 gload Gazo$ + "Selection.png",1,430,330
2060 '7(10)
2070 gload Gazo$ + "Selection.png",1,130,250
2080 '8(11)
2090 gload Gazo$ + "Selection.png",1,280,250
2100 '9(12)
2110 gload Gazo$ + "Selection.png",1,430,250
2120 '0(13)
2130 gload Gazo$ + "Selection.png",1,280,495
2140 '14:(-1)OK ボタン
2150 gload Gazo$ + "Selection.png",1,430,495
2160 '***********************************************************
2170 '1.WXGAの時
2180 '(1200 x 800)
2190 '***********************************************************
2200 else
2210 '***********************************************************
2220 '2.WXGA(1200 x 800)以外の時
2230 '(1920 x 1200)のサイズ
2240 '***********************************************************
2250 gload Gazo$ + "Selection.png",1,5,200
2260 gload Gazo$ + "Selection.png",1,5,300
2270 gload Gazo$ + "Selection.png",1,5,400
2280 gload Gazo$ + "Selection.png",1,5,500
2290 '4:1
2300 gload Gazo$ + "Selection.png",1,35,300
2310 '5:2
2320 gload Gazo$ + "Selection.png",1,35,400
2330 '6:3
2340 gload Gazo$ + "Selection.png",1,35,500
2350 '7:4
2360 gload Gazo$ + "Selection.png",1,70,300
2370 '8:5
2380 gload Gazo$ + "Selection.png",1,70,400
2390 '9:6
2400 gload Gazo$ + "Selection.png",1,70,500
2410 '10:7
2420 gload Gazo$ + "Selection.png",1,540,300
2430 '11:8
2440 gload Gazo$ + "Selection.png",1,540,400
2450 '12:9
2460 gload Gazo$ + "Selection.png",1,540,500
2470 '13:0
2480 gload Gazo$ + "Selection.png",1,150,400
2490 '-1:Ok
2500 gload Gazo$ + "Selection.png",1,200,400
2510 '***********************************************************
2520 '2.WXGA(1200 x 800)以外の時
2530 '(1920 x 1200)のサイズ
2540 '***********************************************************
2550 endif
2560 if ex_info$(1) <> "JP" then
2570 '英語　トップ画面
2580 gload Gazo_Eng$ + "Kabara_TopScreen_Eng_20240110.png",0,0,0
2590 'put@(0,0),1280,800,(1080,800)
2600 else
2610 '**********************************************************
2620 '［機能］　グラフィックバッファ（2番目の座標）からグラフィック画面（1番目の座標）へ画像データを引き出します。
2630 '
2640 '　［書式］　PUT@(x1,y1),w1,h1,(x2,y2)[,[w2],[h2][,描画モード]]
2650 '　［説明］
2660 '　　w1,w2=横サイズ h1,h2= 縦サイズ
2670 '　　転写元と転写先のサイズが異なる場合、拡大縮小描画されます。
2680 '　　各種重ね合わせの方式は pen命令で設定することができます。
2690 '　　<描画モード>の指定で次の選択ができます。
2700 '　　 0. グラフィックバッファからグラフィック画面への描画。
2710 '　　 1. グラフィック画面からグラフィック画面への描画。
2720 '　　 2. グラフィックバッファからグラフィックバッファへの描画。
2730 '***********************************************************'
2740 '*************************************************************************************************
2750 'if (((size(0) >= 1280) and (size(0) <= 1920)) and ((size(1) <= 1200) and (size(1) > 800))) then
2760 '日本語トップスクリーン
2770 'gload Gazo$ + "TopScreen_20230310.png",0,0,0
2780 'else
2790 '1.WXGAの時
2800 '************************************************************************************************
2810 if ((size(0) <= 1280) and (size(1) <= 800)) then
2820 gload Gazo$ + Gazo_WXGA$ + "Screen1_907x680_20240214.png",0,0,0
2830 else
2840 '************************************************************************************************
2850 '2.WXGA以外の時
2860 '************************************************************************************************
2870 gload Gazo$ + "TopScreen_20230310.png",0,0,0
2880 endif
2890 'put@(0,0),1280,800,(1080,800),,,0
2900 endif
2910 '***********************************************************************************************
2920 'if (((size(0) >= 1280) and (size(0) <= 1920)) and ((size(1) <= 1200) and (size(1) > 800))) then
2930 '***********************************************************************************************
2940 if ((size(0) <= 1280) and (size(1) <= 800)) then
2950 '************************************************************************************************
2960 'WXGAの場合　ここから (1280 x 800)
2970 '************************************************************************************************
2980 sp_def 0,(5,220),32,32
2990 sp_def 1,(5,320),32,32
3000 sp_def 2,(5,420),32,32
3010 sp_def 3,(5,520),32,32
3020 '1(4)
3030 sp_def 4,(130,420),32,32
3040 '2(5)
3050 sp_def 5,(280,420),32,32
3060 '3(6)
3070 sp_def 6,(430,420),32,32
3080 '4(7)
3090 sp_def 7,(130,330),32,32
3100 '5(8)
3110 sp_def 8,(280,330),32,32
3120 '6(9)
3130 sp_def 9,(430,330),32,32
3140 '9(10):9
3150 sp_def 10,(130,250),32,32
3160 '6(11):6
3170 sp_def 11,(280,250),32,32
3180 '9(12):3
3190 sp_def 12,(430,250),32,32
3200 sp_def 13,(280,495),32,32
3210 '14:OK ボタン (-1)
3220 sp_def 14,(430,495),32,32
3230 'Sprite OFF
3240 sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_on 4,0:sp_on 5,0:sp_on 6,0
3250 sp_on 7,0:sp_on 8,0:sp_on 9,0:sp_on 10,0:sp_on 11,0:sp_on 12,0:sp_on 13,0:sp_on 14,0
3260 sp_put 0,(5,220),0,0
3270 sp_put 1,(5,320),1,0
3280 sp_put 2,(4,420),2,0
3290 sp_put 3,(5,520),3,0
3300 '1
3310 sp_put 4,(130,420),4,0
3320 '2
3330 sp_put 5,(280,420),5,0
3340 '3
3350 sp_put 6,(430,420),6,0
3360 '4
3370 sp_put 7,(130,330),7,0
3380 '5
3390 sp_put 8,(280,330),8,0
3400 '6
3410 sp_put 9,(430,330),9,0
3420 '7
3430 sp_put 10,(130,250),10,0
3440 '8
3450 sp_put 11,(280,250),11,0
3460 '9
3470 sp_put 12,(430,250),12,0
3480 '0
3490 sp_put 13,(280,495),13,0
3500 '14:OK ボタン
3510 sp_put 14,(430,495),14,0
3520 '************************************************************************************************
3530 'WXGAの場合　ここまで (1280 x 800)
3540 '************************************************************************************************
3550 else
3560 '選択肢の丸
3570 '************************************************************************************************
3580 'WUXGAの場合　ここから (1920 x 1280)
3590 '************************************************************************************************
3600 gload Gazo$ + "downscreen.png",0,0,800
3610 sp_def 0,(5,300),32,32
3620 sp_def 1,(5,400),32,32
3630 sp_def 2,(5,500),32,32
3640 sp_def 3,(5,600),32,32
3650 '************************************************************************************************
3660 'sp_def  1920x1260 ここから
3670 '************************************************************************************************
3680 '1
3690 sp_def 4,(35,300),32,32
3700 '2
3710 sp_def 5,(35,400),32,32
3720 '3
3730 sp_def 6,(35,500),32,32
3740 '4:9
3750 sp_def 7,(70,300),32,32
3760 '5:6
3770 sp_def 8,(70,400),32,32
3780 '6:3
3790 sp_def 9,(70,500),32,32
3800 '**********************************************************************************************
3810 '10:7
3820 'gload Gazo$ + "Selection.png",1,430,300
3830 '11:8
3840 'gload Gazo$ + "Selection.png",1,430,420
3850 '12:9
3860 'gload Gazo$ + "Selection.png",1,430,500
3870 '**********************************************************************************************
3880 '7:3
3890 sp_def 10,(540,300),32,32
3900 '8:6
3910 sp_def 11,(540,400),32,32
3920 '9:9
3930 sp_def 12,(540,500),32,32
3940 '************************************************************************************************
3950 '0
3960 sp_def 13,(150,400),32,32
3970 '-1:ok Button
3980 sp_def 14,(200,400),32,32
3990 '************************************************************************************************
4000 'sp_def 1920x1260 ここまで
4010 '************************************************************************************************
4020 '1
4030 'sp_def 4,(35,300),32,32
4040 '2
4050 'sp_def 5,(35,400),32,32
4060 '3
4070 'sp_def 6,(35,500),32,32
4080 '4
4090 'sp_def 7,(70,300),32,32
4100 '5
4110 'sp_def 8,(70,400),32,32
4120 '6
4130 'sp_def 9,(70,500),32,32
4140 '7
4150 'sp_def 10,(110,300),32,32
4160 '8
4170 'sp_def 11,(110,400),32,32
4180 '9
4190 'sp_def 12,(110,400),32,32
4200 'sp_def 13,(150,400),32,32
4210 'sp_def 14,(200,400),32,32
4220 'Sprite OFF
4230 sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_on 4,0:sp_on 5,0:sp_on 6,0
4240 sp_on 7,0:sp_on 8,0:sp_on 9,0:sp_on 10,0:sp_on 11,0:sp_on 12,0:sp_on 13,0:sp_on 14,0
4250 '***********************************************************************************************************
4260 '選択肢の●　ここから  1920x1260  ここから
4270 '***********************************************************************************************************
4280 sp_put 0,(5,300),0,0
4290 sp_put 1,(5,400),1,0
4300 sp_put 2,(5,500),2,0
4310 sp_put 3,(5,600),3,0
4320 '***********************************************************************************************************
4330 '選択肢の● ここまで 1920x1260    ここまで
4340 '**********************************************************************************************************
4350 '********************************************************************************************************
4360 'sp_put 1920x1260 ここから
4370 '*********************************************************************************************************
4380 '1. 左
4390 '1
4400 sp_put 4,(130,300),4,0
4410 '2
4420 sp_put 5,(130,400),5,0
4430 '3
4440 sp_put 6,(130,500),6,0
4450 '2.中央
4460 '4
4470 sp_put 7,(340,300),7,0
4480 '5
4490 sp_put 8,(340,400),8,0
4500 '6
4510 sp_put 9,(340,500),9,0
4520 '右
4530 '7 (3)
4540 sp_put 10,(540,300),10,0
4550 '8 (6)
4560 sp_put 11,(540,400),11,0
4570 '9 (9)
4580 sp_put 12,(540,500),12,0
4590 '0
4600 sp_put 13,(340,600),13,0
4610 'ok Button
4620 sp_put 14,(540,600),14,0
4630 '*********************************************************************************************************
4640 'sp_put 1920x1260 ここまで
4650 '**********************************************************************************************************
4660 '1
4670 'sp_put 4,(130,300),4,0
4680 '2
4690 'sp_put 5,(130,400),5,0
4700 '3
4710 'sp_put 6,(130,500),6,0
4720 '4
4730 'sp_put 7,(340,300),7,0
4740 '5
4750 'sp_put 8,(340,400),8,0
4760 '6
4770 'sp_put 9,(340,500),9,0
4780 '7
4790 'sp_put 10,(540,300),10,0
4800 '8
4810 'sp_put 11,(540,400),11,0
4820 '9
4830 'sp_put 12,(540,500),12,0
4840 '0
4850 'sp_put 13,(340,600),13,0
4860 'sp_put 14,(540,600),14,0
4870 '************************************************************************************************
4880 'WUXGAの場合　ここまで  (1920 x 1200)
4890 '************************************************************************************************
4900 endif
4910 Main_Top:
4920 'Main Message 2023.06.07
4930 '再生を止める
4940 play ""
4950 init "kb:4"
4960 'font 32:
4970 font 40
4980 if ex_info$(1) <> "JP" then
4990 '1.英語表示ターム
5000 print chr$(13) + chr$(13) + chr$(13)
5010 color rgb(217,255,212)
5020 print "Please Select Number?" + chr$(13)+chr$(13)
5030 '0
5040 print " :1.Kabara Fortune..." + chr$(13)+chr$(13)
5050 '1
5060 print " :2.Setting" + chr$(13)+chr$(13)
5070 '2
5080 print " :3.Help" + chr$(13)
5090 '3
5100 print " :4.(Finishing)Program" + chr$(13)
5110 COLOR rgb(0,0,0):No=0
5120 locate 1,15
5130 print "                                        "
5140 locate 1,15
5150 print "1.It has Selected Kabara Fortune Telling"
5160 '1.英語表示ターム
5170 '---------音声 日本語　英語に変える----------------
5180 'play Voice$ + "Voice_Main_Message_20230607.mp3"
5190 '---------音声 日本語　英語に変える----------------
5200 else
5210 '2.日本語表示ターム
5220 'Main_Screen_Select:
5230 '************************************************************************************************
5240 '1.WXGAの場合　ここから (1280 x 800)
5250 '************************************************************************************************
5260 if ((size(0) <= 1280) and (size(1) <= 800)) then
5270 '************************************************************************************************
5280 '1.WXGAの場合　ここから (1280 x 800)
5290 '************************************************************************************************
5300 font FONT
5310 color rgb(217,255,212)
5320 locate 1,5
5330 print "番号を選んでください"
5340 '0
5350 locate 1,7
5360 print " :1.数秘術占い"
5370 '1
5380 locate 1,10
5390 print " :2.設 定"
5400 '2
5410 locate 1,13
5420 print " :3.ヘルプ"
5430 '3
5440 locate 1,16
5450 print " :4.(プログラムを)終了する"
5460 COLOR rgb(0,0,0):No=0
5470 'locate 1,15
5480 '3行下げる
5490 if (count = 0) then
5500 locate 1,19
5510 print "           "
5520 locate 1,19:color rgb(0,0,0):print "1.数秘術占いを選択"
5530 play Voice$ + "Voice_Main_Message_20230607.mp3"
5540 endif
5550 '************************************************************************************************
5560 '1.WXGAの場合　ここまで (1280 x 800)
5570 '************************************************************************************************
5580 '2.日本語表示ターム
5590 else
5600 '************************************************************************************************
5610 '2.WXGA以外の場合（WUXGAの場合）　ここから (1920 x 1280)
5620 '************************************************************************************************
5630 font FONT
5640 print chr$(13) + chr$(13) + chr$(13)
5650 color rgb(217,255,212)
5660 print "番号を選んでください" + chr$(13)
5670 '0
5680 print " :1.数秘術占い" + chr$(13)
5690 '1
5700 print " :2.設 定" + chr$(13)
5710 '2
5720 print " :3.ヘルプ" + chr$(13)
5730 '3
5740 print " :4.(プログラムを)終了する" + chr$(13)
5750 COLOR rgb(0,0,0):No=0
5760 'locate 1,15
5770 '3行下げる
5780 if count=0 then
5790 locate 1,15
5800 print "           "
5810 locate 1,15:color rgb(0,0,0):print "1.数秘術占いを選択"
5820 play Voice$ + "Voice_Main_Message_20230607.mp3"
5830 endif
5840 '************************************************************************************************
5850 '2.WXGA以外の場合（WUXGAの場合）　ここまで (1920 x 1280)
5860 '************************************************************************************************
5870 endif
5880 '************************************************************************************************
5890 '2.WXGA以外の場合（WUXGAの場合）　ここまで (1920 x 1280)
5900 '************************************************************************************************
5910 endif
5920 Main_Screen_Select:
5930 y = 0:key$ = "":bg = 0:bg2=0
5940 while ((key$ <> chr$(31)) and (key$ <> chr$(13)) and (key$ <> chr$(30)) and (y <> 1) and (y <> -1) and (bg <> 2) and (bg2 <> 2))
5950 y = stick(1)
5960 '"May (2023)"
5970 key$ = inkey$
5980 bg = strig(1)
5990 bg2 = strig(0)
6000 pause 200
6010 wend
6020 '*******************************************************************************************************************************
6030 '  WUXGA(1920 x 1200)
6040 '  X=5:Y=300
6050 '  WXGA (1280 x 800)
6060 '  X=5:Y=200
6070 '*******************************************************************************************************************************
6080 '1.
6090 'ジョイパッドのソース ソート　ここから
6100 'カーソル　下 or 十字キー下
6110 '************************************************************************************************
6120 '1.WXGAの場合　ここから (1280 x 800)
6130 '************************************************************************************************
6140 if ((size(0) <= 1280) and (size(1) <= 800)) then
6150 '************************************************************************************************
6160 '1.WXGAの場合　ここから (1280 x 800)
6170 '************************************************************************************************
6180 if ((y = 1) or (key$ = chr$(31))) then
6190 select case No
6200 case 0:
6210 '1
6220 No = 1:sp_on 0,0:sp_on 1,1:sp_on 2,0:sp_on 3,0:sp_put 1,(X,Y+120),0,0:count = count + 1:beep:pause 200:gosub TopScreenRecheck:locate 1,19:print "                          ":locate 1,19:color rgb(0,0,0):print "2.設 定を選択":count=cunt+1:goto Main_Screen_Select:
6230 case 1:
6240 '2
6250 No = 2:sp_on 1,0:sp_on 2,1:sp_on 3,0:sp_put 2,(X,Y+220),0,0:beep:count = count + 1:pause 200:gosub TopScreenRecheck:locate 1,19:print "                                 ":locate 1,19:color rgb(0,0,0):print "3.ヘルプを選択":count=count+1:goto Main_Screen_Select:
6260 case 2:
6270 '3
6280 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(X,Y+320),0,0:beep:count = count + 1:pause 200:gosub TopScreenRecheck:locate 1,19:print "                            ":locate 1,19:color rgb(0,0,0):print "4.(プログラムを)終了するを選択":count=count+1:goto Main_Screen_Select:
6290 case 3:
6300 '0
6310 No=0:sp_on 0,1:sp_on 3,0:sp_on 1,0:sp_on 2,0:sp_put 0,(X,Y+20),0,0:beep:pause 200:count = count + 1:gosub TopScreenRecheck:locate 1,19:print "                              ":locate 1,19:color rgb(0,0,0):print "1.数秘術占いを選択":count=count+1:goto Main_Screen_Select:
6320 end select
6330 endif
6340 '2.
6350 'カーソル　上　or 十字キー  上
6360 if ((y = -1) or (key$ = chr$(30))) then
6370 select case No
6380 case 0:
6390 '3
6400 No=3:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,1:sp_put 3,(X,Y+320),0,0:beep:count = count + 1:pause 200:gosub TopScreenRecheck:locate 1,19:print "                              ":locate 1,19:COLOR rgb(0,0,0):print "4.(プログラムを)終了するを選択":goto Main_Screen_Select:
6410 case 1:
6420 '0
6430 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(X,Y+20),0,0:beep:count = count + 1:pause 200:gosub TopScreenRecheck:locate 1,19:print "                            ":locate 1,19:COLOR rgb(0,0,0):print  "1.数秘術占いを選択":goto Main_Screen_Select:
6440 case 2:
6450 '1
6460 No=1:sp_on 0,0:sp_on 1,1:sp_on 2,0:sp_on 3,0:sp_put 1,(X,Y+120),0,0:beep:count = count + 1:pause 200:gosub TopScreenRecheck:locate 1,19:print "                          ":locate 1,19:color rgb(0,0,0):print "2.設 定を選択":goto Main_Screen_Select:
6470 case 3:
6480 '2
6490 No=2:sp_on 0,0:sp_on 1,0:sp_on 2,1:sp_on 3,0:sp_put 2,(X,Y+220),0,0:beep:count = count + 1:pause 200:gosub TopScreenRecheck:locate 1,19:print "                   ":locate 1,19:color rgb(0,0,0):print "3.ヘルプを選択":goto Main_Screen_Select:
6500 end select
6510 endif
6520 'ジョイパッド　ソース 部分　ここまで
6530 'ジョイパッド右　　or Enter key 決定
6540 if ((bg = 2) OR (key$ = chr$(13))) then
6550 select case No
6560 case 0:
6570 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:count=0:goto Kabara_TopScreen: 'Kabara_First_Top:
6580 case 1:
6590 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:count=0:goto Setting:
6600 case 2:
6610 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:count=0:goto Help:
6620 case 3:
6630 play "":pause 200
6640 play Voice$ + "Voice_Finish_Program_20230607.mp3":ui_msg "プログラムを終了します":Gosub Data_erase:pause 200:color rgb(255,255,255):cls 3:cls 4:font 16:end
6650 end select
6660 endif
6670 if (bg2 = 2) then
6680 play "":pause 200
6690 play Voice$ + "Voice_Main_Message_20230607.mp3"
6700 goto Main_Screen_Select:
6710 endif
6720 '************************************************************************************************
6730 '1.WXGAの場合　ここまで (1280 x 800)
6740 '************************************************************************************************
6750 else
6760 '************************************************************************************************
6770 '2.WXGA以外の場合（WUXGAの場合）　ここから (1920 x 1280)
6780 '************************************************************************************************
6790 if ((y = 1) or (key$ = chr$(31))) then
6800 select case No
6810 case 0:
6820 '1
6830 No = 1:sp_on 0,0:sp_on 1,1:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.設 定を選択":goto Main_Screen_Select:
6840 case 1:
6850 '2
6860 No = 2:sp_on 1,0:sp_on 2,1:sp_on 3,0:sp_put 2,(5,500),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "3.ヘルプを選択":goto Main_Screen_Select:
6870 case 2:
6880 '3
6890 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "4.(プログラムを)終了するを選択":goto Main_Screen_Select:
6900 case 3:
6910 '0
6920 No=0:sp_on 0,1:sp_on 3,0:sp_on 1,0:sp_on 2,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                                ":locate 1,15:print "1.数秘術占いを選択":goto Main_Screen_Select:
6930 end select
6940 endif
6950 '2.
6960 'カーソル　上　or 十字キー  上
6970 '************************************************************************************************
6980 '2.WXGA以外の場合（WUXGAの場合）　ここから (1920 x 1280)
6990 'カーソル　上　or 十字キー  上
7000 '************************************************************************************************
7010 if ((y = -1) or (key$ = chr$(30))) then
7020 select case No
7030 case 0:
7040 '3
7050 No=3:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,1:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                                          ":locate 1,15:print "4.(プログラムを)終了するを選択":goto Main_Screen_Select:
7060 case 1:
7070 '0
7080 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                                          ":locate 1,15:print  "1.数秘術占いを選択":goto Main_Screen_Select:
7090 case 2:
7100 '1
7110 No=1:sp_on 0,0:sp_on 1,1:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),0,0:beep:pause 200:locate 1,15:print "                                                                                ":locate 1,15:print "2.設 定を選択":goto Main_Screen_Select:
7120 case 3:
7130 '2
7140 No=2:sp_on 0,0:sp_on 1,0:sp_on 2,1:sp_on 3,0:sp_put 2,(5,500),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "3.ヘルプを選択":goto Main_Screen_Select:
7150 end select
7160 endif
7170 'ジョイパッド　ソース 部分　ここまで
7180 'ジョイパッド右　　or Enter key 決定
7190 if ((bg = 2) OR (key$ = chr$(13))) then
7200 select case No
7210 case 0:
7220 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:count=0:goto Kabara_TopScreen:  'Kabara_First_Top:
7230 case 1:
7240 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:count=0:goto Setting:
7250 case 2:
7260 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:count=0:goto Help:
7270 case 3:
7280 play "":pause 200
7290 play Voice$ + "Voice_Finish_Program_20230607.mp3":ui_msg "プログラムを終了します":Gosub Data_erase:pause 200:color rgb(255,255,255):cls 3:cls 4:end
7300 end select
7310 endif
7320 if (bg2 = 2) then
7330 play "":pause 200
7340 play Voice$ + "Voice_Main_Message_20230607.mp3"
7350 goto Main_Screen_Select:
7360 endif
7370 '************************************************************************************************
7380 '2.WXGA以外の場合（WUXGAの場合）　ここまで (1920 x 1280)
7390 '************************************************************************************************
7400 endif
7410 'Version
7420 Version:
7430 cls 3:PLAY ""
7440 if ((size(0) <= 1280) and (size(1) <= 800)) then
7450 '************************************************************************************************
7460 '1.WXGA ここから (1280 x 800)
7470 '************************************************************************************************
7480 gload Gazo$   + Gazo_WXGA$ + "VersionScreen_918x680_20240219.png",0,0,0
7490 '************************************************************************************************
7500 '1.WXGA ここまで (1280 x 800)
7510 '************************************************************************************************
7520 else
7530 '************************************************************************************************
7540 '2.WXGA以外の場合（WUXGAの場合）　ここから (1920 x 1280)
7550 '************************************************************************************************
7560 gload Gazo$  + "VersionScreen_20230601.png",0,0,0
7570 gload Gazo$ + "downscreen.png",0,0,800
7580 '************************************************************************************************
7590 '2.WXGA以外の場合（WUXGAの場合）　ここまで (1920 x 1280)
7600 '************************************************************************************************
7610 endif
7620 init"kb:4":font FONT
7630 'talk"バージョン情報です"
7640 'Message :Version
7650 play Voice$ +  "Voice_Version_Message_20230607.mp3"
7660 if ((size(0) <= 1280) and (size(1) <= 800)) then
7670 color rgb(0,0,255)
7680 locate 1,5
7690 print "・Title:数秘術占い";chr$(13)
7700 locate 1,8
7710 print "・" + Version$ + chr$(13)
7720 locate 1,10
7730 print "・Author:licksjp"+chr$(13)
7740 locate 1,13
7750 print "・E-mail:licksjp@gmail.com" + chr$(13)
7760 locate 0,15
7770 print "(C)licksjp All rights " + chr$(13)
7780 locate 7,16
7790 print "reserved since 2009"+chr$(13)
7800 locate 0,19
7810 color rgb(255,255,255)
7820 print "ジョイパッドの右を押してください"
7830 else
7840 locate 0,3
7850 color rgb(0,0,255)
7860 print "・Title:数秘術占い";chr$(13)
7870 print "・" + Version$ + chr$(13)
7880 print "・Author:licksjp"+chr$(13)
7890 print "・E-mail:licksjp@gmail.com" + chr$(13)
7900 locate 0,12
7910 print "(C)licksjp All rights " + chr$(13)
7920 locate 7,13
7930 print "reserved since 2009"+chr$(13)
7940 locate 0,18
7950 color rgb(255,255,255)
7960 print "ジョイパッドの右を押してください"
7970 endif
7980 Versionn_Selection:
7990 bg = 0:key$ = "":bg2 = 0
8000 while ((bg <> 2) and (key$ <> chr$(13)) and (bg2 <> 2))
8010 bg = strig(1)
8020 key$ = inkey$
8030 bg2 = strig(0)
8040 pause 200
8050 wend
8060 if ((bg = 2) or (key$ = chr$(13))) then
8070 cls 4:goto Main_Screen:
8080 endif
8090 if (bg2=2) then
8100 play "":pause 200
8110 play Voice$ + "Voice_Version_Message_20230607.mp3"
8120 goto Versionn_Selection:
8130 endif
8140 '1.数秘ナンバーを求める
8150 '誕生日入力(生れた年代)
8160 Input_Seireki:
8170 '************************************************************************************************
8180 '1.WXGAの時1200x800の時
8190 '************************************************************************************************
8200 '************************************************************************************************
8210 '2.WUXGAの時1920x1200の時
8220 '************************************************************************************************
8230 cls 3:play "":count=0:count2=0
8240 'No = -1:Okのとき
8250 init"kb:4":key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_year$ = "****"
8260 '************************************************************************************************
8270 '配列buf_year(4)を0で埋める。:データー初期化 ここから
8280 '************************************************************************************************
8290 for i=0 to 3
8300 buf_year(i)=0
8310 next i
8320 '************************************************************************************************
8330 '配列buf_year(4)を0で埋める。 :データー初期化　ここまで
8340 '************************************************************************************************
8350 '************************************************************************************************
8360 '1.WXGAの時1200x800の時
8370 '************************************************************************************************
8380 if ((size(0) <= 1280) and (size(1) <= 800)) then
8390 gload Gazo$ + Gazo_WXGA$ + "Screen2_907x680_20240216.png",0,0,0
8400 else
8410 '************************************************************************************************
8420 '2.WUXGAの時1920x1200の時
8430 '************************************************************************************************
8440 gload Gazo$ + "Screen2.png",0,0,0
8450 gload Gazo$ + "downscreen.png",0,0,800
8460 '************************************************************************************************
8470 '2.WUXGAの時1920x1200の時
8480 '************************************************************************************************
8490 endif
8500 'Init"kb:2"
8510 '音声ファイル再生 2023.06.07
8520 play Voice$ + "Voice_Input_Born_Year_20230607.mp3"
8530 font FONT
8540 locate 0,1
8550 if ex_info$(1) <> "JP" then
8560 color rgb(255,255,255)
8570 color rgb(255,255,255)
8580 print "Input Born Year?" + chr$(13)
8590 color rgb(255,255,255)
8600 locate 2,4
8610 print "Your Born Year(4 dedgit for AC):" + buf_year$
8620 else
8630 '文字色：黒　 color rgb(0,0,0)
8640 color rgb(255,255,255)
8650 print "生まれた年代を入れて下さい" + chr$(13)
8660 color rgb(255,255,255)
8670 locate 2,4
8680 print "生まれた年代(西暦4桁):" + buf_year$
8690 endif
8700 '=============================
8710 'テンキーの色(1~９)　白 ,決定ボタン　青
8720 '=============================
8730 color rgb(255,255,255)
8740 sp_on 4,0: sp_on 5,0:sp_on 6,0
8750 sp_on 7,0:sp_on 8,0:sp_on 9,0
8760 sp_on 10,0:sp_on 11,0:sp_on 12,0
8770 sp_on 13,0:sp_on 14,1
8780 Input_Seireki2:
8790 key$="":bg=0:y=0:y2=0:bg2=0:
8800 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
8810 key$ = inkey$
8820 bg = strig(1)
8830 y = stick(1)
8840 y2 = stick(0)
8850 bg2 = strig(0)
8860 pause 200
8870 wend
8880 if ((size(0) <= 1280) and (size(1) <= 800)) then
8890 '*************************************************************************************************************************
8900 'WXGA　1280 x 800 ここから
8910 '*************************************************************************************************************************
8920 '十字キー　ここから
8930 '上の矢印　または、十字キー上
8940 if ((y = -1) or (key$ = chr$(30))) then
8950 select case No
8960 'No=-1:okのとき:初期の状態
8970 '0kボタンから３に移動
8980 '上に行く 処理
8990 case -1:
9000 No=3:sp_on 6,1:sp_on 14,0:beep
9010 pause 200:goto Input_Seireki2:
9020 '選択肢:3
9030 '3ボタンから 6に移動
9040 case 3:
9050 No=6:sp_on 9,1:sp_on 6,0:beep
9060 pause 200:goto Input_Seireki2:
9070 '6ボタンから ９に移動
9080 case 6:
9090 No=9:sp_on 12,1:sp_on 9,0:beep
9100 pause 200:goto Input_Seireki2:
9110 '6ボタンから ９に移動　ここまで
9120 '9で上を押して何もしない
9130 case 9:
9140 '何もしない
9150 No=9
9160 beep:pause 200:goto Input_Seireki2:
9170 '9で上を押しても何もしない　ここまで
9180 '上　 0ボタンから2ボタン
9190 'sp_on 6,1:1
9200 'sp_on 8,1:5
9210 'sp_on 7,1:7
9220 case 0:
9230 No=2:sp_on 13,0:sp_on 5,1:beep
9240 pause 200:goto Input_Seireki2:
9250 '上  0ボタンから2ボタン　ここまで
9260 '2から５になる 上
9270 case 2:
9280 No=5:sp_on 8,1:sp_on 5,0:beep
9290 pause 200:goto Input_Seireki2:
9300 case 5:
9310 No=8:sp_on 11,1:sp_on 8,0:beep
9320 pause 200:goto Input_Seireki2:
9330 case 8:
9340 beep:pause 200:goto Input_Seireki2:
9350 case 1:
9360 No=4:sp_on 7,1:sp_on 4,0:beep
9370 pause 200:goto Input_Seireki2:
9380 case 4:
9390 No=7:sp_on 10,1:sp_on 7,0:beep
9400 pause 200:goto Input_Seireki2:
9410 case 7:
9420 beep:pause 200:goto Input_Seireki2:
9430 end select
9440 endif
9450 '左３　ここまで
9460 '下の矢印
9470 '中央 2
9480 if ((y=1) or (key$ = chr$(31))) then
9490 select case No
9500 '9から６に下げる
9510 case 9:
9520 No=6:sp_on 12,0:sp_on 9,1:beep
9530 pause 200:goto Input_Seireki2:
9540 '6から３に下げる
9550 case 6:
9560 No=3:sp_on 9,0:sp_on 6,1:beep
9570 pause 200:goto Input_Seireki2:
9580 '3から０ｋに変える
9590 case 3:
9600 No=-1:sp_on 14,1:sp_on 6,0:beep
9610 pause 200:goto Input_Seireki2:
9620 'Okから下のボタンを押しても何もしない
9630 case -1:
9640 beep:pause 200:goto Input_Seireki2:
9650 case 8:
9660 No=5:sp_on 8,1:sp_on 11,0:beep
9670 pause 200:goto Input_Seireki2:
9680 case 5:
9690 No=2:sp_on 5,1:sp_on 8,0:beep
9700 pause 200:goto Input_Seireki2:
9710 case 2:
9720 No=0:sp_on 13,1:sp_on 5,0:beep
9730 pause 200:goto Input_Seireki2:
9740 case 0:
9750 beep:pause 200:goto Input_Seireki2:
9760 case 7:
9770 No=4:sp_on 7,1:sp_on 10,0:beep
9780 pause 200:goto Input_Seireki2:
9790 case 4:
9800 No=1:sp_on 4,1:sp_on 7,0:beep
9810 pause 200:goto Input_Seireki2:
9820 case 1:
9830 beep:pause 200:goto Input_Seireki2:
9840 end select
9850 endif
9860 '左へボタン 十字キー　左　or 　カーソル左
9870 if ((y2 = -1) or (key$ = chr$(29))) then
9880 select case No
9890 'Ok ボタン  Okから　左　０に行く
9900 case -1:
9910 No=0:sp_on 13,1:sp_on 14,0:beep
9920 pause 200:goto Input_Seireki2:
9930 '0 ボタン  左　何もしない
9940 case 0:
9950 beep:pause 200:goto Input_Seireki2:
9960 case 3:
9970 No=2:sp_on 5,1:sp_on 6,0:beep
9980 pause 200:goto Input_Seireki2:
9990 case 2:
10000 No=1:sp_on 5,0:sp_on 4,1:beep
10010 pause 200:goto Input_Seireki2:
10020 case 1:
10030 beep:pause 200:goto Input_Seireki2:
10040 case 6:
10050 No=5:sp_on 8,1:sp_on 9,0:beep
10060 pause 200:goto Input_Seireki2:
10070 case 5:
10080 No=4:sp_on 7,1:sp_on 8,0:beep
10090 pause 200:goto Input_Seireki2:
10100 case 4:
10110 beep:pause 200:goto Input_Seireki2:
10120 case 9:
10130 No=8:sp_on 11,1:sp_on 12,0:beep
10140 pause 200:goto Input_Seireki2:
10150 case 8:
10160 No=7:sp_on 10,1:sp_on 11,0:beep
10170 pause 200:goto Input_Seireki2:
10180 case 7:
10190 beep:pause 200:goto Input_Seireki2:
10200 end select
10210 endif
10220 '右  十字キー　右　or カーソル　右
10230 if ((y2 = 1) or (key$ = chr$(28))) then
10240 select case No
10250 '0ボタンからokボタン右に移動
10260 case 0:
10270 No=-1:sp_on 14,1:sp_on 13,0:beep
10280 pause 200:goto Input_Seireki2:
10290 '0ボタンからokボタン 右に移動　ここまで
10300 'OKボタンで右を押して何もしない
10310 case -1:
10320 pause 200:goto Input_Seireki2:
10330 case 1:
10340 No=2:sp_on 5,1:sp_on 4,0:beep
10350 pause 200:goto Input_Seireki2:
10360 case 2:
10370 No=3:sp_on 6,1:sp_on 5,0
10380 beep:pause 200:goto Input_Seireki2:
10390 case 3:
10400 beep:pause 200:goto Input_Seireki2:
10410 case 4:
10420 No=5:sp_on 8,1:sp_on 7,0:beep
10430 pause 200:goto Input_Seireki2:
10440 case 5:
10450 No=6:sp_on 9,1:sp_on 8,0:beep
10460 pause 200:goto Input_Seireki2:
10470 case 7:
10480 No=8:sp_on 11,1:sp_on 10,0:beep
10490 pause 200:goto Input_Seireki2:
10500 case 8:
10510 No=9:sp_on 12,1:sp_on 11,0:beep
10520 pause 200:goto Input_Seireki2:
10530 case 9:
10540 beep:pause 200:goto Input_Seireki2:
10550 case 6:
10560 beep:pause 200:goto Input_Seireki2:
10570 end select
10580 'Okから右ボタンを押して何もしない ここまで
10590 endif
10600 '十字キー　ここまで
10610 '*************************************************************************************************************************
10620 'WXGA　1280 x 800 ここまで
10630 '*************************************************************************************************************************
10640 else
10650 '************************************************************************************************
10660 '2.WUXGAの時1920x1280の時 ここから
10670 '************************************************************************************************
10680 '************************************************************************************************
10690 '1.十字キー上ここから
10700 '************************************************************************************************
10710 if ((y = -1) or (key$ = chr$(30))) then
10720 select case No
10730 'No=-1:okのとき:初期の状態
10740 '0kボタンから３に移動
10750 '上に行く 処理
10760 case -1:
10770 No=3:sp_on 12,1:sp_on 14,0:beep
10780 pause 200:goto Input_Seireki2:
10790 '選択肢:3
10800 '3ボタンから 6に移動
10810 case 3:
10820 No=6:sp_on 12,0:sp_on 11,1:beep
10830 pause 200:goto Input_Seireki2:
10840 '6ボタンから ９に移動
10850 case 6:
10860 No=9:sp_on 10,1:sp_on 11,0:beep
10870 pause 200:goto Input_Seireki2:
10880 '6ボタンから ９に移動　ここまで
10890 '9で上を押して何もしない
10900 case 9:
10910 '何もしない
10920 No=9
10930 beep:pause 200:goto Input_Seireki2:
10940 '9で上を押しても何もしない　ここまで
10950 '上　 0ボタンから2ボタン
10960 'sp_on 6,1:1
10970 'sp_on 8,1:5
10980 'sp_on 7,1:7
10990 case 0:
11000 No=2:sp_on 13,0:sp_on 9,1:beep
11010 pause 200:goto Input_Seireki2:
11020 '上  0ボタンから2ボタン　ここまで
11030 '2から５になる 上
11040 case 2:
11050 No=5:sp_on 8,1:sp_on 9,0:beep
11060 pause 200:goto Input_Seireki2:
11070 case 5:
11080 No=8:sp_on 7,1:sp_on 8,0:beep
11090 pause 200:goto Input_Seireki2:
11100 case 8:
11110 beep:pause 200:goto Input_Seireki2:
11120 case 1:
11130 No=4:sp_on 5,1:sp_on 6,0:beep
11140 pause 200:goto Input_Seireki2:
11150 case 4:
11160 No=7:sp_on 4,1:sp_on 5,0:beep
11170 pause 200:goto Input_Seireki2:
11180 case 7:
11190 beep:pause 200:goto Input_Seireki2:
11200 end select
11210 endif
11220 '************************************************************************************************
11230 '1. 十字キー　上　ここまで
11240 '************************************************************************************************
11250 '左３　ここまで
11260 '************************************************************************************************
11270 '1. 十字キー　下　矢印　下　ここから
11280 '************************************************************************************************
11290 '下の矢印
11300 '中央 2
11310 if ((y=1) or (key$ = chr$(31))) then
11320 select case No
11330 '9から６に下げる
11340 case 9:
11350 No=6:sp_on 11,1:sp_on 10,0:beep
11360 pause 200:goto Input_Seireki2:
11370 '6から３に下げる
11380 case 6:
11390 No=3:sp_on 12,1:sp_on 11,0:beep
11400 pause 200:goto Input_Seireki2:
11410 '3から０ｋに変える
11420 case 3:
11430 No=-1:sp_on 14,1:sp_on 12,0:beep
11440 pause 200:goto Input_Seireki2:
11450 'Okから下のボタンを押しても何もしない
11460 case -1:
11470 beep:pause 200:goto Input_Seireki2:
11480 case 8:
11490 No=5:sp_on 8,1:sp_on 7,0:beep
11500 pause 200:goto Input_Seireki2:
11510 case 5:
11520 No=2:sp_on 9,1:sp_on 8,0:beep
11530 pause 200:goto Input_Seireki2:
11540 case 2:
11550 No=0:sp_on 13,1:sp_on 9,0:beep
11560 pause 200:goto Input_Seireki2:
11570 case 0:
11580 pause 200:goto Input_Seireki2:
11590 case 7:
11600 No=4:sp_on 5,1:sp_on 4,0:beep
11610 pause 200:goto Input_Seireki2:
11620 case 4:
11630 No=1:sp_on 6,1:sp_on 5,0:beep
11640 pause 200:goto Input_Seireki2:
11650 case 1:
11660 beep:pause 200:goto Input_Seireki2:
11670 end select
11680 endif
11690 '************************************************************************************************
11700 '1. 十字キー　下　矢印　下　ここまで
11710 '************************************************************************************************
11720 '************************************************************************************************
11730 '1. 十字キー　左　矢印　左　ここから
11740 '************************************************************************************************
11750 '左へボタン 十字キー　左　or 　カーソル左
11760 if ((y2 = -1) or (key$ = chr$(29))) then
11770 select case No
11780 'Ok ボタン  Okから　左　０に行く
11790 case -1:
11800 No=0:sp_on 13,1:sp_on 14,0:beep
11810 pause 200:goto Input_Seireki2:
11820 '0 ボタン  左　何もしない
11830 case 0:
11840 beep:pause 200:goto Input_Seireki2:
11850 case 3:
11860 No=2:sp_on 9,1:sp_on 12,0:beep
11870 pause 200:goto Input_Seireki2:
11880 case 2:
11890 No=1:sp_on 6,1:sp_on 9,0:beep
11900 pause 200:goto Input_Seireki2:
11910 case 1:
11920 beep:pause 200:goto Input_Seireki2:
11930 case 6:
11940 No=5:sp_on 8,1:sp_on 11,0:beep
11950 pause 200:goto Input_Seireki2:
11960 case 5:
11970 No=4:sp_on 5,1:sp_on 8,0:beep
11980 pause 200:goto Input_Seireki2:
11990 case 4:
12000 beep:pause 200:goto Input_Seireki2:
12010 case 9:
12020 No=8:sp_on 7,1:sp_on 10,0:beep
12030 pause 200:goto Input_Seireki2:
12040 case 8:
12050 No=7:sp_on 4,1:sp_on 7,0:beep
12060 pause 200:goto Input_Seireki2:
12070 case 7:
12080 beep:pause 200:goto Input_Seireki2:
12090 end select
12100 endif
12110 '************************************************************************************************
12120 '1. 十字キー　左　矢印　左　ここまで
12130 '************************************************************************************************
12140 '************************************************************************************************
12150 '十字キー　右　ここから
12160 '***********************************************************************************************
12170 '右  十字キー　右　or カーソル　右
12180 if ((y2 = 1) or (key$ = chr$(28))) then
12190 select case No
12200 '0ボタンからokボタン右に移動
12210 case 0:
12220 No=-1:sp_on 14,1:sp_on 13,0:beep
12230 pause 200:goto Input_Seireki2:
12240 '0ボタンからokボタン 右に移動　ここまで
12250 'OKボタンで右を押して何もしない
12260 case -1:
12270 beep:pause 200:goto Input_Seireki2:
12280 case 1:
12290 No=2:sp_on 9,1:sp_on 6,0:beep
12300 pause 200:goto Input_Seireki2:
12310 case 2:
12320 No=3:sp_on 12,1:sp_on 9,0:beep
12330 pause 200:goto Input_Seireki2:
12340 case 3:
12350 beep:pause 200:goto Input_Seireki2:
12360 case 4:
12370 No=5:sp_on 8,1:sp_on 5,0:beep
12380 pause 200:goto Input_Seireki2:
12390 case 5:
12400 No=6:sp_on 11,1:sp_on 8,0:beep
12410 pause 200:goto Input_Seireki2:
12420 case 7:
12430 No=8:sp_on 7,1:sp_on 4,0:beep
12440 pause 200:goto Input_Seireki2:
12450 case 8:
12460 No=9:sp_on 10,1:sp_on 7,0:beep
12470 pause 200:goto Input_Seireki2:
12480 case 9:
12490 beep:pause 200:goto Input_Seireki2:
12500 case 6:
12510 beep:pause 200:goto Input_Seireki2:
12520 end select
12530 'Okから右ボタンを押して何もしない ここまで
12540 endif
12550 '**********************************************************************************************************
12560 '右　ここまで
12570 '**********************************************************************************************************
12580 endif
12590 '**********************************************************************************************************
12600 '2.WUXGAの時1920x1280の時 ここまで
12610 '**********************************************************************************************************
12620 if ((bg=2) or (key$=chr$(13))) then
12630 select case count
12640 case 0:
12650 count=1
12660 if (No=-1) then
12670 count=0
12680 'Okボタンを押したとき
12690 goto Input_Seireki2:
12700 else
12710 '===================================
12720 'Okボタン以外が押されたとき  1桁目の入力
12730 '===================================
12740 count2=1
12750 if (No >= 1 and No <= 2) then
12760 buf_year$="":buf_year$ = str$(No)
12770 buf_year=No:buf_year2$ = buf_year$ + string$(3,"*") :'"***"
12780 if ex_info$(1) <> "JP" then
12790 n1= len("Input Born Year?(4 dedgit):")
12800 else
12810 n1 = len("生まれた年代(西暦4桁):")
12820 endif
12830 locate 2,4
12840 color rgb(255,255,255)
12850 if ex_info$(1) <> "JP" then
12860 buf_Born_Year_line$ = trim$("Input Born Year?(4 dedgit):" + buf_year2$)
12870 else
12880 buf_Born_Year_line$ = trim$("生まれた年代(西暦4桁):" + buf_year2$)
12890 endif
12900 'buf_Born_Year_line$ = left$(buf_Born_year_5490 'buf_Born_Year_line$ = left$(buf_Born_year_name$,1)
12910 'print "生まれた年代(西暦4桁):";buf_year2$
12920 print buf_Born_Year_line$
12930 goto Input_Seireki2:
12940 else
12950 count=0
12960 ui_msg"数字が範囲外になります。"
12970 buf_year$="":buf_year=0
12980 goto Input_Seireki2:
12990 endif
13000 endif
13010 case 1:
13020 count = 2
13030 if (No = -1) then
13040 count = 1
13050 goto Input_Seireki2:
13060 else
13070 count2 = 1
13080 b = val(buf_year$)
13090 buf_year = b * 10 + No
13100 buf_year$ = str$(buf_year):buf_year2$ = buf_year$ + string$(2,"**")
13110 locate 2,4
13120 color rgb(255,255,255)
13130 print "                                                                "
13140 locate 2,4
13150 if ex_info$(1) <> "JP" then
13160 print "Input Born Year(4 dedgit):";buf_year$
13170 else
13180 print "生まれた年代(西暦4桁):";buf_year2$
13190 endif
13200 'if (No = -1) then
13210 'count=1
13220 goto Input_Seireki2:
13230 endif
13240 case 2:
13250 count=3
13260 if (No=-1) then
13270 count =2
13280 goto Input_Seireki2:
13290 else
13300 b = val(buf_year$)
13310 buf_year = b*10 + No
13320 buf_year$ = str$(buf_year):buf_year2$ = buf_year$ + string$(1,"*")
13330 locate 2,4
13340 color rgb(255,255,255)
13350 print "                                        "
13360 locate 2,4
13370 if ex_info$(1) <> "JP" then
13380 print "Input Born Year?(4 dedgit):";buf_year$
13390 else
13400 print "生まれた年代(西暦4桁):";buf_year2$
13410 endif
13420 goto Input_Seireki2:
13430 endif
13440 case 3:
13450 count=4
13460 if (No = -1) then
13470 count=3
13480 goto Input_Seireki2:
13490 else
13500 b = val(buf_year$)
13510 buf_year = b * 10 + No
13520 buf_year$ = str$(buf_year)
13530 locate 2,4
13540 color RGB(255,255,255)
13550 print "                                      "
13560 locate 2,4
13570 if ex_info$(1) <> "JP" then
13580 print "Input Born Year?(4 dedgit):";buf_year$
13590 else
13600 print "生まれた年代(西暦4桁):";buf_year$
13610 endif
13620 buf_year=val(buf_year$)
13630 'year=val(buf_year$)
13640 'if (No=-1) then
13650 'goto Input_Born_Month:
13660 'else
13670 goto Input_Seireki2:
13680 endif
13690 case 4:
13700 'bufyear=buf_year
13710 if (No = -1) then
13720 buf_year = val(buf_year$)
13730 bufyear = buf_year
13740 sp_on 14,0
13750 goto Input_Born_Month:
13760 else
13770 goto Input_Seireki2:
13780 endif
13790 end select
13800 endif
13810 '=========================
13820 'bg2　キャンセルボタン
13830 '=========================
13840 if (bg2 = 2) then
13850 select case count2
13860 case 0:
13870 'Okボタンを押したときの処理
13880 if (No = -1) then
13890 buf_year=0:buf_year$=(""):buf_year$=trim$("****")
13900 'count = 0
13910 locate 2,4
13920 color rgb(255,255,255)
13930 print "                                      "
13940 locate 2,4
13950 if ex_info$(1) <> "JP" then
13960 print "Input Born Year?(4 dedgit):";buf_year$
13970 else
13980 print "生まれた年代（西暦4桁):";buf_year$
13990 endif
14000 '=============================
14010 'case 0:前の画面に戻る 数秘術トップメニュー
14020 '=============================
14030 sp_on 14,0:goto Kabara_TopScreen:
14040 else
14050 'count=0
14060 '(buf_year=0) then
14070 buf_year = 0:buf_year$ = string$(4,"*")
14080 goto Input_Seireki2:
14090 'endif
14100 endif
14110 case 1:
14120 if (No = -1) then
14130 count2 = 0:count = 0
14140 buf$=right$(buf_year$,1)
14150 if (val(buf$) >= 1 and val(buf$) <= 9) then
14160 buf_year$ = "****":buf_year=0
14170 color rgb(255,255,255)
14180 locate 0,4:
14190 print "                                      "
14200 locate 2,4
14210 if ex_info$(1) <> "JP" then
14220 print "Input Born Year(4 dedgit):";buf_year$
14230 else
14240 print "生まれた年代（西暦4桁):" + buf_year$
14250 endif
14260 goto Input_Seireki2:
14270 endif
14280 else
14290 endif
14300 end select
14310 endif
14320 end
14330 'Input"生れた年代(4桁,〜2025年):",year
14340 'if year > 2025 then goto Input_Seireki:
14350 'if year = 123 then cls 3:cls 4:goto Main_Screen:
14360 '"4桁目"
14370 'bufyear4 = fix(year / 1000)
14380 '"3桁目"
14390 'bufyear3 = fix((year - (bufyear4 * 1000)) / 100)
14400 '"2桁目"
14410 'bufyear2 = fix((year - ((bufyear4 * 1000)+(bufyear3*100)))/10)
14420 '"1桁目"
14430 'bufyear1 = fix((year - ((bufyear4*
14440 'bufyear = bufyear1+bufyear2+bufyear3+bufyear4
14450 '生れた月を入力
14460 Input_Born_Month:
14470 cls 3:play "":count=0:count2=0
14480 'No=-1:Okのとき
14490 init"kb:4":key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_Month$ = "**":buf_month=0
14500 for i=0 to 1
14510 buf_month(i)=0
14520 next i
14530 '***********************************************************
14540 '1.WXGAの時 ここから
14550 '(1200 x 800)
14560 '***********************************************************
14570 if ((size(0) <= 1280) and (size(1) <= 800)) then
14580 gload Gazo$ + Gazo_WXGA$ +"Screen2_907x680_20240216.png",0,0,0
14590 '***********************************************************
14600 '1.WXGAの時　ここまで
14610 '(1200 x 800)
14620 '***********************************************************
14630 else
14640 '***********************************************************
14650 '2.WUXGAの時(WXGA以外の時)　ここから
14660 '(1920 gload Gazo$ + "Selection.png",1,60,240
14670 '***********************************************************
14680 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
14690 gload Gazo$ + "Screen2.png",0,0,0
14700 gload Gazo$ + "downscreen.png",0,0,800
14710 '***********************************************************
14720 '2.WUXGAの時(WXGA以外の時)　ここまで
14730 '(1920 gload Gazo$ + "Selection.png",1,60,240
14740 '***********************************************************
14750 endif
14760 'Init"kb:2"
14770 if ex_info$(1) <> "JP" then
14780 else
14790 '音声ファイル再生 2023.06.07
14800 play Voice$ + "Voice_Input_Born_Month_20230607.mp3"
14810 endif
14820 font FONT
14830 locate 0,1
14840 '文字色：黒　 color rgb(0,0,0)
14850 if ex_info$(1) <> "JP" then
14860 '英語パート
14870 '文字色:白
14880 color rgb(255,255,255)
14890 print "Input Born Month?(1~12):" + chr$(13)
14900 '文字色:白
14910 color rgb(255,255,255)
14920 locate 2,4
14930 '文字色:白
14940 print "Your Born Month?(1~12):";buf_Month$
14950 color rgb(255,255,255)
14960 else
14970 '日本語パート
14980 color rgb(255,255,255)
14990 print "生まれた月を入れて下さい" + chr$(13)
15000 '文字色:白
15010 color rgb(255,255,255)
15020 locate 2,4
15030 '文字色:白
15040 print "生まれた月(1月~12月):";buf_Month$
15050 color rgb(255,255,255)
15060 endif
15070 'locate 4,6:print ":7"
15080 'locate 9,6:print ":8"
15090 'locate 12,6:print ":9"
15100 'locate 4,6
15110 '文字色:赤
15120 'print ":7  :8  :9" + chr$(13)
15130 'color rgb(255,255,255)
15140 'locate 4,8
15150 'print ":4  :5  :6" + chr$(13)
15160 'color rgb(255,255,255)
15170 'locate 4,10
15180 'print ":1  :2  :3" + chr$(13)
15190 'locate 4,12
15200 'print "    :0"
15210 'locate 12,12
15220 'color rgb(255,0,0)
15230 'print ":Ok"
15240 sp_on 4,0: sp_on 5,0:sp_on 6,0
15250 sp_on 7,0:sp_on 8,0:sp_on 9,0
15260 sp_on 10,0:sp_on 11,0:sp_on 12,0
15270 sp_on 13,0:sp_on 14,1
15280 Input_Born_Month2:
15290 key$="":bg=0:y=0:y2=0:bg2=0
15300 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
15310 key$ = inkey$
15320 bg = strig(1)
15330 y = stick(1)
15340 y2 = stick(0)
15350 bg2 = strig(0)
15360 pause 200
15370 wend
15380 if ((size(0) <= 1280) and (size(1) <= 800)) then
15390 '***********************************************************
15400 '1.WXGAの時 ここから
15410 '(1200 x 800)
15420 '***********************************************************
15430 '十字キー　ここから
15440 '上の矢印　または、十字キー上
15450 if ((y = -1) or (key$ = chr$(30))) then
15460 select case No
15470 'No=-1:okのとき:初期の状態
15480 '0kボタンから３に移動
15490 '上に行く 処理
15500 case -1:
15510 No=3:sp_on 6,1:sp_on 14,0:beep
15520 pause 200:goto Input_Born_Month2:
15530 '選択肢:3
15540 '3ボタンから 6に移動
15550 case 3:
15560 No=6:sp_on 9,1:sp_on 6,0:beep
15570 pause 200:goto Input_Born_Month2:
15580 '6ボタンから ９に移動
15590 case 6:
15600 No=9:sp_on 12,1:sp_on 9,0:beep
15610 pause 200:goto Input_Born_Month2:
15620 '6ボタンから ９に移動　ここまで
15630 '9で上を押して何もしない
15640 case 9:
15650 '何もしない
15660 No=9
15670 beep:pause 200:goto Input_Born_Month2:
15680 '9で上を押しても何もしない　ここまで
15690 '上　 0ボタンから2ボタン
15700 'sp_on 6,1:1
15710 'sp_on 8,1:5
15720 'sp_on 7,1:7
15730 case 0:
15740 No=2:sp_on 13,0:sp_on 5,1:beep
15750 pause 200:goto Input_Born_Month2:
15760 '上  0ボタンから2ボタン　ここまで
15770 '2から５になる 上
15780 case 2:
15790 No=5:sp_on 8,1:sp_on 5,0:beep
15800 pause 200:goto Input_Born_Month2:
15810 case 5:
15820 No=8:sp_on 11,1:sp_on 8,0:beep
15830 pause 200:goto Input_Born_Month2:
15840 case 8:
15850 beep:pause 200:goto Input_Born_Month2:
15860 case 1:
15870 No=4:sp_on 7,1:sp_on 4,0:beep
15880 pause 200:goto Input_Born_Month2:
15890 case 4:
15900 No=7:sp_on 10,1:sp_on 7,0:beep
15910 pause 200:goto Input_Born_Month2:
15920 case 7:
15930 beep:pause 200:goto Input_Born_Month2:
15940 end select
15950 endif
15960 '左３　ここまで
15970 '下の矢印
15980 '中央 2
15990 if ((y=1) or (key$ = chr$(31))) then
16000 select case No
16010 '9から６に下げる
16020 case 9:
16030 No=6:sp_on 12,0:sp_on 9,1:beep
16040 pause 200:goto Input_Born_Month2:
16050 '6から３に下げる
16060 case 6:
16070 No=3:sp_on 9,0:sp_on 6,1:beep
16080 pause 200:goto Input_Born_Month2:
16090 '3から０ｋに変える
16100 case 3:
16110 No=-1:sp_on 14,1:sp_on 6,0:beep
16120 pause 200:goto Input_Born_Month2:
16130 'Okから下のボタンを押しても何もしない
16140 case -1:
16150 beep:pause 200:goto Input_Born_Month2:
16160 case 8:
16170 No=5:sp_on 8,1:sp_on 11,0:beep
16180 pause 200:goto Input_Born_Month2:
16190 case 5:
16200 No=2:sp_on 5,1:sp_on 8,0:beep
16210 pause 200:goto Input_Born_Month2:
16220 case 2:
16230 No=0:sp_on 13,1:sp_on 5,0:beep
16240 pause 200:goto Input_Born_Month2:
16250 case 0:
16260 beep:pause 200:goto Input_Born_Month2:
16270 case 7:
16280 No=4:sp_on 7,1:sp_on 10,0:beep
16290 pause 200:goto Input_Born_Month2:
16300 case 4:
16310 No=1:sp_on 4,1:sp_on 7,0:beep
16320 pause 200:goto Input_Born_Month2:
16330 case 1:
16340 beep:pause 200:goto Input_Born_Month2:
16350 end select
16360 endif
16370 '左へボタン 十字キー　左　or 　カーソル左
16380 if ((y2 = -1) or (key$ = chr$(29))) then
16390 select case No
16400 'Ok ボタン  Okから　左　０に行く
16410 case -1:
16420 No=0:sp_on 13,1:sp_on 14,0:beep
16430 pause 200:goto Input_Born_Month2:
16440 '0 ボタン  左　何もしない
16450 case 0:
16460 beep:pause 200:goto Input_Born_Month2:
16470 case 3:
16480 No=2:sp_on 5,1:sp_on 6,0:beep
16490 pause 200:goto Input_Born_Month2:
16500 case 2:
16510 No=1:sp_on 5,0:sp_on 4,1:beep
16520 pause 200:goto Input_Born_Month2:
16530 case 1:
16540 beep:pause 200:goto Input_Born_Month2:
16550 case 6:
16560 No=5:sp_on 8,1:sp_on 9,0:beep
16570 pause 200:goto Input_Born_Month2:
16580 case 5:
16590 No=4:sp_on 7,1:sp_on 8,0:beep
16600 pause 200:goto Input_Born_Month2:
16610 case 4:
16620 beep:pause 200:goto Input_Born_Month2:
16630 case 9:
16640 No=8:sp_on 11,1:sp_on 12,0:beep
16650 pause 200:goto Input_Born_Month2:
16660 case 8:
16670 No=7:sp_on 10,1:sp_on 11,0:beep
16680 pause 200:goto Input_Born_Month2:
16690 case 7:
16700 beep:pause 200:goto Input_Born_Month2:
16710 end select
16720 endif
16730 '右  十字キー　右　or カーソル　右
16740 if ((y2 = 1) or (key$ = chr$(28))) then
16750 select case No
16760 '0ボタンからokボタン右に移動
16770 case 0:
16780 No=-1:sp_on 14,1:sp_on 13,0:beep
16790 pause 200:goto Input_Born_Month2:
16800 '0ボタンからokボタン 右に移動　ここまで
16810 'OKボタンで右を押して何もしない
16820 case -1:
16830 pause 200:goto Input_Born_Month2:
16840 case 1:
16850 No=2:sp_on 5,1:sp_on 4,0:beep
16860 pause 200:goto Input_Born_Month2:
16870 case 2:
16880 No=3:sp_on 6,1:sp_on 5,0
16890 beep:pause 200:goto Input_Born_Month2:
16900 case 3:
16910 beep:pause 200:goto Input_Born_Month2:
16920 case 4:
16930 No=5:sp_on 8,1:sp_on 7,0:beep
16940 pause 200:goto Input_Born_Month2:
16950 case 5:
16960 No=6:sp_on 9,1:sp_on 8,0:beep
16970 pause 200:goto Input_Born_Month2:
16980 case 7:
16990 No=8:sp_on 11,1:sp_on 10,0:beep
17000 pause 200:goto Input_Born_Month2:
17010 case 8:
17020 No=9:sp_on 12,1:sp_on 11,0:beep
17030 pause 200:goto Input_Born_Month2:
17040 case 9:
17050 beep:pause 200:goto Input_Born_Month2:
17060 case 6:
17070 beep:pause 200:goto Input_Born_Month2:
17080 end select
17090 'Okから右ボタンを押して何もしない ここまで
17100 endif
17110 '***********************************************************
17120 '1.WXGAの時 ここまで
17130 '(1200 x 800)
17140 '***********************************************************
17150 else
17160 '***********************************************************
17170 '2.WUXGAの時(WXGA以外の時)　ここから
17180 '(1920 gload Gazo$ + "Selection.png",1,60,240
17190 '***********************************************************
17200 '十字キー　ここから
17210 '上の矢印　または、十字キー上
17220 if ((y = -1) or (key$ = chr$(30))) then
17230 select case No
17240 'No=-1:okのとき:初期の状態
17250 '0kボタンから３に移動
17260 '上に行く 処理
17270 case -1:
17280 No=3:sp_on 12,1:sp_on 14,0:BEEP
17290 pause 200:goto Input_Born_Month2:
17300 '選択肢:3
17310 '3ボタンから 6に移動
17320 case 3:
17330 No=6:sp_on 12,0:sp_on 11,1:beep
17340 pause 200:goto Input_Born_Month2:
17350 '6ボタンから ９に移動
17360 case 6:
17370 No=9:sp_on 10,1:sp_on 11,0:beep
17380 pause 200:goto Input_Born_Month2:
17390 '6ボタンから ９に移動　ここまで
17400 '9で上を押して何もしない
17410 case 9:
17420 '何もしない
17430 No=9
17440 beep:pause 200:goto Input_Born_Month2:
17450 '9で上を押しても何もしない　ここまで
17460 '上　 0ボタンから2ボタン
17470 'sp_on 6,1:1
17480 'sp_on 8,1:5
17490 'sp_on 7,1:7
17500 case 0:
17510 No=2:sp_on 13,0:sp_on 9,1:beep
17520 pause 200:goto Input_Born_Month2:
17530 '上  0ボタンから2ボタン　ここまで
17540 '2から５になる 上
17550 case 2:
17560 No=5:sp_on 8,1:sp_on 9,0:beep
17570 pause 200:goto Input_Born_Month2:
17580 case 5:
17590 No=8:sp_on 7,1:sp_on 8,0:beep
17600 pause 200:goto Input_Born_Month2:
17610 case 8:
17620 beep:pause 200:goto Input_Born_Month2:
17630 case 1:
17640 No=4:sp_on 5,1:sp_on 6,0:beep
17650 pause 200:goto Input_Born_Month2:
17660 case 4:
17670 No=7:sp_on 4,1:sp_on 5,0:beep
17680 pause 200:goto Input_Born_Month2:
17690 case 7:
17700 beep:pause 200:goto Input_Born_Month2:
17710 end select
17720 endif
17730 '左３　ここまで
17740 '下の矢印
17750 '中央 2
17760 if ((y=1) or (key$ = chr$(31))) then
17770 select case No
17780 '9から６に下げる
17790 case 9:
17800 No=6:sp_on 11,1:sp_on 10,0:beep
17810 pause 200:goto Input_Born_Month2:
17820 '6から３に下げる
17830 case 6:
17840 No=3:sp_on 12,1:sp_on 11,0:beep
17850 pause 200:goto Input_Born_Month2:
17860 '3から０ｋに変える
17870 case 3:
17880 No=-1:sp_on 14,1:sp_on 12,0:beep
17890 pause 200:goto Input_Born_Month2:
17900 'Okから下のボタンを押しても何もしない
17910 case -1:
17920 beep:pause 200:goto Input_Born_Month2:
17930 case 8:
17940 No=5:sp_on 8,1:sp_on 7,0:beep
17950 pause 200:goto Input_Born_Month2:
17960 case 5:
17970 No=2:sp_on 9,1:sp_on 8,0:beep
17980 pause 200:goto Input_Born_Month2:
17990 case 2:
18000 No=0:sp_on 13,1:sp_on 9,0:beep
18010 pause 200:goto Input_Born_Month2:
18020 case 0:
18030 beep:pause 200:goto Input_Born_Month2:
18040 case 7:
18050 No=4:sp_on 5,1:sp_on 4,0:beep
18060 pause 200:goto Input_Born_Month2:
18070 case 4:
18080 No=1:sp_on 6,1:sp_on 5,0:beep
18090 pause 200:goto Input_Born_Month2:
18100 case 1:
18110 beep:pause 200:goto Input_Born_Month2:
18120 end select
18130 endif
18140 '左へボタン 十字キー　左　or 　カーソル左
18150 if ((y2 = -1) or (key$ = chr$(29))) then
18160 select case No
18170 'Ok ボタン  Okから　左　０に行く
18180 case -1:
18190 No=0:sp_on 13,1:sp_on 14,0
18200 beep:pause 200:goto Input_Born_Month2:
18210 '0 ボタン  左　何もしない
18220 case 0:
18230 beep:pause 200:goto Input_Born_Month2:
18240 case 3:
18250 No=2:sp_on 9,1:sp_on 12,0:beep
18260 pause 200:goto Input_Born_Month2:
18270 case 2:
18280 No=1:sp_on 6,1:sp_on 9,0:beep
18290 pause 200:goto Input_Born_Month2:
18300 case 1:
18310 beep:pause 200:goto Input_Born_Month2:
18320 case 6:
18330 No=5:sp_on 8,1:sp_on 11,0:beep
18340 pause 200:goto Input_Born_Month2:
18350 case 5:
18360 No=4:sp_on 5,1:sp_on 8,0:beep
18370 pause 200:goto Input_Born_Month2:
18380 case 4:
18390 beep:pause 200:goto Input_Born_Month2:
18400 case 9:
18410 No=8:sp_on 7,1:sp_on 10,0:beep
18420 pause 200:goto Input_Born_Month2:
18430 case 8:
18440 No=7:sp_on 4,1:sp_on 7,0:beep
18450 pause 200:goto Input_Born_Month2:
18460 case 7:
18470 beep:pause 200:goto Input_Born_Month2:
18480 end select
18490 endif
18500 '右  十字キー　右　or カーソル　右
18510 if ((y2 = 1) or (key$ = chr$(28))) then
18520 select case No
18530 '0ボタンからokボタン右に移動
18540 case 0:
18550 No=-1:sp_on 14,1:sp_on 13,0:beep
18560 pause 200:goto Input_Born_Month2:
18570 '0ボタンからokボタン 右に移動　ここまで
18580 'OKボタンで右を押して何もしない
18590 case -1:
18600 beep:pause 200:goto Input_Born_Month2:
18610 case 1:
18620 No=2:sp_on 9,1:sp_on 6,0:beep
18630 pause 200:goto Input_Born_Month2:
18640 case 2:
18650 No=3:sp_on 12,1:sp_on 9,0:beep
18660 pause 200:goto Input_Born_Month2:
18670 case 3:
18680 beep:pause 200:goto Input_Born_Month2:
18690 case 4:
18700 No=5:sp_on 8,1:sp_on 10,0:beep
18710 pause 200:goto Input_Born_Month2:
18720 case 5:
18730 No=6:sp_on 11,1:sp_on 8,0:beep
18740 pause 200:goto Input_Born_Month2:
18750 case 7:
18760 No=8:sp_on 7,1:sp_on 11,0:beep
18770 pause 200:goto Input_Born_Month2:
18780 case 8:
18790 No=9:sp_on 12,1:sp_on 7,0:beep
18800 pause 200:goto Input_Born_Month2:
18810 case 9:
18820 beep:pause 200:goto Input_Born_Month2:
18830 case 6:
18840 beep:pause 200:goto Input_Born_Month2:
18850 end select
18860 'Okから右ボタンを押して何もしない ここまで
18870 endif
18880 '***********************************************************
18890 '2.WUXGAの時(WXGA以外の時)　ここまで
18900 '(1920 gload Gazo$ + "Selection.png",1,60,240
18910 '***********************************************************
18920 endif
18930 '***********************************************************
18940 '2.WUXGAの時(WXGA以外の時)　ここまで
18950 '(1920 gload Gazo$ + "Selection.png",1,60,240
18960 '***********************************************************
18970 '十字キー　ここまで
18980 '右の丸ボタン　決定キー
18990 if ((bg=2) or (key$=chr$(13))) then
19000 select case count
19010 case 0:
19020 count = 1:buf_Month$ = str$(No):buf_month = No:buf_Month2$ = buf_Month$ + string$(1,"*"):count2=1
19030 if (buf_month = 1 or buf_month = 2) then
19040 locate 2,4
19050 color RGB(255,255,255)
19060 if ex_info$(1) <> "JP" then
19070 print "Input Born Month(1~12):";buf_Month2$
19080 else
19090 print "生まれた月(1月~12月):";buf_Month2$
19100 endif
19110 else
19120 locate 2,4
19130 color Rgb(255,255,255)
19140 if ex_info$(1) <> "JP" then
19150 print "Input Born Month(1~12):";buf_Month$
19160 else
19170 print "生まれた月(1月~12月):";buf_Month$
19180 endif
19190 endif
19200 goto Input_Born_Month2:
19210 case 1:
19220 count = 2:c = No
19230 c = val(buf_Month$)
19240 if (No = -1) then
19250 'if No=1 or No=2 then
19260 'endif
19270 month = buf_month
19280 buf_month=val(buf_Month$)
19290 month=buf_month
19300 '生まれた日に飛ぶ
19310 goto Input_Born_Day:
19320 else
19330 buf_month = c*10 + No
19340 buf_Month$= str$(buf_month)
19350 locate 2,4
19360 color Rgb(255,255,255)
19370 if ex_info$(1) <> "JP" then
19380 print "Input Born Month(1~12):";buf_Month$
19390 else
19400 print "生まれた月(1月~12月):";buf_Month$
19410 endif
19420 goto Input_Born_Month2:
19430 endif
19440 case 2:
19450 count=3:count2=1
19460 'c= val(buf_Month$)
19470 'buf_month = c*10 + No
19480 'buf_Month$ = str$(buf_month)
19490 'locate 2,3
19500 'print "生まれた月(1月～12月):";buf_Month$
19510 'goto Input_Born_Month2:
19520 'case 3:
19530 'count=4
19540 'b=val(buf_month$)
19550 'buf_month=c*10+No
19560 'buf_Month$=str$(buf_month)
19570 'locate 2,3
19580 'print "生まれた月(1月～12月):";buf_Month$
19590 'buf_month=val(buf_Month$)
19600 'year=val(buf_year$)
19610 if (No = -1) then
19620 goto Input_Born_Day:
19630 else
19640 goto Input_Born_Month2:
19650 endif
19660 'case 4:
19670 'bufyear=buf_year
19680 'if (No=-1) then
19690 'buf_month = val(buf_Month$)
19700 'month = buf_month
19710 'sp_on 14,0
19720 'goto Input_Born_Day:
19730 'else
19740 'goto Input_Born_Month2:
19750 'endif
19760 end select
19770 endif
19780 '左の丸ボタン　キャンセル
19790 if (bg2=2) then
19800 select case count2
19810 case 0:
19820 if (No = -1) then
19830 buf_month=0:buf_Month$="**"
19840 count2=0:count=0
19850 locate 0,3:print "                                   "
19860 if ex_info$(1) <> "JP" then
19870 print "Input Born Month?(1~12):";buf_Month$
19880 else
19890 locate 2,3:print "生まれた月(1月~12月):"+buf_Month$
19900 endif
19910 'if (buf_month > 1) then
19920 sp_on 14,0:goto Input_Born_Month2:
19930 'goto rewrite:
19940 else
19950 if ((No>=1 and No<=9) or (No>=10 and No <=12)) then
19960 buf_month=0:buf_Month$="**"
19970 locate 2,3
19980 color rgb(255,255,255)
19990 print "                                       "
20000 goto rewrite:
20010 if (No>2) then
20020 if ex_info$(1) <> "JP" then
20030 ui_msg "The value is out of range"
20040 else
20050 ui_msg "値が範囲外です。"
20060 endif
20070 goto rewrite:
20080 endif
20090 endif
20100 'endif
20110 rewrite:
20120 locate 2,4
20130 color rgb(255,255,255)
20140 print "                                      "
20150 locate 2,4
20160 if ex_info$(1) <> "JP" then
20170 print "Input Born Month?(1~12):";buf_Month$
20180 else
20190 print "生まれた月(1月~12月):";buf_Month$
20200 endif
20210 goto Input_Born_Month2:
20220 endif
20230 case 1:
20240 buf_Month$="**":buf_month=0
20250 if No=-1 then
20260 count2=2:count=0
20270 locate 0,4
20280 print "                                      "
20290 locate 2,4:
20300 if ex_info$(1) <> "JP" then
20310 print "Input Born Month?(1~12):";buf_Month$
20320 else
20330 print "生まれた月(1月~12月):" + buf_Month$
20340 endif
20350 goto Input_Born_Month2:
20360 endif
20370 case 2:
20380 sp_on 14,0:goto Input_Seireki:
20390 end select
20400 endif
20410 'endif
20420 end
20430 'end
20440 '生れた日を入力
20450 Input_Born_Day:
20460 '生まれた日入力
20470 cls 3:play ""
20480 'No=-1:Okのとき
20490 init"kb:4":key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_Day$ = "**":count=0:bg2=0:count2=0
20500 for i=0 to 1
20510 buf_day(i)=0
20520 next i
20530 '***********************************************************
20540 '1.WXGAの時 ここから
20550 '(1200 x 800)
20560 '***********************************************************
20570 if ((size(0) <= 1280) and (size(1) <= 800)) then
20580 gload Gazo$ + Gazo_WXGA$ + "Screen2_907x680_20240216.png",0,0,0
20590 '***********************************************************
20600 '1.WXGAの時　ここまで
20610 '(1200 x 800)
20620 '***********************************************************
20630 else
20640 '***********************************************************
20650 '2.WUXGAの時(WXGA以外の時)　ここから
20660 '(1920 gload Gazo$ + "Selection.png",1,60,240
20670 '***********************************************************
20680 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
20690 gload Gazo$ + "Screen2.png",0,0,0
20700 gload Gazo$ + "downscreen.png",0,0,800
20710 '***********************************************************
20720 '2.WUXGAの時(WXGA以外の時)　ここまで
20730 '(1920 gload Gazo$ + "Selection.png",1,60,240
20740 '***********************************************************
20750 endif
20760 'Init"kb:2"
20770 if ex_info$(1) <> "JP" then
20780 '英語音声パート
20790 else
20800 '日本語音声パート
20810 '音声ファイル再生 2023.06.07
20820 play Voice$ + "Voice_Input_Born_Day_20230607.mp3"
20830 endif
20840 font FONT
20850 if ex_info$(1) <> "JP" then
20860 locate 0,1
20870 '文字色：黒　 color rgb(0,0,0)
20880 color rgb(255,255,255)
20890 print "Input Born day?" + chr$(13)
20900 color rgb(255,255,255)
20910 locate 2,4
20920 print "Born Day(1~31):";buf_Day$
20930 else
20940 locate 0,1
20950 '文字色：黒　 color rgb(0,0,0)
20960 color rgb(255,255,255)
20970 print "生まれた日を入れて下さい" + chr$(13)
20980 color rgb(255,255,255)
20990 locate 2,4
21000 print "生まれた日(1日~31日):";buf_Day$
21010 endif
21020 'color rgb(255,255,255)
21030 'locate 4,6:print ":7"
21040 'locate 9,6:print ":8"
21050 'locate 12,6:print ":9"
21060 'locate 4,6
21070 'print ":7  :8  :9" + chr$(13)
21080 '=======================
21090 'テンキー　色　白　決定ボタン　青
21100 '=======================
21110 'color rgb(255,255,255)
21120 'locate 4,8
21130 'print ":4  :5  :6" + chr$(13)
21140 'color rgb(255,255,255)
21150 'locate 4,10
21160 'print ":1  :2  :3" + chr$(13)
21170 'locate 4,12
21180 'print "    :0"
21190 'locate 12,12
21200 'color rgb(255,0,0)
21210 'print ":Ok"
21220 sp_on 4,0: sp_on 5,0:sp_on 6,0
21230 sp_on 7,0:sp_on 8,0:sp_on 9,0
21240 sp_on 10,0:sp_on 11,0:sp_on 12,0
21250 sp_on 13,0:sp_on 14,1
21260 Input_Born_Day2:
21270 key$="":bg=0:y=0:y2=0:bg2=0
21280 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
21290 key$ = inkey$
21300 bg = strig(1)
21310 y = stick(1)
21320 y2 = stick(0)
21330 bg2 = strig(0)
21340 pause 200
21350 wend
21360 if ((size(0) <= 1280) and (size(1) <= 800)) then
21370 '十字キー　ここから
21380 '上の矢印　または、十字キー上
21390 if ((y = -1) or (key$ = chr$(30))) then
21400 select case No
21410 'No=-1:okのとき:初期の状態
21420 '0kボタンから３に移動
21430 '上に行く 処理
21440 case -1:
21450 No=3:sp_on 6,1:sp_on 14,0:beep
21460 pause 200:goto Input_Born_Day2:
21470 '選択肢:3
21480 '3ボタンから 6に移動
21490 case 3:
21500 No=6:sp_on 9,1:sp_on 6,0:beep
21510 pause 200:goto Input_Born_Day2:
21520 '6ボタンから ９に移動
21530 case 6:
21540 No=9:sp_on 12,1:sp_on 9,0:beep
21550 pause 200:goto Input_Born_Day2:
21560 '6ボタンから ９に移動　ここまで
21570 '9で上を押して何もしない
21580 case 9:
21590 '何もしない
21600 No=9
21610 beep:pause 200:goto Input_Born_Day2:
21620 '9で上を押しても何もしない　ここまで
21630 '上　 0ボタンから2ボタン
21640 'sp_on 6,1:1
21650 'sp_on 8,1:5
21660 'sp_on 7,1:7
21670 case 0:
21680 No=2:sp_on 13,0:sp_on 5,1:beep
21690 pause 200:goto Input_Born_Day2:
21700 '上  0ボタンから2ボタン　ここまで
21710 '2から５になる 上
21720 case 2:
21730 No=5:sp_on 8,1:sp_on 5,0:beep
21740 pause 200:goto Input_Born_Day2:
21750 case 5:
21760 No=8:sp_on 11,1:sp_on 8,0:beep
21770 pause 200:goto Input_Born_Day2:
21780 case 8:
21790 beep:pause 200:goto Input_Born_Day2:
21800 case 1:
21810 No=4:sp_on 7,1:sp_on 4,0:beep
21820 pause 200:goto Input_Born_Day2:
21830 case 4:
21840 No=7:sp_on 10,1:sp_on 7,0:beep
21850 pause 200:goto Input_Born_Day2:
21860 case 7:
21870 beep:pause 200:goto Input_Born_Day2:
21880 end select
21890 endif
21900 '左３　ここまで
21910 '下の矢印
21920 '中央 2
21930 if ((y=1) or (key$ = chr$(31))) then
21940 select case No
21950 '9から６に下げる
21960 case 9:
21970 No=6:sp_on 12,0:sp_on 9,1:beep
21980 pause 200:goto Input_Born_Day2:
21990 '6から３に下げる
22000 case 6:
22010 No=3:sp_on 9,0:sp_on 6,1:beep
22020 pause 200:goto Input_Born_Day2:
22030 '3から０ｋに変える
22040 case 3:
22050 No=-1:sp_on 14,1:sp_on 6,0:beep
22060 pause 200:goto Input_Born_Day2:
22070 'Okから下のボタンを押しても何もしない
22080 case -1:
22090 beep:pause 200:goto Input_Born_Day2:
22100 case 8:
22110 No=5:sp_on 8,1:sp_on 11,0:beep
22120 pause 200:goto Input_Born_Day2:
22130 case 5:
22140 No=2:sp_on 5,1:sp_on 8,0:beep
22150 pause 200:goto Input_Born_Day2:
22160 case 2:
22170 No=0:sp_on 13,1:sp_on 5,0:beep
22180 pause 200:goto Input_Born_Day2:
22190 case 0:
22200 beep:pause 200:goto Input_Born_Day2:
22210 case 7:
22220 No=4:sp_on 7,1:sp_on 10,0:beep
22230 pause 200:goto Input_Born_Day2:
22240 case 4:
22250 No=1:sp_on 4,1:sp_on 7,0:beep
22260 pause 200:goto Input_Born_Day2:
22270 case 1:
22280 beep:pause 200:goto Input_Born_Day2:
22290 end select
22300 endif
22310 '左へボタン 十字キー　左　or 　カーソル左
22320 if ((y2 = -1) or (key$ = chr$(29))) then
22330 select case No
22340 'Ok ボタン  Okから　左　０に行く
22350 case -1:
22360 No=0:sp_on 13,1:sp_on 14,0:beep
22370 pause 200:goto Input_Born_Day2:
22380 '0 ボタン  左　何もしない
22390 case 0:
22400 beep:pause 200:goto Input_Born_Day2:
22410 case 3:
22420 No=2:sp_on 5,1:sp_on 6,0:beep
22430 pause 200:goto Input_Born_Day2:
22440 case 2:
22450 No=1:sp_on 5,0:sp_on 4,1:beep
22460 pause 200:goto Input_Born_Day2:
22470 case 1:
22480 beep:pause 200:goto Input_Born_Day2:
22490 case 6:
22500 No=5:sp_on 8,1:sp_on 9,0:beep
22510 pause 200:goto Input_Born_Day2:
22520 case 5:
22530 No=4:sp_on 7,1:sp_on 8,0:beep
22540 pause 200:goto Input_Born_Day2:
22550 case 4:
22560 beep:pause 200:goto Input_Born_Day2:
22570 case 9:
22580 No=8:sp_on 11,1:sp_on 12,0:beep
22590 pause 200:goto Input_Born_Day2:
22600 case 8:
22610 No=7:sp_on 10,1:sp_on 11,0:beep
22620 pause 200:goto Input_Born_Day2:
22630 case 7:
22640 beep:pause 200:goto Input_Born_Day2:
22650 end select
22660 endif
22670 '右  十字キー　右　or カーソル　右
22680 if ((y2 = 1) or (key$ = chr$(28))) then
22690 select case No
22700 '0ボタンからokボタン右に移動
22710 case 0:
22720 No=-1:sp_on 14,1:sp_on 13,0:beep
22730 pause 200:goto Input_Born_Day2:
22740 '0ボタンからokボタン 右に移動　ここまで
22750 'OKボタンで右を押して何もしない
22760 case -1:
22770 pause 200:goto Input_Born_Day2:
22780 case 1:
22790 No=2:sp_on 5,1:sp_on 4,0:beep
22800 pause 200:goto Input_Born_Day2:
22810 case 2:
22820 No=3:sp_on 6,1:sp_on 5,0
22830 beep:pause 200:goto Input_Born_Day2:
22840 case 3:
22850 beep:pause 200:goto Input_Born_Day2:
22860 case 4:
22870 No=5:sp_on 8,1:sp_on 7,0:beep
22880 pause 200:goto Input_Born_Day2:
22890 case 5:
22900 No=6:sp_on 9,1:sp_on 8,0:beep
22910 pause 200:goto Input_Born_Day2:
22920 case 7:
22930 No=8:sp_on 11,1:sp_on 10,0:beep
22940 pause 200:goto Input_Born_Day2:
22950 case 8:
22960 No=9:sp_on 12,1:sp_on 11,0:beep
22970 pause 200:goto Input_Born_Day2:
22980 case 9:
22990 beep:pause 200:goto Input_Born_Day2:
23000 case 6:
23010 beep:pause 200:goto Input_Born_Day2:
23020 end select
23030 'Okから右ボタンを押して何もしない ここまで
23040 endif
23050 else
23060 '***********************************************************
23070 '2.WUXGAの時(WXGA以外の時)　ここから
23080 '(1920 gload Gazo$ + "Selection.png",1,60,240
23090 '***********************************************************
23100 '十字キー　ここから
23110 '上の矢印　または、十字キー上
23120 if ((y = -1) or (key$ = chr$(30))) then
23130 select case No
23140 'No=-1:okのとき:初期の状態
23150 '0kボタンから３に移動
23160 '上に行く 処理
23170 case -1:
23180 No=3:sp_on 12,1:sp_on 14,0:beep
23190 pause 200:goto Input_Born_Day2:
23200 '選択肢:3
23210 '3ボタンから 6に移動
23220 case 3:
23230 No=6:sp_on 12,0:sp_on 11,1:beep
23240 pause 200:goto Input_Born_Day2:
23250 '6ボタンから ９に移動
23260 case 6:
23270 No=9:sp_on 10,1:sp_on 11,0:beep
23280 pause 200:goto Input_Born_Day2:
23290 '6ボタンから ９に移動　ここまで
23300 '9で上を押して何もしない
23310 case 9:
23320 '何もしない
23330 No=9
23340 beep:pause 200:goto Input_Born_Day2:
23350 '9で上を押しても何もしない　ここまで
23360 '上　 0ボタンから2ボタン
23370 'sp_on 6,1:1
23380 'sp_on 8,1:5
23390 'sp_on 7,1:7
23400 case 0:
23410 No=2:sp_on 13,0:sp_on 9,1:beep
23420 pause 200:goto Input_Born_Day2:
23430 '上  0ボタンから2ボタン　ここまで
23440 '2から５になる 上
23450 case 2:
23460 No=5:sp_on 8,1:sp_on 9,0:beep
23470 pause 200:goto Input_Born_Day2:
23480 case 5:
23490 No=8:sp_on 7,1:sp_on 8,0:beep
23500 pause 200:goto Input_Born_Day2:
23510 case 8:
23520 beep:pause 200:goto Input_Born_Day2:
23530 case 1:
23540 No=4:sp_on 5,1:sp_on 6,0:beep
23550 pause 200:goto Input_Born_Day2:
23560 case 4:
23570 No=7:sp_on 4,1:sp_on 5,0:beep
23580 pause 200:goto Input_Born_Day2:
23590 case 7:
23600 beep:pause 200:goto Input_Born_Day2:
23610 end select
23620 endif
23630 '左３　ここまで
23640 '下の矢印
23650 '中央 2
23660 if ((y=1) or (key$ = chr$(31))) then
23670 select case No
23680 '9から６に下げる
23690 case 9:
23700 No=6:sp_on 11,1:sp_on 10,0:beep
23710 pause 200:goto Input_Born_Day2:
23720 '6から３に下げる
23730 case 6:
23740 No=3:sp_on 12,1:sp_on 11,0:beep
23750 pause 200:goto Input_Born_Day2:
23760 '3から０ｋに変える
23770 case 3:
23780 No=-1:sp_on 14,1:sp_on 12,0:beep
23790 pause 200:goto Input_Born_Day2:
23800 'Okから下のボタンを押しても何もしない
23810 case -1:
23820 beep:pause 200:goto Input_Born_Day2:
23830 case 8:
23840 No=5:sp_on 8,1:sp_on 7,0:beep
23850 pause 200:goto Input_Born_Day2:
23860 case 5:
23870 No=2:sp_on 9,1:sp_on 8,0:beep
23880 pause 200:goto Input_Born_Day2:
23890 case 2:
23900 No=0:sp_on 13,1:sp_on 9,0:beep
23910 pause 200:goto Input_Born_Day2:
23920 case 0:
23930 beep:pause 200:goto Input_Born_Day2:
23940 case 7:
23950 No=4:sp_on 5,1:sp_on 4,0:beep
23960 pause 200:goto Input_Born_Day2:
23970 case 4:
23980 No=1:sp_on 6,1:sp_on 5,0:beep
23990 pause 200:goto Input_Born_Day2:
24000 case 1:
24010 beep:pause 200:goto Input_Born_Day2:
24020 end select
24030 endif
24040 '左へボタン 十字キー　左　or 　カーソル左
24050 if ((y2 = -1) or (key$ = chr$(29))) then
24060 select case No
24070 'Ok ボタン  Okから　左　０に行く
24080 case -1:
24090 No=0:sp_on 13,1:sp_on 14,0:beep
24100 pause 200:goto Input_Born_Day2:
24110 '0 ボタン  左　何もしない
24120 case 0:
24130 beep:pause 200:goto Input_Born_Day2:
24140 case 3:
24150 No=2:sp_on 9,1:sp_on 12,0:beep
24160 pause 200:goto Input_Born_Day2:
24170 case 2:
24180 No=1:sp_on 6,1:sp_on 9,0:beep
24190 pause 200:goto Input_Born_Day2:
24200 case 1:
24210 pause 200:goto Input_Born_Day2:
24220 case 6:
24230 No=5:sp_on 8,1:sp_on 11,0:beep
24240 pause 200:goto Input_Born_Day2:
24250 case 5:
24260 No=4:sp_on 5,1:sp_on 8,0:beep
24270 pause 200:goto Input_Born_Day2:
24280 case 4:
24290 beep:pause 200:goto Input_Born_Day2:
24300 case 9:
24310 No=8:sp_on 7,1:sp_on 10,0:beep
24320 pause 200:goto Input_Born_Day2:
24330 case 8:
24340 No=7:sp_on 4,1:sp_on 7,0:beep
24350 pause 200:goto Input_Born_Day2:
24360 case 7:
24370 beep:pause 200:goto Input_Born_Day2:
24380 end select
24390 endif
24400 '右  十字キー　右　or カーソル　右
24410 if ((y2 = 1) or (key$ = chr$(28))) then
24420 select case No
24430 '0ボタンからokボタン右に移動
24440 case 0:
24450 No=-1:sp_on 14,1:sp_on 13,0:beep
24460 pause 200:goto Input_Born_Day2:
24470 '0ボタンからokボタン 右に移動　ここまで
24480 'OKボタンで右を押して何もしない
24490 case -1:
24500 beep:pause 200:goto Input_Born_Day2:
24510 case 1:
24520 No=2:sp_on 9,1:sp_on 6,0:beep
24530 pause 200:goto Input_Born_Day2:
24540 case 2:
24550 No=3:sp_on 12,1:sp_on 9,0:beep
24560 pause 200:goto Input_Born_Day2:
24570 case 3:
24580 beep:pause 200:goto Input_Born_Day2:
24590 case 4:
24600 No=5:sp_on 8,1:sp_on 5,0:beep
24610 pause 200:goto Input_Born_Day2:
24620 case 5:
24630 No=6:sp_on 11,1:sp_on 8,0:beep
24640 pause 200:goto Input_Born_Day2:
24650 case 7:
24660 No=8:sp_on 7,1:sp_on 4,0:beep
24670 pause 200:goto Input_Born_Day2:
24680 case 8:
24690 No=9:sp_on 10,1:sp_on 7,0:beep
24700 pause 200:goto Input_Born_Day2:
24710 case 9:
24720 beep:pause 200:goto Input_Born_Day2:
24730 case 6:
24740 beep:pause 200:goto Input_Born_Day2:
24750 end select
24760 'Okから右ボタンを押して何もしない ここまで
24770 endif
24780 '***********************************************************
24790 '2.WUXGAの時(WXGA以外の時)　ここまで
24800 '(1920 gload Gazo$ + "Selection.png",1,60,240
24810 '***********************************************************
24820 endif
24830 '十字キー　ここまで
24840 '右の丸ボタンを押したとき
24850 if ((bg = 2) or (key$ = chr$(13))) then
24860 'count :決定ボタンを押した回数
24870 select case (count mod 3)
24880 '1桁目入力
24890 case 0:
24900 count = 1:
24910 if (No = -1) then
24920 '1桁目　OKでは何もしない
24930 'goto check:
24940 else
24950 'ok以外のボタンを押したとき
24960 buf_day = No:buf_Day$ = str$(No)
24970 c=No:buf_Day2$ = buf_Day$ + string$(1,"*")
24980 locate 2,4
24990 color RGB(255,255,255)
25000 if ex_info$(1) <> "JP" then
25010 print "Input Born Day(1~31):";buf_Day2$
25020 else
25030 print "生まれた日(1日~31日):";buf_Day2$
25040 endif
25050 endif
25060 check:
25070 if (No >= 1 and No <= 9) then
25080 sp_on 14,0
25090 goto Input_Born_Day2:
25100 else
25110 sp_on 14,0
25120 goto complate:
25130 endif
25140 case 1:
25150 '10未満の数字ボタン+okボタン or 2桁目の数字ボタン
25160 count = 2:
25170 'locate 2,3
25180 'color RGB(255,255,255)
25190 'print "生まれた日(1日~31日):";buf_Day$
25200 'Okボタンを押したときの処理
25210 '入力値　10未満のとき
25220 'c = buf_day
25230 if (No = -1) then
25240 'c=buf_day
25250 ' buf_day = c
25260 'buf_Day$ = str$(buf_day)
25270 '10以下のとき
25280 if (buf_day < 10) then
25290 sp_on 14,0
25300 goto complate:
25310 endif
25320 else
25330 'c = No
25340 buf_day = c * 10 + No
25350 'buf_day = c
25360 buf_Day$ =str$(buf_day)
25370 locate 2,4
25380 color Rgb(255,255,255)
25390 if ex_info$(1) <> "JP" then
25400 print "Input Born Day(1~31):";buf_Day$
25410 else
25420 print "生まれた日(1日~31日):";buf_Day$
25430 endif
25440 goto Input_Born_Day2:
25450 endif
25460 '生まれた日　2桁目の数字　or 1桁の数字 + ok
25470 case 2:
25480 count=0
25490 'c=val(buf_Day$)
25500 'buf_day=c*10+No
25510 'buf_Day$=str$(buf_day)
25520 'day=buf_day
25530 'locate 2,3
25540 'print "生まれた日(1日〜31日):";buf_Day$
25550 'No=-1:ok ボタンを押したとき
25560 if (No = -1) then
25570 if ((buf_day > 0) and (buf_day < 32)) then
25580 sp_on 14,0
25590 goto complate:
25600 else
25610 goto Input_Born_Day2:
25620 endif
25630 'Okボタン以外を押したとき
25640 else
25650 c=val(buf_Day$)
25660 buf_day = c * 10 + No
25670 buf_Day$ = str$(buf_day)
25680 locate 2,4
25690 if ex_info$(1) <> "JP" then
25700 print "Input Born Day?(1~31):";buf_Day$
25710 else
25720 print "生まれた日(1日~31日):";buf_Day$
25730 endif
25740 'goto Input_Born_Day2:
25750 endif
25760 case 3:
25770 count = 4
25780 c=val(buf_day$)
25790 buf_day = c * 10 + No
25800 buf_day$ = str$(buf_day)
25810 locate 2,4
25820 if ex_info$(1) <> "JP" then
25830 print "Input Born Day?(1~31):";buf_Day$
25840 else
25850 print "生まれた日を入れてください(1日~31日):";buf_Day$
25860 endif
25870 year = val(buf_year$)
25880 if (No = -1) then
25890 'goto Input_Born_Day:
25900 sp_on 14,0:No=0
25910 goto complate:
25920 else
25930 goto Input_Born_Month2:
25940 endif
25950 'case 4:
25960 'bufyear=buf_year
25970 'if (No=-1) then
25980 'buf_day = val(buf_day$)
25990 'bufday = buf_day
26000 'sp_on 14,0
26010 'goto complate:
26020 'else
26030 'goto Input_Born_Day2:
26040 'endif
26050 end select
26060 endif
26070 if (bg2=2) then
26080 select case count
26090 case 0:
26100 if (No=-1) then
26110 'buf_day=0:buf_Day$="**"
26120 if (buf_day>=1 and buf_day<=31) then
26130 count=0:No=0
26140 buf_day=0:buf_Day$="**"
26150 'goto rewrite_day:
26160 else
26170 buf_day=0:buf_Day$="**"
26180 ui_msg"値が範囲外です"
26190 endif
26200 goto rewrite_day:
26210 else
26220 goto rewrite_day:
26230 endif
26240 rewrite_day:
26250 locate 2,4
26260 color rgb(255,255,255)
26270 print "                                      "
26280 locate 2,4
26290 if ex_info$(1)<>"JP" then
26300 print "Born Day(1~31):";buf_Day$
26310 else
26320 print "生まれた日(1日~31日):";buf_Day$
26330 endif
26340 goto Input_Born_Day2:
26350 end select
26360 endif
26370 '--------------------------Input_Born_Day:-------------------------------------------
26380 complate:
26390 suhiNo = buf_year + buf_month + buf_day
26400 'if (suhiNo < 1000) then
26410 a1 = fix(suhiNo / 1000)
26420 a2 = fix(suhiNo/100) - (a1 * 10)
26430 a3 = fix(suhiNo/10)-(a1*100+a2*10)
26440 a4 =fix(suhiNo-((a1*1000+a2*100+a3*10)))
26450 'endif
26460 bufsuhiNo = a1 + a2 + a3 + a4
26470 recomp:
26480 if ((bufsuhiNo > 0 and bufsuhiNo < 10) or (bufsuhiNo = 11) or (bufsuhiNo = 22) or (bufsuhiNo = 33)) then
26490 'bufsuhiNo=a6
26500 goto Kabara_Result_Screen:
26510 else
26520 a5 = fix(bufsuhiNo / 10)
26530 a6 = bufsuhiNo - a5 * 10
26540 bufsuhiNo = a6 + a5
26550 if (bufsuhiNo = 10) then
26560 bufsuhiNo=1
26570 endif
26580 goto Kabara_Result_Screen:
26590 endif
26600 Kabara_Result_Screen:
26610 cls 3:
26620 if ((size(0) <= 1280) and (size(1) <= 800)) then
26630 '****************************************************************************************************
26640 '1.WXGA(1260x800)の時
26650 '****************************************************************************************************
26660 gload Gazo$ + Gazo_WXGA$ + "ResultScreen_918x680_20240309.png",0,0,0
26670 '****************************************************************************************************
26680 '1.WUXGA(1260x800)の時
26690 '****************************************************************************************************
26700 else
26710 '****************************************************************************************************
26720 '1.WXGA(1920x1200)の時
26730 '****************************************************************************************************
26740 gload Gazo$ + "ResultScreen_20230601.png",0,0,0
26750 gload Gazo$ + "downscreen.png",0,0,800
26760 '****************************************************************************************************
26770 '1.WUXGA(1920x1200)の時
26780 '****************************************************************************************************
26790 endif
26800 init "kb:4"
26810 '
26820 play ""
26830 select case (bufsuhiNo)
26840 case 1:
26850 '****************************************************************************************************
26860 '1.数秘ナンバー 1
26870 '****************************************************************************************************
26880 play Voice$ + "Result_Kabara_1_20230607.mp3"
26890 '****************************************************************************************************
26900 '1.数秘ナンバー 1
26910 '****************************************************************************************************
26920 case 2:
26930 '****************************************************************************************************
26940 '1.数秘ナンバー 2
26950 '****************************************************************************************************
26960 play Voice$ + "Result_Kabara_2_20231112.mp3"
26970 '****************************************************************************************************
26980 '1.数秘ナンバー 2
26990 '****************************************************************************************************
27000 case 3:
27010 '****************************************************************************************************
27020 '1.数秘ナンバー 3
27030 '****************************************************************************************************
27040 play Voice$ + "Result_Kabara_3_20230607.mp3"
27050 '****************************************************************************************************
27060 '1.数秘ナンバー 3
27070 '****************************************************************************************************
27080 case 4:
27090 '****************************************************************************************************
27100 '1.数秘ナンバー 4
27110 '****************************************************************************************************
27120 play Voice$ + "Result_Kabara_4_20230607.mp3"
27130 '****************************************************************************************************
27140 '1.数秘ナンバー 4
27150 '****************************************************************************************************
27160 case 5:
27170 '****************************************************************************************************
27180 '1.数秘ナンバー 5
27190 '****************************************************************************************************
27200 play Voice$ + "Result_Kabara_5_20231112.mp3"
27210 '****************************************************************************************************
27220 '1.数秘ナンバー 5
27230 '****************************************************************************************************
27240 case 6:
27250 '****************************************************************************************************
27260 '1.数秘ナンバー 6
27270 '****************************************************************************************************
27280 play Voice$ + "Result_Kabara_6_20230607.mp3"
27290 '****************************************************************************************************
27300 '1.数秘ナンバー 6
27310 '****************************************************************************************************
27320 case 7:
27330 '****************************************************************************************************
27340 '1.数秘ナンバー 7
27350 '****************************************************************************************************
27360 play Voice$ + "Result_Kabara_7_20230607.mp3"
27370 '****************************************************************************************************
27380 '1.数秘ナンバー 7
27390 '****************************************************************************************************
27400 case 8:
27410 '****************************************************************************************************
27420 '1.数秘ナンバー 8
27430 '****************************************************************************************************
27440 play Voice$ + "Result_Kabara_8_20230607.mp3"
27450 '****************************************************************************************************
27460 '1.数秘ナンバー 8
27470 '****************************************************************************************************
27480 case 9:
27490 '****************************************************************************************************
27500 '1.数秘ナンバー 9
27510 '****************************************************************************************************
27520 play Voice$ + "Result_Kabara_9_20230607.mp3"
27530 '****************************************************************************************************
27540 '1.数秘ナンバー 9
27550 '****************************************************************************************************
27560 case 11:
27570 '****************************************************************************************************
27580 '1.数秘ナンバー 11
27590 '****************************************************************************************************
27600 play Voice$ + "Result_Kabara_11_20230607.mp3"
27610 '****************************************************************************************************
27620 '1.数秘ナンバー 11
27630 '****************************************************************************************************
27640 case 22:
27650 '****************************************************************************************************
27660 '1.数秘ナンバー 22
27670 '****************************************************************************************************
27680 play Voice$ + "Result_Kabara_22_20230607.mp3"
27690 '****************************************************************************************************
27700 '1.数秘ナンバー 22
27710 '****************************************************************************************************
27720 case 33:
27730 '****************************************************************************************************
27740 '1.数秘ナンバー 33
27750 '****************************************************************************************************
27760 play Voice$ + "Result_Kabara_33_20230607.mp3"
27770 '****************************************************************************************************
27780 '1.数秘ナンバー 33
27790 '****************************************************************************************************
27800 end select
27810 '****************************************************************************************************
27820 '
27830 '****************************************************************************************************
27840 font FONT
27850 '****************************************************************************************************
27860 '
27870 '****************************************************************************************************
27880 key$ = "":bg = 0:bg2=0
27890 'COLOR rgb(255,255,255)
27900 'print "●診断結果"+chr$(13)
27910 locate 0,2
27920 if ex_info$(1)<>"JP" then
27930 color rgb(0,0,0):print "Your Birth Day：";buf_year;".";buf_month;".";buf_day;".";chr$(13)
27940 color rgb(0,0,0):print"Your Kabara Kabara Number is";bufsuhiNo;".";chr$(13)
27950 locate 0,15:
27960 color rgb(255,255,255)
27970 print "Left button：Retry,Right Button：Main Screen" + chr$(13)
27980 else
27990 if ((size(0) <= 1280) and (size(1) <= 800)) then
28000 locate 0,4
28010 '****************************************************************************************************
28020 '1.WXGA(1260x800)の時
28030 '****************************************************************************************************
28040 color rgb(0,0,0):print "誕生日：";buf_year;"年";buf_month;"月";buf_day;"日";chr$(13)
28050 color rgb(0,0,0):print"あなたの数秘ナンバーは";bufsuhiNo;"です";chr$(13)
28060 locate 0,19
28070 print "                    "
28080 color rgb(255,255,255)
28090 locate 0,19
28100 print "左の丸：もう一度診断,右の丸：メイン画面" + chr$(13)
28110 '****************************************************************************************************
28120 '1.WUXGA(1260x800)の時
28130 '****************************************************************************************************
28140 else
28150 locate 0,2
28160 '****************************************************************************************************
28170 'WUXG(1920x1200)の時ここから
28180 '****************************************************************************************************
28190 color rgb(0,0,0):print "誕生日：";buf_year;"年";buf_month;"月";buf_day;"日";chr$(13)
28200 color rgb(0,0,0):print"あなたの数秘ナンバーは";bufsuhiNo;"です";chr$(13)
28210 locate 0,15
28220 color rgb(255,255,255)
28230 print "左の丸：もう一度診断,右の丸：メイン画面" + chr$(13)
28240 endif
28250 '****************************************************************************************************
28260 'WUXG(1920x1200)の時ここまで
28270 '****************************************************************************************************
28280 endif
28290 while ((key$ <> chr$(13)) and (bg <> 2) and (bg2 <> 2))
28300 key$ = inkey$
28310 bg = strig(1)
28320 bg2 = strig(0)
28330 pause 200
28340 wend
28350 'Enter or JoyPad right
28360 if ((key$ = chr$(13)) or (bg = 2)) then
28370 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 100:cls 3:goto Main_Screen:
28380 endif
28390 if ((bg2=2)) then
28400 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 100:cls 3:goto Input_Seireki:
28410 endif
28420 'suhiNo1 = fix(bufsuhiNo / 10)
28430 'suhiNo2 = bufsuhiNo - (suhiNo1 * 10)
28440 'bufsuhiNo = suhiNo1 + suhiNo2
28450 'goto recomp:
28460 'endif
28470 'print chr$(13)
28480 'color rgb(255,0,0)
28490 'print"トップ:エンターキー,S or s:保存"+chr$(13)
28500 'key$ = input$(1)
28510 'if key$ = chr$(13) then goto Main_Screen:
28520 '"Menu2 占いのルール"
28530 Suhi_Rule:
28540 '数秘術占いルールの表示
28550 cls 3:play "":init"kb:4"
28560 if ((size(0)<=1280) and (size(1)<=800)) then
28570 '****************************************************************************************************
28580 'WUXG(1920x1200)の時ここから
28590 '****************************************************************************************************
28600 gload Gazo$  + Gazo_WXGA$ +  "KabaraRuleScreen_864x640_20240219.png",0,0,0
28610 '****************************************************************************************************
28620 'WUXG(1920x1200)の時ここまで
28630 '****************************************************************************************************
28640 else
28650 '****************************************************************************************************
28660 'WUXG(1920x1200)の時ここから
28670 '****************************************************************************************************
28680 gload Gazo$ + "KabaraRuleScreen_20230601.png",0,0,0
28690 gload Gazo$ + "downscreen.png",0,0,800
28700 '****************************************************************************************************
28710 'WUXG(1920x1200)の時ここまで
28720 '****************************************************************************************************
28730 endif
28740 'cls 3:
28750 'line (0,0) - (1500,60),rgb(0,0,255),bf
28760 'line (0,60) - (1500,60*9),rgb(127,255,212),bf
28770 'line (0,60 * 9) - (1500,60 * 10 + 30),rgb(0,255,0),bf
28780 'COLOR rgb(255,255,255):print "Menu2 数秘術のルール";chr$(13)
28790 if ex_info$(1)<>"JP" then
28800 locate 0,2:Font 48
28810 print chr$(13) + chr$(13)
28820 color rgb(0,0,0)
28830 print "We will convert your birth date to a single number.";chr$(13)
28840 print "Number range: 1~9, 11, 22, 33";chr$(13)
28850 print "Example: If your birth date is 22nd November 1973";chr$(13)
28860 print "1+9+7+3+11+22=53 ";chr$(13)
28870 print "→ 5 + 3 = 8" + chr$(13)
28880 print "So, your numerology number is 8.";chr$(13)
28890 locate 0,15
28900 color rgb(255,255,255)
28910 print "Please press the right on the joystick"
28920 play Voice$ + "Voice_Kabara_Rule_Message_20230607.mp3"
28930 else
28940 Font Font
28950 if ((size(0)<=1280) and (size(1)<=800)) then
28960 '************************************************************************************************
28970 '1.WXGAの時1200x800の時
28980 '************************************************************************************************
28990 color rgb(0,0,0)
29000 locate 1,5:print "誕生日を単数変換します";chr$(13)
29010 locate 1,7:print "数字の範囲:1~９,11,22,33";chr$(13)
29020 locate 1,9:print "例:1973年11月22日の場合";chr$(13)
29030 locate 1,11:print "1+9+7+3+11+22=53 ";chr$(13)
29040 locate 1,13:print "→ 5 + 3 = 8" + chr$(13)
29050 locate 1,15:print "故に8が数秘ナンバーになります";chr$(13)
29060 locate 0,19:color rgb(255,255,255)
29070 print "ジョイパッドの右を押してください"
29080 '************************************************************************************************
29090 '1.WXGAの時1200x800の時
29100 '************************************************************************************************
29110 else
29120 '****************************************************************************************************
29130 '2.WUXG(1920x1200)の時ここから
29140 '****************************************************************************************************
29150 print chr$(13) + chr$(13)
29160 color rgb(0,0,0)
29170 print "誕生日を単数変換します";chr$(13)
29180 print "数字の範囲:1~９,11,22,33";chr$(13)
29190 print "例:1973年11月22日の場合";chr$(13)
29200 print "1+9+7+3+11+22=53 ";chr$(13)
29210 print "→ 5 + 3 = 8" + chr$(13)
29220 print "故に8が数秘ナンバーになります";chr$(13)
29230 locate 0,15
29240 color rgb(255,255,255)
29250 print "ジョイパッドの右を押してください"
29260 '****************************************************************************************************
29270 '2.WUXG(1920x1200)の時ここまで
29280 '****************************************************************************************************
29290 endif
29300 play Voice$ + "Voice_Kabara_Rule_Message_20230607.mp3"
29310 endif
29320 '"key$ = input$(1)"
29330 '"if key$ = chr$(13) then goto Main_Screen:"
29340 suhi_rule_selection:
29350 bg = 0:key$ = "":bg2=0
29360 while ((bg <> 2) and (key$ <> chr$(13)) and (bg2<>2))
29370 bg = strig(1)
29380 key$ = inkey$
29390 bg2=strig(0)
29400 pause 200
29410 wend
29420 if ((bg = 2) or (key$ = chr$(13))) then
29430 pause 200:cls 4:goto Main_Screen:
29440 endif
29450 if (bg2=2) then
29460 play "":pause 200
29470 play Voice$ + "Voice_Kabara_Rule_Message_20230607.mp3"
29480 goto suhi_rule_selection:
29490 endif
29500 '2.設定 ここから
29510 '2-1.トップ画面に戻る
29520 Setting:
29530 cls 3:init"kb:4":font 48:No=0
29540 play ""
29550 play Voice$ + "Voice_Kabara_Setting_20230614.mp3"
29560 '****************************************************************************************************
29570 'W(1280x 800)の時ここから
29580 '****************************************************************************************************
29590 if (size(0)<=1280 and size(1)<=800) then
29600 gload Gazo$ + Gazo_WXGA$ + "Screen1_Setting_Top_907x680_20240221.png",0,0,0
29610 '****************************************************************************************************
29620 'W(1280 x800)の時ここまで
29630 '****************************************************************************************************
29640 else
29650 '****************************************************************************************************
29660 'WUXG(1920x1200)の時ここから
29670 '****************************************************************************************************
29680 gload Gazo$ + "Screen1_Setting_Top.png",0,0,0
29690 gload Gazo$ + "downscreen.png",0,0,800
29700 '****************************************************************************************************
29710 'WUXG(1920x1200)の時ここまで
29720 '****************************************************************************************************
29730 endif
29740 if (size(0)<=1280 and size(1)<=800) then
29750 font FONT:color rgb(255,255,255):cls
29760 sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:
29770 '****************************************************************************************************
29780 '(1280x800)の時 ここから
29790 '****************************************************************************************************
29800 locate 1,5:
29810 print "番号を選んでください"
29820 locate 1,7:
29830 print " :1.トップ画面に戻る"
29840 locate 1,10:
29850 print " :2.バーズアイグリッドデーターリスト"
29860 locate 1,13:
29870 print " :3.未実装" + chr$(13)
29880 locate 1,16:
29890 print " :4.未実装" + chr$(13)
29900 color rgb(0,0,0):locate 1,19:
29910 print "1.トップ画面に戻るを選択"
29920 '****************************************************************************************************
29930 '(1280x800)の時 ここまで
29940 '****************************************************************************************************
29950 else
29960 font FONT
29970 print chr$(13) + chr$(13) + chr$(13)
29980 color rgb(255,255,255):sp_on 0,1:
29990 '****************************************************************************************************
30000 'WUXG(1920x1200)の時ここから
30010 '****************************************************************************************************
30020 print "番号を選んでください" + chr$(13)
30030 print " :1.トップ画面に戻る"+ chr$(13)
30040 print " :2.バーズアイグリッドデーターリスト" + chr$(13)
30050 print " :3.未実装" + chr$(13)
30060 print " :4.未実装" + chr$(13)
30070 color rgb(0,0,0)
30080 locate 1,15:print "1.トップ画面に戻るを選択"
30090 '****************************************************************************************************
30100 'WUXG(1920x1200)の時ここまで
30110 '****************************************************************************************************
30120 endif
30130 Setting_Selection:
30140 y=0:key$="":bg=0:bg2=0
30150 while ((key$ <> chr$(13)) and (bg <> 2) and (bg2<>2) and (y <> -1) and (y <> 1))
30160 y=stick(1)
30170 key$ = inkey$
30180 bg=strig(1)
30190 bg2 = strig(0)
30200 pause 200
30210 wend
30220 if ((bg = 2) or (key$ = chr$(13))) then
30230 select case No
30240 case 0:
30250 sp_on 0,0:sp_on 1,0:sp_on 2,0:beep:pause 200:cls 3:goto Main_Screen:
30260 case 1:
30270 sp_on 0,0:sp_on 1,0:sp_on 2,0:beep:pause 200:goto BirdsEyeGrid_Entry:
30280 end select
30290 endif
30300 if (bg2 = 2) then
30310 play "":pause 200
30320 play Voice$ + "Voice_Kabara_Setting_20230614.mp3"
30330 goto Setting_Selection:
30340 endif
30350 '****************************************************************************************************
30360 '(1280x800)の時 ここから
30370 '****************************************************************************************************
30380 if (size(0) <= 1280 and size(1) <= 800) then
30390 if ((y=1) or (y=-1)) then
30400 select case No
30410 case 0:
30420 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:beep:gosub Setting_Recheck:pause 200:color rgb(0,0,0):locate 1,19:print "                    ":locate 1,19:print"2.バーズアイグリットデーターリストを選択":goto Setting_Selection:
30430 case else:
30440 No=0:sp_on 1,0:sp_on 0,1:sp_on 2,0:sp_on 3,0:beep:gosub Setting_Recheck:pause 200:locate 1,19:color rgb(0,0,0):print "                                              ":locate 1,19:print "1.トップ画面に戻るを選択":goto Setting_Selection:
30450 end select
30460 '****************************************************************************************************
30470 '(1280x800)の時 ここまで
30480 '****************************************************************************************************
30490 endif
30500 else
30510 '****************************************************************************************************
30520 '(1920x1280)の時 ここから
30530 '****************************************************************************************************
30540 if ((y=1) or (y=-1)) then
30550 select case No
30560 case 0:
30570 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:beep:pause 200:color rgb(0,0,0):locate 1,15:print "                                              ":locate 1,15:print"2.バーズアイグリットデーターリストを選択":goto Setting_Selection:
30580 case else:
30590 No=0:sp_on 1,0:sp_on 0,1:sp_on 2,0:sp_on 3,0:beep:pause 200:color rgb(0,0,0):locate 1,15:print "                                              ":locate 1,15:print "1.トップ画面に戻るを選択":goto Setting_Selection:
30600 end select
30610 endif
30620 '****************************************************************************************************
30630 '(1920x1200)の時 ここまで
30640 '****************************************************************************************************
30650 endif
30660 '2.設定 ここまで
30670 '3.Help
30680 '3-1.ルールの表示
30690 '3-2.バージョン
30700 '3-3.トップに戻る
30710 Help:
30720 cls 3:Font 48:No=0
30730 play ""
30740 '****************************************************************************************************
30750 ''WXGAの場合　ここから (1280 x 800)
30760 '****************************************************************************************************
30770 if ((size(0)<=1280) and (size(1)<=800)) then
30780 gload Gazo$ + Gazo_WXGA$ + "TopScreen_Help_907x680_20240216.png",0,0,0
30790 '****************************************************************************************************
30800 ''WXGAの場合　ここまで (1280 x 800)
30810 '****************************************************************************************************
30820 else
30830 '****************************************************************************************************
30840 'WUXG(1920x1200)の時ここから
30850 '****************************************************************************************************
30860 gload Gazo$ + "TopScreen_Help20230612.png",0,0,0
30870 gload Gazo$ + "downscreen.png",0,0,800
30880 endif
30890 '****************************************************************************************************
30900 'WUXG(1920x1200)の時ここまで
30910 '****************************************************************************************************
30920 if ex_info$(1)<>"JP" then
30930 font FONT
30940 color rgb(255,255,255)
30950 print chr$(13)+chr$(13)+chr$(13)
30960 print "Please select a number"+chr$(13)
30970 print " :1. Rules for Explain" + chr$(13)
30980 print " :2. Display Version" + chr$(13)
30990 print " :3. References" + chr$(13)
31000 print " :4. Return to Top Screen" + chr$(13)
31010 else
31020 if ((size(0)<=1280) and (size(1)<=800)) then
31030 color rgb(255,255,255)
31040 font FONT
31050 locate 1,5
31060 print "番号を選んでください"
31070 locate 1,7
31080 print " :1.ルールの説明"
31090 locate 1,10
31100 print " :2.バージョンの表示"
31110 locate 1,13
31120 print " :3.参考文献"
31130 locate 1,16
31140 print " :4.トップ画面に戻る"
31150 else
31160 '****************************************************************************************************
31170 'WUXG(1920x1200)の時ここから
31180 '****************************************************************************************************
31190 font FONT
31200 color rgb(255,255,255)
31210 print chr$(13)+chr$(13)+chr$(13)
31220 print "番号を選んでください"+chr$(13)
31230 print " :1.ルールの説明" + chr$(13)
31240 print " :2.バージョンの表示" + chr$(13)
31250 print " :3.参考文献" + chr$(13)
31260 print " :4.トップ画面に戻る" + chr$(13)
31270 endif
31280 endif
31290 '****************************************************************************************************
31300 'WUXG(1920x1200)の時ここまで
31310 '****************************************************************************************************
31320 '************************************************************************************************
31330 '1.WXGAの場合　ここから (1280 x 800)
31340 '************************************************************************************************
31350 color rgb(0,0,0)
31360 if ((size(0) <= 1280) and (size(1) <= 800)) then
31370 sp_on 0,1:sp_on 1,0:sp_on 2,0,sp_on 3,0
31380 locate 1,19
31390 print "                                  "
31400 if ex_info$(1) <> "JP" then
31410 print "1. Select Rules for Explain"
31420 else
31430 if count=0 then
31440 locate 1,19
31450 print "1.ルールの説明を選択"
31460 endif
31470 endif
31480 '************************************************************************************************
31490 '1.WXGAの場合　ここまで (1280 x 800)
31500 '************************************************************************************************
31510 else
31520 '*************************************************************************************************
31530 '2.WUXG(1920x1200)の時ここから
31540 '**************************************************************************************************
31550 'color rgb(0,0,0)
31560 sp_on 0,1:sp_on 1,0:sp_on 2,0,sp_on 3,0
31570 locate 1,15
31580 print "                                  "
31590 if ex_info$(1) <> "JP" then
31600 print "1. Select Rules for Explain"
31610 else
31620 locate 1,15
31630 print "1.ルールの説明を選択"
31640 endif
31650 '****************************************************************************************************
31660 '2.WUXG(1920x1200)の時ここまで
31670 '****************************************************************************************************
31680 endif
31690 init"kb:4"
31700 play Voice$ + "Voice_Kabara_Help_Top_20230614.mp3"
31710 Help_Select:
31720 bg=0:key$="":y=0:bg2=0
31730 while ((key$ <> chr$(31)) and (key$ <> chr$(13)) and (y <> 1) and (y <> -1) and (bg <> 2) and (bg2 <> 2))
31740 y = stick(1)
31750 key$ = inkey$
31760 bg = strig(1)
31770 bg2 = strig(0)
31780 pause 200
31790 wend
31800 if ex_info$(1)<>"JP" then
31810 'Joypad: Down (y=1), Cursor: Down (key$=chr$(31))
31820 if ((y = 1) or (key$ = chr$(31))) then
31830 select case No
31840 case 0:
31850 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print"2. Display Version":goto Help_Select:
31860 case 1:
31870 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "3. References":goto Help_Select:
31880 case 2:
31890 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "4. Return to Top Screen":goto Help_Select:
31900 case 3:
31910 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "1. Select Rule for Explain":goto Help_Select:
31920 end select
31930 endif
31940 '************************************************************************************************
31950 '1.WXGAの場合　ここから (1280 x 800)
31960 '************************************************************************************************
31970 if ((y = -1) or (key$ = chr$(30))) then
31980 select case No
31990 case 0:
32000 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,19:print "                                      ":locate 1,19:print "4.Return to Top Screen":goto Help_Select:
32010 case 1:
32020 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,19:print "                                      ":locate 1,19:print "1.Select Rules for Explain":goto Help_Select:
32030 case 2:
32040 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,19:print "                                        ":locate 1,19:print "2.Display Version":goto Help_Select:
32050 case 3:
32060 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,19:print "                                              ":locate 1,19:print "3.References":goto Help_Select:
32070 end select
32080 '************************************************************************************************
32090 '1.WXGAの場合　ここまで (1280 x 800)
32100 '************************************************************************************************
32110 else
32120 '****************************************************************************************************
32130 'WUXG(1920x1200)の時ここから
32140 '****************************************************************************************************
32150 if ((y = -1) or (key$ = chr$(30))) then
32160 select case No
32170 case 0:
32180 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "4.Return to Top Screen":goto Help_Select:
32190 case 1:
32200 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.Select Rules for Explain":goto Help_Select:
32210 case 2:
32220 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                        ":locate 1,15:print "2.Display Version":goto Help_Select:
32230 case 3:
32240 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "3.References":goto Help_Select:
32250 end select
32260 endif
32270 '****************************************************************************************************
32280 'WUXG(1920x1200)の時ここまで
32290 '****************************************************************************************************
32300 endif
32310 else
32320 '************************************************************************************************
32330 '1.WXGAの場合　ここから (1280 x 800)
32340 '************************************************************************************************
32350 if ((size(0) <= 1280) and (size(1) <= 800)) then
32360 'ジョイパッド：下 (y=1)、カーソル：下 (key$=chr$(31))
32370 if ((y = 1) or (key$ = chr$(31))) then
32380 select case No
32390 case 0:
32400 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_put 1,(5,Y + 120),1,0:count = count + 1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0):locate 1,19:print "                                      ":locate 1,19:print"2.バージョンの表示を選択":goto Help_Select:
32410 case 1:
32420 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,Y + 220),2,0:count = count + 1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0):locate 1,19:print "                                      ":locate 1,19:print "3.参考文献を選択":goto Help_Select:
32430 case 2:
32440 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,Y + 320),0,0:count = count + 1:beep:pause 200:locate 1,19:gosub Help_Top_ReCheck:color rgb(0,0,0):print "                                      ":locate 1,19:print "4.トップ画面に戻る":goto Help_Select:
32450 case 3:
32460 '****************************
32470 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,Y + 20),0,0:count = count + 1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0):locate 1,19:print "                                              ":locate 1,19:print "1.ルールの説明を選択":goto Help_Select:
32480 '****************************
32490 end select
32500 endif
32510 '************************************************************************************************
32520 '1.WXGAの場合　ここまで (1280 x 800)
32530 '************************************************************************************************
32540 else
32550 '****************************************************************************************************
32560 'WUXG(1920x1200)の時ここから
32570 '****************************************************************************************************
32580 if ((y = 1) or (key$ = chr$(31))) then
32590 select case No
32600 case 0:
32610 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print"2.バージョンの表示を選択":goto Help_Select:
32620 case 1:
32630 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "3.参考文献を選択":goto Help_Select:
32640 case 2:
32650 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "4.トップ画面に戻る":goto Help_Select:
32660 case 3:
32670 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "1.ルールの説明を選択":goto Help_Select:
32680 end select
32690 endif
32700 '****************************************************************************************************
32710 'WUXG(1920x1200)の時ここまで
32720 '****************************************************************************************************
32730 endif
32740 'ジョイパッド：上  (y=-1) 、カーソル上 (key$=chr$(30))
32750 '************************************************************************************************
32760 '1.WXGAの場合　ここから (1280 x 800)
32770 '************************************************************************************************
32780 if ((size(0) <= 1280) and (size(1) <= 800)) then
32790 if ((y = -1) or (key$ = chr$(30))) then
32800 select case No
32810 case 0:
32820 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,Y+320),0,0:count=count+1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0):locate 1,15:print "                                      ":locate 1,19:print "4.トップ画面に戻るを選択":goto Help_Select:
32830 case 1:
32840 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,Y+20),0,0:count=count+1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0,0):locate 1,15:print "                                      ":locate 1,19:print "1.ルールの説明を選択":goto Help_Select:
32850 case 2:
32860 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(5,Y+120),1,0:count=count+1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0):locate 1,15:print "                                        ":locate 1,19:print "2.バージョンの表示を選択":goto Help_Select:
32870 case 3:
32880 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,Y+220),2,0:count=count+1:beep:pause 200:gosub Help_Top_ReCheck:color rgb(0,0,0):locate 1,15:print "                                              ":locate 1,19:print "3.参考文献を選択":goto Help_Select:
32890 end select
32900 endif
32910 '************************************************************************************************
32920 '1.WXGAの場合　ここから (1280 x 800)
32930 '************************************************************************************************
32940 else
32950 '************************************************************************************************
32960 'WUXG(1920x1200)の時ここから
32970 '************************************************************************************************
32980 if ((y = -1) or (key$ = chr$(30))) then
32990 select case No
33000 case 0:
33010 No=3:sp_on 3,1:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "4.トップ画面に戻るを選択":goto Help_Select:
33020 case 1:
33030 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.ルールの説明を選択":goto Help_Select:
33040 case 2:
33050 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                        ":locate 1,15:print "2.バージョンの表示を選択":goto Help_Select:
33060 case 3:
33070 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "3.参考文献を選択":goto Help_Select:
33080 end select
33090 endif
33100 '****************************************************************************************************
33110 'WUXG(1920x1200)の時ここまで
33120 '****************************************************************************************************
33130 endif
33140 endif
33150 'ジョイパッド　右(bg=2) or Enter key (key$=chr$(13))
33160 if ((bg = 2) or (key$ = chr$(13))) then
33170 select case No
33180 case 0:
33190 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 20:goto Suhi_Rule_explainTop: 'Suhi_Rule:
33200 case 1:
33210 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 20:goto Version:
33220 case 2:
33230 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 20:goto References1:
33240 '3:Top画面に行く
33250 case 3:
33260 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:cls 4:goto Main_Screen:
33270 end select
33280 endif
33290 if (bg2 = 2) then
33300 play "":pause 200
33310 play Voice$ + "Voice_Kabara_Help_Top_20230614.mp3"
33320 goto Help_Select:
33330 endif
33340 'ルールの説明　トップ画面
33350 Suhi_Rule_explainTop:
33360 '**********************************************************
33370 cls 3:No=0
33380 play ""
33390 '****************************************************************************************************
33400 'WUXG(1920x1200)の時ここから
33410 '背景画像
33420 '****************************************************************************************************
33430 Font FONT
33440 if ((size(0) <= 1280) and (size(1) <= 800)) then
33450 gload Gazo$ + Gazo_WXGA$ + "Rule_explain_TopScreen_907x680_20240218.png",0,0,0
33460 else
33470 gload Gazo$ + "Rule_explain_TopScreen20240201.png",0,0,0
33480 gload Gazo$ + "downscreen.png",0,0,800
33490 endif
33500 '****************************************************************************************************
33510 'WUXG(1920x1200)の時ここまで
33520 '背景画像
33530 '****************************************************************************************************
33540 if ex_info$(1)<>"JP" then
33550 color rgb(255,255,255)
33560 print chr$(13)+chr$(13)+chr$(13)
33570 print "Please select a number"+chr$(13)
33580 print " :1.How to Kabara" + chr$(13)
33590 print " :2. Explain for BirdseyeGrid" + chr$(13)
33600 print " :3. Return to Top Screen" + chr$(13)
33610 else
33620 '****************************************************************************************************
33630 'WUXG(1920x1200)の時ここから
33640 '****************************************************************************************************
33650 '****************************************************************************************************
33660 'Top画面メニュー表示文字　ここから
33670 '****************************************************************************************************
33680 '***************************************************************************************************
33690 'WXGA(1200x800)の時 ここから
33700 '***************************************************************************************************
33710 if ((size(0) <= 1280) and (size(1) <= 800)) then
33720 color rgb(255,255,255)
33730 locate 1,5
33740 print "番号を選んでください"
33750 locate 1,7:    '〇
33760 print " :1.数秘術のやり方"
33770 locate 1,10:   '〇
33780 print " :2.バーズアイグリットの説明"
33790 locate 1,13:    '〇
33800 print " :3.トップ画面に戻る"
33810 '***************************************************************************************************
33820 'WXGA(1200x800)の時 ここまで
33830 '***************************************************************************************************
33840 else
33850 '***************************************************************************************************
33860 'WXGA(1200x800) 以外の時 ここから
33870 '***************************************************************************************************
33880 color rgb(255,255,255)
33890 print chr$(13)+chr$(13)+chr$(13)
33900 print "番号を選んでください"+chr$(13)
33910 print " :1.数秘術のやり方" + chr$(13)
33920 print " :2.バーズアイグリットの説明" + chr$(13)
33930 print " :3.トップ画面に戻る" + chr$(13)
33940 '***************************************************************************************************
33950 'WXGA(1200x800) 以外の時 ここまで
33960 '***************************************************************************************************
33970 '****************************************************************************************************
33980 'Top画面メニュー表示文字　ここまで
33990 '****************************************************************************************************
34000 endif
34010 '****************************************************************************************************
34020 'WUXG(1920x1200)の時ここまで
34030 '****************************************************************************************************
34040 endif
34050 color rgb(0,0,0)
34060 sp_on 0,1:sp_on 1,0:sp_on 2,0,sp_on 3,0
34070 locate 1,15
34080 print "                                  "
34090 if ex_info$(1) <> "JP" then
34100 print "                                  "
34110 print ":1.How to Kabara"
34120 else
34130 if ((size(0) <= 1280) and (size(1) <= 800)) then
34140 if count=0 then
34150 '****************************************************************************************************
34160 '共通部分 WXGA ここから
34170 '****************************************************************************************************
34180 locate 1,19
34190 print ":1.数秘術のやり方"
34200 '****************************************************************************************************
34210 '共通部分 WXGA ここまで
34220 '****************************************************************************************************
34230 endif
34240 else
34250 if count = 0 then
34260 '****************************************************************************************************
34270 '共通部分 WUXGA ここから
34280 '****************************************************************************************************
34290 locate 1,15
34300 print ":1.数秘術のやり方"
34310 '****************************************************************************************************
34320 '共通部分 WUXGA ここまで
34330 '****************************************************************************************************
34340 endif
34350 endif
34360 init "kb:4"
34370 play Voice$ + "Voice_Kabara_Help_Top_20230614.mp3"
34380 Suhi_Rule_explainTop2:
34390 bg=0:key$="":y=0:bg2=0
34400 while ((key$ <> chr$(31)) and (key$ <> chr$(13)) and (y <> 1) and (y <> -1) and (bg <> 2) and (bg2 <> 2))
34410 y = stick(1)
34420 key$ = inkey$
34430 bg = strig(1)
34440 bg2 = strig(0)
34450 pause 200
34460 wend
34470 if ex_info$(1)<>"JP" then
34480 'Joypad: Down (y=1), Cursor: Down (key$=chr$(31))
34490 if ((y = 1) or (key$ = chr$(31))) then
34500 select case No
34510 case 0:
34520 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print"2. Explain for BirdseyeGrid":goto Suhi_Rule_explainTop2:
34530 case 1:
34540 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "3. Return to Top Screen":goto Suhi_Rule_explainTop2:
34550 case 2:
34560 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "1.How to Kabara":goto Suhi_Rule_explainTop2:
34570 end select
34580 endif
34590 'Joypad: Up (y=-1), Cursor: Up (key$=chr$(30))
34600 if ((y = -1) or (key$ = chr$(30))) then
34610 select case No
34620 case 0:
34630 No=2:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 2,(5,Y+220),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.How to Kabara":goto Suhi_Rule_explainTop2:
34640 case 2:
34650 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(5,Y+120),1,0:beep:pause 200:locate 1,15:print "                                        ":locate 1,15:print "2. Explain for BirdseyeGrid":goto Suhi_Rule_explainTop2:
34660 case 3:
34670 No=0:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 0,(5,Y+20),2,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "3. Return to Top Screen":goto Suhi_Rule_explainTop2:
34680 end select
34690 endif
34700 else
34710 'ジョイパッド：下 (y=1)、カーソル：下 (key$=chr$(31))
34720 '*******************************************************************************************************
34730 'WXGA 1200x 800 日本語
34740 '*******************************************************************************************************
34750 if ((size(0) <= 1280) and (size(1) <= 800)) then
34760 if ((y = 1) or (key$ = chr$(31))) then
34770 select case No
34780 case 0:
34790 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_put 1,(x,Y+120),1,0:beep:gosub Suhi_Rule_Screen_Recheck:pause 200:count=count+1:color rgb(0,0,0):locate 1,19:print "                                      ":locate 1,19:print"2.バーズアイグリットの説明":goto Suhi_Rule_explainTop2:
34800 case 1:
34810 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(X,Y+220),2,0:beep:gosub Suhi_Rule_Screen_Recheck:pause 200:count=count+1:locate 1,19:color rgb(0,0,0):print "                                      ":locate 1,19:print "3.トップ画面に戻る":goto Suhi_Rule_explainTop2:
34820 case 2:
34830 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(X,Y+20),0,0:beep:gosub Suhi_Rule_Screen_Recheck:pause 200:count=count+1:locate 1,19:color rgb(0,0,0):print "                                              ":locate 1,19:print "1.数秘術のやり方を選択":goto Suhi_Rule_explainTop2:
34840 end select
34850 endif
34860 'ジョイパッド：上  (y=-1) 、カーソル上 (key$=chr$(30))
34870 if ((y = -1) or (key$ = chr$(30))) then
34880 select case No
34890 case 0:
34900 No=2:sp_on 1,0:sp_on 0,0:sp_on 2,1:sp_on 0,0:sp_put 2,(5,Y+220),0,0:beep:gosub Suhi_Rule_Screen_Recheck:pause 200:count=count+1:locate 1,19:color rgb(0,0,0):print "                                      ":locate 1,19:print "1.数秘術のやり方":goto Suhi_Rule_explainTop2:
34910 case 1:
34920 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,Y+20),1,0:beep:gosub Suhi_Rule_Screen_Recheck:pause 200:count=count+1:locate 1,19:color rgb(0,0,0):print "                                        ":locate 1,19:print "2.バーズアイグリットの説明を選択":goto Suhi_Rule_explainTop2:
34930 case 2:
34940 No=1:sp_on 1,1:sp_on 1,0:sp_on 0,0:sp_on 2,0:sp_put 1,(5,Y+120),2,0:beep:gosub Suhi_Rule_Screen_Recheck:pause 200:count=count+1:locate 1,19:color rgb(0,0,0):print "                                              ":locate 1,19:print "3.トップ画面に行く":goto Suhi_Rule_explainTop2:
34950 end select
34960 endif
34970 endif
34980 '*******************************************************************************************************
34990 'WXGA 1200x 800 ここまで 日本語
35000 '*******************************************************************************************************
35010 else
35020 '*******************************************************************************************************
35030 'WXGA 1200x 800 以外　ここから
35040 '*******************************************************************************************************
35050 if ((y = 1) or (key$ = chr$(31))) then
35060 select case No
35070 case 0:
35080 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_put 1,(5,400),1,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print"2.バーズアイグリットの説明":goto Suhi_Rule_explainTop2:
35090 case 1:
35100 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),2,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "3.トップ画面に戻る":goto Suhi_Rule_explainTop2:
35110 case 2:
35120 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "1.数秘術のやり方を選択":goto Suhi_Rule_explainTop2:
35130 end select
35140 endif
35150 'ジョイパッド：上  (y=-1) 、カーソル上 (key$=chr$(30))
35160 if ((y = -1) or (key$ = chr$(30))) then
35170 select case No
35180 case 0:
35190 No=0:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.数秘術のやり方":goto Suhi_Rule_explainTop2:
35200 case 1:
35210 No=1:sp_on 2,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 2,(5,500),1,0:beep:pause 200:locate 1,15:print "                                        ":locate 1,15:print "2.バーズアイグリットの説明を選択":goto Suhi_Rule_explainTop2:
35220 case 2:
35230 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 0,(5,300),2,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print "3.トップ画面に行く":goto Suhi_Rule_explainTop2:
35240 end select
35250 endif
35260 endif
35270 '******************************************************************************************************
35280 'WXGA 1200x 800 以外　ここまで
35290 '******************************************************************************************************
35300 endif
35310 'ジョイパッド　右(bg=2) or Enter key (key$=chr$(13))
35320 '*******************************************************************************************************
35330 '決定ボタンを押したときの処理　共通部分　ここから
35340 '********************************************************************************************************
35350 '********************************************************************************************************
35360 'bg:右の丸ボタン　chr$(13):Enter Key
35370 '********************************************************************************************************
35380 if ((bg = 2) or (key$ = chr$(13))) then
35390 select case No
35400 case 0:
35410 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 20:goto Suhi_Rule: ' 1.数秘ルールの説明
35420 case 1:
35430 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 20:goto BirdsEyeGrid_Explain1: '2.バーズアイグリットの説明
35440 '3:Top画面に行く
35450 case 2:
35460 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:cls 4:goto Main_Screen: '3.メイン画面に行く
35470 end select
35480 endif
35490 '********************************************************************************************************
35500 '決定ボタンを押したときの処理　共通部分　ここまで
35510 '*********************************************************************************************************
35520 if (bg2 = 2) then
35530 play "":pause 200
35540 play Voice$ + "Voice_Kabara_Help_Top_20230614.mp3"
35550 goto Suhi_Rule_explainTop2:
35560 endif
35570 '**********************************************************
35580 'バーズアイグリットの説明1
35590 'Help-
35600 '**********************************************************
35610 BirdsEyeGrid_Explain1:
35620 '●.初期設定
35630 cls 3:Font FONT:No=0:bg=0:key$="":bg2=0
35640 play "":'音を停める
35650 'バーズアイグリット基本チャートを表示　　ここから
35660 if ex_info$(1) <> "JP" then
35670 '英語ファイル
35680 else
35690 if ((size(0)<=1280) and (size(1)<=800)) then
35700 gload Gazo$ + Gazo_WXGA$ + "BirdsEyeGrid_Explain1_Chart_907x680_20240219.png",0,0,0
35710 else
35720 '****************************************************************************************************
35730 'WUXG(1920x1200)の時ここから
35740 '****************************************************************************************************
35750 '日本語ファイル
35760 gload Gazo$ + "BirdsEyeGrid_Explain1_Chart_20240202.png",0,0,0
35770 '****************************************************************************************************
35780 'WUXG(1920x1200)の時ここまで
35790 '****************************************************************************************************
35800 endif
35810 'バーズアイグリット基本チャートを表示　　ここまで
35820 endif
35830 'ジョイパッドの右で次へ行く
35840 while ((key$ <> chr$(13)) and (bg <> 2) and (bg2<>2))
35850 key$ = inkey$
35860 bg = strig(1)
35870 bg2 = strig(0)
35880 pause 200
35890 wend
35900 if (bg=2 or key$=chr$(13)) then
35910 'ジョイパッドの右を押した時、もしくはEnterを押したときの処理
35920 'goto バーズアイグリット説明の2番目に行く
35930 end
35940 endif
35950 if (bg2 = 2 or key$ = "") then
35960 'ジョイパッドの左を押した時、もしくはSpaceを押したときの処理
35970 'goto Top画面に行く
35980 goto Main_Screen:
35990 'end
36000 endif
36010 '**********************************************************
36020 'バーズアイグリットの説明2
36030 'Help-
36040 '**********************************************************
36050 BirdsEyeGrid_Explain2:
36060 '●.初期設定
36070 cls 3:Font 48:No = 0:bg = 0:key$ = "":bg2 = 0
36080 play "":'音を停める
36090 'バーズアイグリット基本チャートを表示　　ここから
36100 if ex_info$(1) <> "JP" then
36110 '英語ファイル
36120 else
36130 '日本語ファイル
36140 '****************************************************************************************************
36150 'WUXG(1920x1200)の時ここから
36160 '****************************************************************************************************
36170 gload Gazo$ + "BirdsEyeGrid_Exaple1_Chart_20240202.png",0,0,0
36180 '****************************************************************************************************
36190 'WUXG(1920x1200)の時ここまで
36200 '****************************************************************************************************
36210 'バーズアイグリット基本チャートを表示　　ここまで
36220 endif
36230 'ジョイパッドの右で次へ行く
36240 while ((key$ <> chr$(13)) and (bg <> 2) and (bg2<>2))
36250 key$ = inkey$
36260 bg = strig(1)
36270 bg2 = strig(0)
36280 pause 200
36290 wend
36300 if (bg = 2 or key$ = chr$(13)) then
36310 'ジョイパッドの右を押した時、もしくはEnterを押したときの処理
36320 'goto バーズアイグリット説明の3番目に行く
36330 end
36340 endif
36350 if (bg2 = 2 or key$ = "") then
36360 'ジョイパッドの左を押した時、もしくはSpaceを押したときの処理
36370 'goto Top画面に行く
36380 goto Main_Screen:
36390 'end
36400 endif
36410 '**********************************************************
36420 '数秘術占い　トップ画面
36430 Kabara_TopScreen:
36440 cls 3:play ""
36450 if ((size(0)<=1280) and (size(1)<=800)) then
36460 '***********************************************************
36470 '1280x800ここから
36480 '***********************************************************
36490 gload Gazo$ + Gazo_WXGA$ + "Kabara_TopScreen_853x640_20240223.png",0,0,0
36500 '************************************************************
36510 '1280x800ここまで
36520 '************************************************************
36530 else
36540 '****************************************************************************************************
36550 'WUXG(1920x1200)の時ここから
36560 '****************************************************************************************************
36570 gload Gazo$ + "Kabara_TopScreen20230618.png",0,0,0
36580 gload Gazo$ + "downscreen.png",0,0,800
36590 '****************************************************************************************************
36600 'WUXG(1920x1200)の時ここまで
36610 '****************************************************************************************************
36620 endif
36630 play Voice$ + "KabaraTop_Selection_20230721.mp3"
36640 sp_on 0,1:sp_on  1,0:sp_on 2,0:sp_on 3,0
36650 init"kb:4":No=0
36660 if ex_info$(1)<>"JP" then
36670 color rgb(255,255,255)
36680 print chr$(13)+chr$(13)+chr$(13)
36690 print "Please select a number" + chr$(13)
36700 print " :1.Numerology" + chr$(13)
36710 print " :2.Bird's Eye Grid" + chr$(13)
36720 print " :3.Compatibility Divination" + chr$(13)
36730 print " :4.Return to Top Screen" + chr$(13)
36740 color rgb(0,0,0)
36750 locate 1,15:print "1. Select Numerology"
36760 else
36770 if ((size(0)<=1280) and (size(1)<=800)) then
36780 '***************************************************************************************************
36790 '1280 x800 ここから
36800 '***************************************************************************************************
36810 color rgb(255,255,255):font FONT
36820 locate 1,5
36830 print "番号を選んでください" + chr$(13)
36840 locate 1,7
36850 print " :1.数秘術占い" + chr$(13)
36860 locate 1,10
36870 print " :2.バーズアイグリット" + chr$(13)
36880 locate 1,13
36890 print " :3.相性占い" + chr$(13)
36900 locate 1,16
36910 print " :4.トップ画面に戻る" + chr$(13)
36920 color rgb(0,0,0)
36930 locate 1,18:print "1.数秘術占いを選択"
36940 '***************************************************************************************************
36950 '1280 x800 ここまで
36960 '***************************************************************************************************
36970 else
36980 '****************************************************************************************************
36990 'WUXG(1920x1200)の時ここから
37000 '****************************************************************************************************
37010 color rgb(255,255,255):font FONT
37020 print chr$(13)+chr$(13)+chr$(13)
37030 print "番号を選んでください" + chr$(13)
37040 print " :1.数秘術占い" + chr$(13)
37050 print " :2.バーズアイグリット" + chr$(13)
37060 print " :3.相性占い" + chr$(13)
37070 print " :4.トップ画面に戻る" + chr$(13)
37080 color rgb(0,0,0)
37090 locate 1,15:print "1.数秘術占いを選択"
37100 '****************************************************************************************************
37110 'WUXG(1920x1200)の時ここまで
37120 '****************************************************************************************************
37130 endif
37140 endif
37150 Kabara_TopScreen2:
37160 y = 0:bg = 0:key$ = "":bg2 = 0
37170 while ((y <> 1) and (y <> -1) and (key$ <> chr$(31)) and (key$ <> chr$(30)) and (key$ <> chr$(13)) and (bg <> 2) and (bg2 <> 2))
37180 key$ = inkey$
37190 bg = strig(1)
37200 y = stick(1)
37210 bg2 = strig(0)
37220 pause 200
37230 wend
37240 '選択ボタン
37250 'カーソル下 　と　ジョイパッド　の下
37260 if ex_info$(1)<>"JP" then
37270 if ((y = 1) or (key$ = chr$(31))) then
37280 select case No
37290 case 2:
37300 No=3:sp_on 3,1:sp_on 1,0:sp_on 2,0:sp_on 0,0:sp_put 3,(X,Y+320),0,0:beep:pause 200:locate 1,15:print "                                    ":locate 1,15:print "4.Return to Top Screen":goto Kabara_TopScreen2:
37310 case 3:
37320 No=0:sp_on 0,1:sp_on 2,0:sp_on 1,0:sp_on 3,0:sp_put 0,(X,Y+20),0,0:beep:pause 200: locate 1,15:print"                                      ":locate 1,15:print "1.Select Numerology":goto Kabara_TopScreen2:
37330 case 0:
37340 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(X,Y+120),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.Select Bird's Eye Grid":goto Kabara_TopScreen2:
37350 case 1:
37360 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:sp_on 3,0:sp_put 2,(X,Y+220),0,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print"3.Select Compatibility Divination":goto Kabara_TopScreen2:
37370 end select
37380 endif
37390 else
37400 if ((size(0) <= 1280) and (size(1) <= 800)) then
37410 '******************************************************************************************************
37420 '1280x800ここから
37430 '*****************************************************************************************************
37440 if ((y = 1) or (key$ = chr$(31))) then
37450 select case No
37460 case 2:
37470 No=3:sp_on 3,1:sp_on 1,0:sp_on 2,0:sp_on 0,0:sp_put 3,(X,Y+320),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                    ":locate 1,18:print "4.トップ画面に戻るを選択":goto Kabara_TopScreen2:
37480 case 3:
37490 No=0:sp_on 0,1:sp_on 2,0:sp_on 1,0:sp_on 3,0:sp_put 0,(X,Y+20),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0): locate 1,18:print"                                      ":locate 1,18:print "1.数秘術占いを選択":goto Kabara_TopScreen2:
37500 case 0:
37510 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(X,Y+120),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                      ":locate 1,18:print "2.バーズアイグリッドを選択":goto Kabara_TopScreen2:
37520 case 1:
37530 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:sp_on 3,0:sp_put 2,(X,Y+220),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                              ":locate 1,18:print"3.相性占いを選択":goto Kabara_TopScreen2:
37540 end select
37550 endif
37560 'カーソル　上  or  ジョイパッド　上
37570 if ((y=-1) or (key$=chr$(30))) then
37580 select case No
37590 case 0:
37600 No=3:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,1:sp_put 3,(X,Y+320),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                      ":locate 1,18:print "4.トップ画面に戻るを選択":goto Kabara_TopScreen2:
37610 case 1:
37620 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(X,Y+20),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                      ":locate 1,18:print "1.数秘術占いを選択":goto Kabara_TopScreen2:
37630 case 2:
37640 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(X,Y+120),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                      ":locate 1,18:print "2.バーズアイグリッドを選択":goto Kabara_TopScreen2:
37650 case 3:
37660 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(X,Y+220),0,0:beep:gosub Kabara_TopScreen_Recheck:pause 200:color rgb(0,0,0):locate 1,18:print "                                       ":locate 1,18:print"3.相性占いを選択":goto Kabara_TopScreen2:
37670 end select
37680 endif
37690 '*****************************************************************************************************
37700 '1280 x800 ここまで
37710 '******************************************************************************************************
37720 else
37730 '******************************************************************************************************
37740 '1920x1280 ここから
37750 '******************************************************************************************************
37760 if ((y = 1) or (key$ = chr$(31))) then
37770 select case No
37780 case 2:
37790 No=3:sp_on 3,1:sp_on 1,0:sp_on 2,0:sp_on 0,0:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                    ":locate 1,15:print "4.トップ画面に戻るを選択":goto Kabara_TopScreen2:
37800 case 3:
37810 No=0:sp_on 0,1:sp_on 2,0:sp_on 1,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200: locate 1,15:print"                                      ":locate 1,15:print "1.数秘術占いを選択":goto Kabara_TopScreen2:
37820 case 0:
37830 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.バーズアイグリッドを選択":goto Kabara_TopScreen2:
37840 case 1:
37850 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:sp_on 3,0:sp_put 2,(5,500),0,0:beep:pause 200:locate 1,15:print "                                              ":locate 1,15:print"3.相性占いを選択":goto Kabara_TopScreen2:
37860 end select
37870 endif
37880 'カーソル　上  or  ジョイパッド　上
37890 if ((y=-1) or (key$=chr$(30))) then
37900 select case No
37910 case 0:
37920 No=3:sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,1:sp_put 3,(5,600),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "4.トップ画面に戻るを選択":goto Kabara_TopScreen2:
37930 case 1:
37940 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_put 0,(5,300),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.数秘術占いを選択":goto Kabara_TopScreen2:
37950 case 2:
37960 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:sp_on 3,0:sp_put 1,(5,400),0,0:beep:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.バーズアイグリッドを選択":goto Kabara_TopScreen2:
37970 case 3:
37980 No=2:sp_on 2,1:sp_on 1,0:sp_on 0,0:sp_on 3,0:sp_put 2,(5,500),0,0:beep:pause 200:locate 1,15:print "                                       ":locate 1,15:print"3.相性占いを選択":goto Kabara_TopScreen2:
37990 end select
38000 endif
38010 endif
38020 '******************************************************************************************************
38030 '1920x 1280 ここまで
38040 '******************************************************************************************************
38050 endif
38060 '決定ボタン
38070 'ジョイパッドの右　or  Enter key
38080 if ((bg = 2) or (key$ = chr$(13))) then
38090 select case No
38100 case 0:
38110 '1.数秘術占い
38120 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:goto Input_Seireki:
38130 case 3:
38140 '4.メイン画面にいく
38150 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:sp_on 1,0:goto Main_Screen:
38160 case 1:
38170 '2.バースアイグリッド
38180 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:pause 200:goto Input_name1_Birdseye:
38190 case 2:
38200 '3.相性占い
38210 sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:goto Kabara_Aishou_Top:
38220 end select
38230 endif
38240 if (bg2 = 2) then
38250 play "":pause 200
38260 play Voice$ + "Voice_Kabara_Top_20230621.mp3"
38270 goto Kabara_TopScreen2:
38280 endif
38290 '1.バースアイグリット　名入力
38300 Inputname1:
38310 cls 3:init"kb:4":
38320 '****************************************************************************************************
38330 'WUXG(1920x1200)の時ここから
38340 '****************************************************************************************************
38350 font 48
38360 bg=0:key$="":y=0:No=-1:name1$="":i=1
38370 gload Gazo$ + "Selection.png",1,10,100
38380 'Line 1:☓
38390 'A:選択肢
38400 sp_def 15,(50,250),16,16
38410 'B:選択肢
38420 sp_def 16,(200,250),16,16
38430 'C:選択肢
38440 sp_def 17,(350,250),16,16
38450 'D:選択肢
38460 sp_def 18,(500,250),16,16
38470 'E:選択肢
38480 sp_def 19,(630,250),16,16
38490 'F:選択肢
38500 sp_def 20,(780,250),16,16
38510 'G:選択肢
38520 sp_def 21,(930,250),16,16
38530 'Line 2:☓
38540 'H:選択肢
38550 sp_def 22,(50,345),16,16
38560 'I:選択肢
38570 sp_def 23,(200,345),16,16
38580 'J:選択肢
38590 sp_def 24,(350,345),16,16
38600 'K:選択肢
38610 sp_def 25,(500,345),16,16
38620 'L:選択肢
38630 sp_def 26,(630,345),16,16
38640 'M:選択肢
38650 sp_def 27,(780,345),16,16
38660 'N:選択肢
38670 sp_def 28,(930,345),16,16
38680 'Line 3:☓
38690 'O:選択肢
38700 sp_def 29,(50,440),16,16
38710 'P:選択肢
38720 sp_def 30,(200,440),16,16
38730 'Q:選択肢
38740 sp_def 31,(350,440),16,16
38750 'R:選択肢
38760 sp_def 32,(500,440),16,16
38770 'S:選択肢
38780 sp_def 33,(630,440),16,16
38790 'T:選択肢
38800 sp_def 34,(780,440),16,16
38810 'U:選択肢
38820 sp_def 35,(930,440),16,16
38830 'Line 4:◯
38840 'V:選択肢
38850 sp_def 36,(50,535),16,16
38860 'W:選択肢
38870 sp_def 37,(200,535),16,16
38880 'X:選択肢
38890 sp_def 38,(350,535),16,16
38900 'Y:選択肢
38910 sp_def 39,(500,535),16,16
38920 'Z:選択肢
38930 sp_def 40,(630,535),16,16
38940 'Ok:選択肢
38950 sp_def 41,(780,535),16,16
38960 'sp_def 42,(930,535),16,16
38970 'Line 1
38980 'A
38990 sp_on 15,0
39000 'B
39010 sp_on 16,0
39020 'C
39030 sp_on 17,0
39040 'D
39050 sp_on 18,0
39060 'E
39070 sp_on 19,0
39080 'F
39090 sp_on 20,0
39100 'G
39110 sp_on 21,0
39120 'Line 1
39130 'Line 2
39140 'H
39150 sp_on 22,0
39160 'I
39170 sp_on 23,0
39180 'J
39190 sp_on 24,0
39200 'K
39210 sp_on 25,0
39220 'L
39230 sp_on 26,0
39240 'M
39250 sp_on 27,0
39260 'N
39270 sp_on 28,0
39280 'Line 2
39290 'Line 3
39300 'O
39310 sp_on 29,0
39320 'P
39330 sp_on 30,0
39340 'Q
39350 sp_on 31,0
39360 'R
39370 sp_on 32,0
39380 'S
39390 sp_on 33,0
39400 'T
39410 sp_on 34,0
39420 'U
39430 sp_on 35,0
39440 'Line 3
39450 'Line 4
39460 'V
39470 sp_on 36,0
39480 'W
39490 sp_on 37,0
39500 'X
39510 sp_on 38,0
39520 'Y
39530 sp_on 39,0
39540 'Z
39550 sp_on 40,0
39560 'Ok
39570 sp_on 41,1
39580 '****************************************************************************************************
39590 'WUXG(1920x1200)の時ここまで
39600 '****************************************************************************************************
39610 'Line 4
39620 'sp_on 42,1
39630 'Line 1
39640 'sp_put 15,(50,250),0,0
39650 'sp_put 16,(200,250),0,0
39660 'sp_put 17,(350,250),0,0
39670 'sp_put 18,(500,250),0,0
39680 'sp_put 19,(630,250),0,0
39690 'sp_put 20,(780,250),0,0
39700 'sp_put 21,(930,250),0,0
39710 'Line 2
39720 'sp_put 22,(50,345),0,0
39730 'sp_put 23,(200,345),0,0
39740 'sp_put 24,(350,345),0,0
39750 'sp_put 25,(500,345),0,0
39760 'sp_put 26,(630,345),0,0
39770 'sp_put 27,(780,345),0,0
39780 'sp_put 28,(930,345),0,0
39790 'Line 3
39800 'sp_put 29,(50,440),0,0
39810 'sp_put 30,(200,440),0,0
39820 'sp_put 31,(350,440),0,0
39830 'sp_put 32,(500,440),0,0
39840 'sp_put 33,(630,440),0,0
39850 'sp_put 34,(780,440),0,0
39860 'sp_put 35,(930,440),0,0
39870 'Line 4
39880 'sp_put 36,(50,535),0,0
39890 'sp_put 37,(200,535),0,0
39900 'sp_put 38,(350,535),0,0
39910 'sp_put 39,(500,535),0,0
39920 'sp_put 40,(630,535),0,0
39930 sp_put 41,(780,535),0,0
39940 'sp_put 42,(930,536),0,0
39950 gload Gazo$ + "Screen1.png",0,0,0
39960 color rgb(255,255,255)
39970 locate 1,3
39980 print "名前の姓をアルファベットで入力してください"
39990 locate 1,5
40000 print " A  B  C  D  E  F  G"
40010 locate 1,7
40020 print " H  I  J  K  L  M  N"
40030 locate 1,9
40040 print " O  P  Q  R  S  T  U"
40050 locate 1,11
40060 print " V  W  X  Y  Z":locate 17,11:color rgb(255,0,0):print "Ok"
40070 locate 1,15:color rgb(0,0,0)
40080 print "名前の姓:" + name1$
40090 select_name1:
40100 bg = 0:y = 0:key$ = "":y2=0:init"kb:4":
40110 '有効ボタン
40120 '1.決定ボタン(bg:2)
40130 '2.Enter Key$:chr$(13)
40140 '3.カーソル上 (chr$(31))
40150 '4.カーソル　左 (chr$(29))
40160 '5.ジョイパッド　上 (y:1)
40170 '6:ジョイパッド　左 (y2:-1)
40180 '7:ジョイパッド　下 (y:-1)
40190 while ((bg <> 2) and (key$ <> chr$(13)) and (y <> -1) and (y <> 1) and (key$ <> chr$(31)) and (y2 <> -1) and (key$ <> chr$(29)))
40200 key$ = inkey$
40210 'ジョイパッドの決定:bg
40220 bg = strig(1)
40230 y = stick(1)
40240 y2 = stick(0)
40250 pause 200
40260 wend
40270 '====================================
40280 'Birds Eye Grid 名前入力
40290 '入力スタイル　アルファベット入力
40300 'sp_on:　スプライトのオンオフ
40310 'sp_put :表示位置
40320 'No:ボタン番号
40330 '====================================
40340 'カーソルで下に行く
40350 if ((y=-1) or (key$=chr$(31))) then
40360 select case No
40370 '1.Ok ボタン
40380 'sp_on スプライトのオンオフ
40390 'sp_put スプライトを表示
40400 case -1:
40410 '1.アルファベット　入力ボタン
40420 '実装未完全なので終了
40430 'Ok → T ○ :No:20=T
40440 No=20:sp_on 41,0:sp_on 34,1:sp_put 34,(780,440),0,0:goto select_name1:
40450 'T  → M ○
40460 case 20:
40470 No = 13:sp_on 34,0:sp_on 27,1:sp_put 27,(780,345),0,0:goto select_name1:
40480 'M  →　F ○
40490 case 13:
40500 No = 6:sp_on 27,0:sp_on 20,1:sp_put 20,(780,250),0,0:goto select_name1:
40510 'F  → Ok
40520 case 6:
40530 No=-1:sp_on 20,0:sp_on 41,1:sp_put 41,(780,535),0,0:goto select_name1:
40540 end select
40550 endif
40560 '2.決定ボタン
40570 if ((key$ = chr$(13)) OR  (bg = 2)) then
40580 select case No
40590 case -1:
40600 'スプライトをOFFにする
40610 sp_on 41,0
40620 end select
40630 endif
40640 '3.カーソル　左
40650 if (key$ = chr$(29) or (y2 =-1)) then
40660 select case No
40670 'Line 4
40680 'Line 4
40690 '1.
40700 'Z:-1 :Ok ボタン
40710 'Ok → Z
40720 case -1:
40730 'Ok →　Z
40740 'Ok ボタン OFF,Z Button ON
40750 'No=26:Z
40760 No = 26:sp_on 41,0:sp_on 40,1:sp_put 40,(630,535),0,0:goto select_name1:
40770 '2.
40780 '26:Zボタン Z→ Y
40790 case 26:
40800 No=25:sp_on 40,0:sp_on 39,1:sp_put 39,(500,535),0,0:goto select_name1:
40810 '3.
40820 '25:Yボタン  Y → X
40830 case 25:
40840 No=24:sp_on 39,0:sp_on 38,1:sp_put 38,(350,535),0,0:goto select_name1:
40850 '4
40860 '24:Xボタン X → W
40870 case 24:
40880 No=23:sp_on 38,0:sp_on 37,1:sp_put 37,(200,535),0,0:goto select_name1:
40890 '23:Wボタン X → W
40900 '5
40910 case 23:
40920 '22:Vボタン W → V
40930 No=22:sp_on 37,0:sp_on 36,1:sp_put 36,(50,535),0,0:goto select_name1:
40940 case 22:
40950 '-1:V→ Ok
40960 No=-1:sp_on 36,0:sp_on 41,1:sp_put 41,(780,535),0,0:goto select_name1:
40970 'Line 3
40980 case 20:
40990 '33:T34  → S:33 :◯
41000 No=19:sp_on 34,0:sp_on 33,1:sp_put 33,(630,440),0,0:goto select_name1:
41010 case 19:
41020 '32:S:33 → R:32 :◯
41030 No=18:sp_on 33,0:sp_on 32,1:sp_put 32,(500,440),0,0:goto select_name1:
41040 case 18:
41050 '31:R:32 → Q:31 :◯
41060 No=17:sp_on 32,0:sp_on 31,1:sp_put 31,(350,440),0,0:goto select_name1:
41070 '30:O → P :◯
41080 case 17:
41090 '30:Q:31 → P:30 :◯
41100 No=16:sp_on 31,0:sp_on 30,1:sp_put 30,(200,440),0,0:goto select_name1:
41110 case 16:
41120 '29:P:30 → O:29 :◯
41130 No=15:sp_on 30,0:sp_on 29,1:sp_put 29,(50,440),0,0:goto select_name1:
41140 case 15:
41150 '28:O:29 → U:21  :◯
41160 'O:OFF,U:ON
41170 No=21:sp_on 29,0:sp_on 35,1:sp_put 35,(930,440),0,0:goto select_name1:
41180 '27:U:21 → T:20  :◯
41190 case 21:
41200 'U:OFF:T:ON
41210 No=20:sp_on 35,0:sp_on  34,1:sp_put 34,(780,440),0,0:goto select_name1:
41220 'Line 2
41230 '26:M:13 → L:12 : ○
41240 case 13:
41250 'M:OFF,L:ON
41260 No=12:sp_on 27,0:sp_on 26,1:sp_put 26,(630,345),0,0:goto select_name1:
41270 '25:L:12 → K:11 : ○
41280 case 12:
41290 No=11:sp_on 26,0:sp_on 25,1:sp_put 25,(500,345),0,0:goto select_name1:
41300 '24:K:11 → J:10 : ○
41310 case 11:
41320 No=10:sp_on 25,0:sp_on 24,1:sp_put 24,(350,345),0,0:goto select_name1:
41330 '23:J:10 → I:9  : ○
41340 case 10:
41350 No=9:sp_on 24,0:sp_on 23,1:sp_put 23,(200,345),0,0:goto select_name1:
41360 '22:I:9 → H:8    :○
41370 case 9:
41380 No=8:sp_on 23,0:sp_on 22,1:sp_put 22,(50,345),0,0:goto select_name1:
41390 '21:H:8 → N:14:   :○
41400 case 8:
41410 No=14:sp_on 22,0:sp_on 28,1:sp_put 28,(930,345),0,0:goto select_name1:
41420 '20:N:14 → M:13:   :○
41430 case 14:
41440 No=6:sp_on 28,0:sp_on 27,1:sp_put 27,(780,345),0,0:goto select_name1:
41450 '●.Line 1:
41460 '19:F:20 → E:19 : ☓
41470 'F:OFF,E:ON
41480 case 6:
41490 No = 5:sp_on 20,0:sp_on 19,1:sp_put 19,(630,250),0,0:goto select_name1:
41500 '18:E → D
41510 'E:OFF,D:ON
41520 case 5:
41530 No=4:sp_on 19,0:sp_on 18,1:sp_put 18,(500,250),0,0:goto select_name1:
41540 '17:D → C
41550 'D:OFF,C:ON
41560 case 4:
41570 No=3:sp_on 18,0:sp_on 17,1:sp_put 17,(350,250),0,0:goto select_name1:
41580 case 3:
41590 No=2:sp_on 17,0:sp_on 16,1:sp_put 16,(200,250),0,0:goto select_name1:
41600 case 2:
41610 No=1:sp_on 16,0:sp_on 15,1:sp_put 15,(50,250),0,0:goto select_name1:
41620 case 1:
41630 No=7:sp_on 15,0:sp_on 21,1:sp_put 21,(930,250),0,0:goto select_name1:
41640 case 7:
41650 No=6:sp_on 21,0:sp_on 20,1:sp_put 20,(780,250),0,0:goto select_name1:
41660 end select
41670 endif
41680 '上から下の方向
41690 if ((key$ = chr$(31)) or  (y = 1)) then
41700 select case No
41710 '●.1
41720 '1:A→H
41730 case 1:
41740 No=8:sp_on 15,0:sp_on 22,1:sp_put 22,(50,345),0,0:goto select_name1:
41750 '2:H→O
41760 case 8:
41770 No=15:sp_on 22,0:sp_on 29,1:sp_put 29,(50,440),0,0:goto select_name1:
41780 '3:O→V
41790 case 15:
41800 No=22:sp_on 29,0:sp_on 36,1:sp_put 36,(50,535),0,0:goto select_name1:
41810 '4:V→A
41820 case 22:
41830 No=1:sp_on 36,0:sp_on 15,1:sp_put 15,(50,250),0,0:goto select_name1:
41840 '●.2
41850 '5.B→I
41860 case 2:
41870 No=9:sp_on 16,0:sp_on 23,1:sp_put 23,(200,345),0,0:goto select_name1:
41880 '6.I→P
41890 case 9:
41900 No=16:sp_on 23,0:sp_on 30,1:sp_put 30,(200,440),0,0:goto select_name1:
41910 '7.P→W
41920 case 16:
41930 No=23:sp_on 30,0:sp_on 37,1:sp_put 37,(200,535),0,0:goto select_name1:
41940 '8.W→B
41950 case 23:
41960 No=2:sp_on 37,0:sp_on 16,1:sp_put 16,(200,250),0,0:goto select_name1:
41970 '●.3
41980 '9.C→J
41990 case 3:
42000 No=10:sp_on 17,0:sp_on 24,1:Sp_put 24,(350,345),0,0:goto select_name1:
42010 '10.J→Q
42020 case 10:
42030 No=17:sp_on 24,0:sp_on 31,1:sp_put 31,(350,440),0,0:goto select_name1:
42040 '11.Q→X
42050 case 17:
42060 No=24:sp_on 31,0:sp_on 38,1:sp_put 38,(350,535),0,0:goto select_name1:
42070 '12.X→C
42080 case 24:
42090 No=3:sp_on 38,0:sp_on 17,1:sp_put 17,(350,250),0,0:goto select_name1:
42100 '●.4
42110 '13.D→K
42120 case 4:
42130 No=11:sp_on 18,0:sp_on 25,1:sp_put 25,(500,345),0,0:goto select_name1:
42140 '14.K→R
42150 case 11:
42160 No=18:sp_on 25,0:sp_on 32,1:sp_put 32,(500,440),0,0:goto select_name1:
42170 '15.R→Y
42180 case 18:
42190 No=25:sp_on 32,0:sp_on 39,1:sp_put 39,(500,535),0,0:goto select_name1:
42200 '16.Y→D
42210 case 25:
42220 No=4:sp_on 39,0:sp_on 18,1:sp_put 18,(500,250),0,0:goto select_name1:
42230 '●.5
42240 '17.E→L
42250 case 5:
42260 No=12:sp_on 19,0:sp_on 26,1:sp_put 26,(630,345),0,0:goto select_name1:
42270 '18.L→S
42280 case 12:
42290 No=19:sp_on 26,0:sp_on 33,1:sp_put 33,(630,440),0,0:goto select_name1:
42300 '19.S→Z
42310 case 19:
42320 No=26:sp_on 33,0:sp_on 40,1:sp_put 40,(630,535),0,0:goto select_name1:
42330 '20.Z→E
42340 case 26:
42350 No=5:sp_on 40,0:sp_on 19,1:sp_put 19,(630,250),0,0:goto select_name1:
42360 '●.6
42370 '21.F→M
42380 case 6:
42390 No=13:sp_on 20,0:sp_on 27,1:sp_put 27,(780,345),0,0:goto select_name1:
42400 '22.M→T
42410 case 13:
42420 No=20:sp_on 27,0:sp_on 34,1:sp_put 34,(780,440),0,0:goto select_name1:
42430 '23.T→Ok
42440 case 20:
42450 No=-1:sp_on 34,0:sp_on 41,1:sp_PUT 41,(780,535),0,0:goto select_name1:
42460 '24.Ok→F
42470 case -1:
42480 No=6:sp_on 41,0:sp_on 20,1:sp_put 20,(780,250),0,0:goto select_name1:
42490 '●.7
42500 '25.G→N
42510 case 7:
42520 No=14:sp_on 21,0:sp_on 28,1:sp_put 28,(930,345),0,0:goto select_name1:
42530 '26.N→U
42540 case 14:
42550 No=21:sp_on 28,0:sp_on 35,1:sp_PUT 35,(930,440),0,0:goto select_name1:
42560 '27.U→G
42570 case 21:
42580 No=7:sp_on 35,0:sp_on 21,1:sp_put 21,(930,250),0,0:goto select_name1:
42590 end select
42600 endif
42610 '決定ボタン　で名前の姓に文字を追加。
42620 if (key$ = chr$(13) or bg = 2) then
42630 select case No
42640 'Okボタン
42650 case -1:
42660 goto Inputname2:
42670 'Aの文字
42680 case 1:
42690 'if len(n$)=0 then
42700 n$=String$(i,"A"):name1$=n$:locate 1,15:print "                       ":locate 1,15:print "名前の姓:" +name1$:i=i+1:
42710 'else
42720 'name1$=Mid$("A",i,i+1):locate 1,15:print "                                      ":locate 1,15:print "名前の姓:"+name1$:i=i+1
42730 'endif
42740 goto select_name1:
42750 case 2:
42760 n$=String$(i,"B"):name1$=n$:locate 1,15:print "                                     ":locate 1,15:print "名前の姓:"+name1$:i=i+1:goto select_name1:
42770 end select
42780 endif
42790 Input_name1_Birdseye:
42800 cls 3:init "kb:2":play ""
42810 gload Gazo$ + "Input_Birtheye2.png",0,0,0
42820 if ex_info$(1)<>"JP" then
42830 play Voice$ + "Birdseyegrid_InputName1_20231120.mp3"
42840 color rgb(0,0,255)
42850 locate 1,2:print "Please enter your name in English"
42860 color rgb(0,0,0)
42870 locate 1,5:Input "Name (Surname):",name1$
42880 else
42890 '****************************************************************************************************
42900 '共通部分　ここから
42910 '****************************************************************************************************
42920 play Voice$ + "Birdseyegrid_InputName1_20231120.mp3"
42930 color rgb(0,0,255)
42940 locate 1,2:print "名前をアルファベットで入れてください"
42950 color rgb(0,0,0)
42960 locate 1,5:Input "名前（姓の部分）:",name1$
42970 '****************************************************************************************************
42980 '共通部分　ここまで
42990 '****************************************************************************************************
43000 endif
43010 '27.U→G
43020 'locate 1,5:print "Hit any key"
43030 n1 = len(name1$)
43040 if (n1 < 11) then
43050 for i=1 to n1
43060 buf_name1$(i-1) = Mid$(ucase$(name1$),i,1)
43070 next i
43080 endif
43090 goto Inputname2:
43100 '2.グリッドアイ　姓の入力
43110 'end
43120 Inputname2:
43130 cls 3:init"kb:2":font 48:play ""
43140 gload Gazo$ + "Input_Birtheye1.png",0,0,0
43150 if ex_info$(1)<>"JP" then
43160 play Voice$ + "Birdseyegrid_InputName2_20231120.mp3"
43170 color rgb(0,0,255)
43180 locate 1,2:print "Please enter your name in English"
43190 color rgb(0,0,0)
43200 locate 1,5:Input "Name (First name):",name2$
43210 n2 = len(name2$)
43220 for i=1 to n2
43230 buf_name2$(i-1) = Mid$(ucase$(name2$),i,1)
43240 next i
43250 else
43260 '****************************************************************************************************
43270 '共通部分　ここから
43280 '****************************************************************************************************
43290 play Voice$ + "Birdseyegrid_InputName2_20231120.mp3"
43300 color rgb(0,0,255)
43310 locate 1,2:print "名前をアルファベットで入れてください"
43320 color rgb(0,0,0)
43330 locate 1,5:Input "名前(名の部分):",name2$
43340 n2 = len(name2$)
43350 for i=1 to n2
43360 buf_name2$(i-1) = Mid$(ucase$(name2$),i,1)
43370 next i
43380 '****************************************************************************************************
43390 '共通部分　ここまで
43400 '****************************************************************************************************
43410 endif
43420 '****************************************************************************************************
43430 '計算領域　ここから
43440 '****************************************************************************************************
43450 Complate:
43460 'name1
43470 for i=0 to 25
43480 for n=1 to len(name1$)
43490 if (buf_chart$(i,0) = buf_name1$(n-1)) then
43500 b = val(buf_chart$(i,1))
43510 buffer(b-1) = buffer(b-1) + 1
43520 endif
43530 next n
43540 next i
43550 'name2
43560 for i=0 to 25
43570 for n=1 to len(name2$)
43580 if (buf_chart$(i,0) = buf_name2$(n-1)) then
43590 c = val(buf_chart$(i,1))
43600 buffer(c - 1) = buffer(c - 1) + 1
43610 endif
43620 next n
43630 next i
43640 '****************************************************************************************************
43650 '計算領域 ここまで
43660 '****************************************************************************************************
43670 '****************************************************************************************************
43680 '結果表示領域
43690 '****************************************************************************************************
43700 Result_Birtheye1:
43710 cls 3:init"kb:4":No=0:play "":'音を止める
43720 '****************************************************************************************************
43730 '1280x800　ここから
43740 '****************************************************************************************************
43750 if ((size(0) <= 1280) and (size(1) <= 800)) then
43760 gload Gazo$ + Gazo_WXGA$ + "Result_Birtheye1_907x640_20240223.png",0,0,0
43770 '****************************************************************************************************
43780 '1280x800　ここまで
43790 '****************************************************************************************************
43800 else
43810 '****************************************************************************************************
43820 '1920x1280　ここから
43830 '****************************************************************************************************
43840 gload Gazo$ + "Result_Birtheye1_20230630.png",0,0,0
43850 gload Gazo$ + "downscreen.png",0,0,800
43860 '****************************************************************************************************
43870 '1920x1280　ここまで
43880 '****************************************************************************************************
43890 endif
43900 play Voice$ + "Result_Birdseyegrid_20231120.mp3"
43910 color rgb(255,255,255)
43920 '1の表示
43930 locate 3,14:print buffer(0);
43940 '2の表示
43950 locate 3,9:print buffer(1);
43960 '3の表示
43970 locate 3,5:print buffer(2);
43980 '4の表示
43990 locate 10,14:print buffer(3);
44000 '5の表示
44010 locate 10,9:print buffer(4);
44020 '6の表示
44030 locate 10,5:print buffer(5);
44040 '7の表示
44050 locate 15,14:print buffer(6);
44060 '8の表示
44070 locate 15,9:print buffer(7);
44080 '9の表示
44090 locate 15,5:print buffer(8);
44100 'name を大文字に変換
44110 locate 5,3:print ucase$(name1$ + name2$)
44120 color rgb(0,0,0)
44130 'bg:右のボタン  ,bg2:左のボタン
44140 if ex_info$(1)<>"JP" then
44150 color rgb(255,255,255)
44160 print "Left circle: Main Screen, Right circle: Open Menu"
44170 else
44180 locate 0,15:print "左の丸:メイン画面,右の丸：メニューを開く"
44190 endif
44200 bg=0:key$="":bg2=0
44210 while ((bg <> 2) and (key$ <> chr$(13)) and (bg2 <> 2))
44220 'Enterと決定ボタン
44230 key$ = inkey$
44240 '右ボタン:1
44250 bg = strig(1)
44260 '左の丸ボタン:0
44270 bg2=strig(0)
44280 pause 200
44290 wend
44300 if ((bg=2) or (key$=chr$(13))) then
44310 'データーをクリアしてトップ画面に行く
44320 'for i=0 to 8
44330 'buffer(i)=0
44340 'next i
44350 'for n=0 to 9
44360 'buf_name1$(n) = ""
44370 'buf_name2$(n) = ""
44380 'next n
44390 'Topに行く
44400 'goto Main_Screen:
44410 'メニューを開く
44420 'goto BirdsEye_Result2:
44430 'Menu(ui_select) リストに飛ぶ
44440 goto Result_Birtheye_List1:
44450 endif
44460 if (bg2=2) then
44470 'データーをクリアする
44480 for i=0 to 8
44490 buffer(i)=0
44500 next i
44510 for n=0 to 9
44520 buf_name1$(n)=""
44530 buf_name2$(n)=""
44540 next n
44550 goto Main_Screen:
44560 endif
44570 'goto Result_Birtheye1:
44580 'Result_Birtheye2:
44590 'cls 3:color rgb(255,255,255)
44600 'end
44610 'Memory 消去
44620 '****************************************************************************************************
44630 '結果表示領域　ここまで
44640 '****************************************************************************************************
44650 '横のフォーカスライン
44660 BirdsEye_Result2:
44670 cls 3:init"kb:4":No = 0:bg = 0:key$ = "":bg2 = 0
44680 if ((buffer(2) > 0) and (buffer(5) > 0) and  (buffer(8) >  0)) then
44690 Forcus1_buffer$(2)="○"
44700 else
44710 Forcus1_buffer$(2)="☓"
44720 endif
44730 if ((buffer(1) > 0 ) and  (buffer(4) > 0) and   (buffer(7) > 0)) then
44740 Forcus1_buffer$(1)="○"
44750 else
44760 Forcus1_buffer$(1) = "☓"
44770 endif
44780 if ((buffer(0) > 0) and (buffer(3) > 0) and (buffer(6) > 0)) then
44790 Forcus1_buffer$(0)="○"
44800 else
44810 Forcus1_buffer$(0)="☓"
44820 endif
44830 gload Gazo$ + "Screen1.png",0,0,0
44840 if ex_info$(1)<>"JP" then
44850 color rgb(255,0,0):
44860 locate 1,1
44870 print "Bird's Eye Grid (Focus Line 1)"
44880 color rgb(255,255,255)
44890 locate 1,3:
44900 print "●. Horizontal Focus Line"
44910 locate 1,5
44920 print "1. Sharp Line:"+Forcus1_buffer$(2)
44930 locate 1,7
44940 print "2. Mediator Line:"+Forcus1_buffer$(1)
44950 locate 1,9
44960 print "3. Steady Line:"+Forcus1_buffer$(0)
44970 color rgb(0,0,0)
44980 locate 0,15:print "Right circle: Next, Left circle: Diagnose again "
44990 else
45000 color rgb(255,0,0):
45010 locate 1,1
45020 print "バーズアイグリッド(フォーカスライン1)"
45030 color rgb(255,255,255)
45040 locate 1,3:
45050 print "●.横のフォーカスライン"
45060 locate 1,5
45070 print "1.切れ者ライン:"+Forcus1_buffer$(2)
45080 locate 1,7
45090 print "2.調停者ライン:"+Forcus1_buffer$(1)
45100 locate 1,9
45110 print "3.しっかり者ライン:"+Forcus1_buffer$(0)
45120 color rgb(0,0,0)
45130 locate 0,15:print "右の丸:次へ,左の丸：もう一度診断 "
45140 endif
45150 while (key$ <> chr$(13) and bg <> 2 and bg2 <> 2 )
45160 key$ = inkey$
45170 bg = strig(1)
45180 bg2 = strig(0)
45190 pause 200
45200 wend
45210 if ((bg=2) or (key$=chr$(13))) then
45220 goto BirdsEye_Result3:
45230 endif
45240 if (bg2=2) then
45250 for i=0 to 8
45260 buffer(i)=0
45270 next i
45280 goto Main_Screen:
45290 endif
45300 BirdsEye_Result3:
45310 cls 3:init"kb:4":bg=0:bg2=0:key$="":No=0
45320 if ((buffer(2) > 0) and (buffer(1) > 0) and  (buffer(0) >  0)) then
45330 Forcus2_buffer$(2)="○"
45340 else
45350 Forcus2_buffer$(2)="☓"
45360 endif
45370 if ((buffer(5) > 0 ) and  (buffer(4) > 0) and   (buffer(3) > 0)) then
45380 Forcus2_buffer$(1)="○"
45390 else
45400 Forcus2_buffer$(1) = "☓"
45410 endif
45420 if ((buffer(8) > 0) and (buffer(7) > 0) and (buffer(6) > 0)) then
45430 Forcus2_buffer$(0)="○"
45440 else
45450 Forcus2_buffer$(0)="☓"
45460 endif
45470 gload Gazo$ + "Screen1.png",0,0,0
45480 if ex_info$(1)<>"JP" then
45490 color rgb(255,0,0):
45500 locate 1,1
45510 print "Bird's Eye Grid (Focus Line 2)"
45520 color rgb(255,255,255)
45530 locate 1,3
45540 print "●. Vertical Focus Line"
45550 locate 1,5
45560 print "1. Expresser Line:" + Forcus2_buffer$(2)
45570 locate 1,7
45580 print "2. Commander Line:" + Forcus2_buffer$(1)
45590 locate 1,9
45600 print "3. Leader Line:" + Forcus2_buffer$(0)
45610 color rgb(0,0,0)
45620 locate 0,15:print "Right circle: Next, Left circle: Retest "
45630 else
45640 '****************************************************************************************************
45650 'WUXG(1920x1200)の時ここから
45660 '****************************************************************************************************
45670 color rgb(255,0,0):
45680 locate 1,1
45690 print "バーズアイグリッド(フォーカスライン2)"
45700 color rgb(255,255,255)
45710 locate 1,3
45720 print "●.縦のフォーカスライン"
45730 locate 1,5
45740 print "1.表現者ライン:" + Forcus2_buffer$(2)
45750 locate 1,7
45760 print "2.司令塔ライン:" + Forcus2_buffer$(1)
45770 locate 1,9
45780 print "3.指導者ライン:" + Forcus2_buffer$(0)
45790 color rgb(0,0,0)
45800 locate 0,15:print "右の丸:次へ,左の丸：もう一度診断 "
45810 '****************************************************************************************************
45820 'WUXG(1920x1200)の時ここから
45830 '****************************************************************************************************
45840 endif
45850 while ((key$ <> chr$(13)) and (bg <> 2) and (bg2 <> 2))
45860 key$ = inkey$
45870 bg = strig(1)
45880 bg2 = strig(0)
45890 pause 200
45900 wend
45910 if ((bg = 2) or (key$ = chr$(13))) then
45920 goto BirdsEye_Result4:
45930 endif
45940 if (bg2=2) then
45950 for i=0 to 8
45960 buffer(i)=0
45970 next i
45980 goto Main_Screen:
45990 endif
46000 BirdsEye_Result4:
46010 cls 3:init"kb:4":bg=0:bg2=0:key$="":No=0
46020 if ((buffer(0) > 0) and (buffer(4) > 0) and  (buffer(8) >  0)) then
46030 Forcus3_buffer$(1) = "○"
46040 else
46050 Forcus3_buffer$(1) = "☓"
46060 endif
46070 if ((buffer(2) > 0 ) and  (buffer(4) > 0) and   (buffer(6) > 0)) then
46080 Forcus3_buffer$(0) = "○"
46090 else
46100 Forcus3_buffer$(0) = "☓"
46110 endif
46120 gload Gazo$ + "Screen1.png",0,0,0
46130 if ex_info$(1)<>"JP" then
46140 color rgb(255,0,0):
46150 locate 1,1
46160 print "Bird's Eye Grid (Focus Line 3)"
46170 color rgb(255,255,255)
46180 locate 1,3:
46190 print "●. Diagonal Focus Line"
46200 locate 1,5
46210 print "1. Success Line:"+Forcus3_buffer$(1)
46220 locate 1,7
46230 print "2. Celebrity Line:"+Forcus3_buffer$(0)
46240 color rgb(0,0,0)
46250 locate 0,15:print "Right circle: Top Menu, Left circle: Top Diagnosis"
46260 else
46270 '****************************************************************************************************
46280 'WUXG(1920x1200)の時ここから
46290 '****************************************************************************************************
46300 color rgb(255,0,0):
46310 locate 1,1
46320 print "バーズアイグリッド(フォーカスライン3)"
46330 color rgb(255,255,255)
46340 locate 1,3:
46350 print "●.斜めのフォーカスライン"
46360 locate 1,5
46370 print "1.成功者ライン:"+Forcus3_buffer$(1)
46380 locate 1,7
46390 print "2.セレブライン:"+Forcus3_buffer$(0)
46400 color rgb(0,0,0)
46410 locate 0,15:print "右の丸:トップメニュー,左の丸：診断トップ "
46420 '*************************************************************************************************
46430 'WUXG(1920x1200)の時ここまで
46440 '*************************************************************************************************
46450 endif
46460 while ((key$ <> chr$(13)) and (bg <> 2) and (bg2 <> 2))
46470 key$ = inkey$
46480 bg = strig(1)
46490 bg2 = strig(0)
46500 pause 200
46510 wend
46520 if ((bg=2) or (key$=chr$(13))) then
46530 goto Result_Birtheye1:
46540 endif
46550 if (bg2=2) then
46560 'データークリア
46570 for i=0 to 8
46580 buffer(i) = 0
46590 next i
46600 goto Main_Screen:
46610 endif
46620 References1:
46630 cls 3:key$ = "":bg = 0:play "":
46640 font 48-8
46650 if ((size(0) <= 1280) and (size(1) <= 800)) then
46660 gload Gazo$ + Gazo_WXGA$ +  "Reference1_864x640_20240219.png",0,0,0
46670 else
46680 gload Gazo$ + "Reference1_20230703.png",0,0,0
46690 gload Gazo$ + "downscreen.png",0,0,800
46700 endif
46710 if ex_info$(1)<>"JP" then
46720 print chr$(13)+chr$(13)+chr$(13)
46730 color rgb(0,0,255)
46740 print "・Title: 名前で運命のすべてがわかる　数秘術" + chr$(13)
46750 print "・Author: Carol Adrienne, Ph.D" + chr$(13)
46760 print "・Publisher: Gento-sha" + chr$(13)
46770 print "・Website: www.carolAdrienne.jp/" + chr$(13)
46780 print "・ISBN: 978-4-344-01394-0" + chr$(13)
46790 print "・Price: 1500 yen + tax" + chr$(13)
46800 color rgb(255,255,255)
46810 locate 1,18
46820 print "Right joystick: Next"
46830 else
46840 '****************************************************************************************************
46850 '(1200x800)の時ここから
46860 '****************************************************************************************************
46870 if ((size(0)<=1280) and (size(1)<=800)) then
46880 font FONT
46890 color rgb(0,0,255)
46900 locate 1,5:
46910 print "・Title:名前で運命のすべてがわかる　数秘術" + chr$(13)
46920 locate 1,7:
46930 print "・Author:carol Adrinne,PhD"+chr$(13)
46940 locate 1,9:
46950 print "・出版社:幻冬舎" + chr$(13)
46960 locate 1,11:
46970 print "・HP:www.carolAdrienne.jp/"+chr$(13)
46980 locate 1,13:
46990 print "・ISBN:978-4-344-01394-0"+chr$(13)
47000 locate 1,15
47010 print "・定価:1500円 + 税"+chr$(13)
47020 color rgb(255,255,255)
47030 locate 1,18
47040 print "ジョイパッド右：次へ"
47050 '****************************************************************************************************
47060 '(1200x800)の時ここまで
47070 '****************************************************************************************************
47080 else
47090 '****************************************************************************************************
47100 'WUXG(1920x1200)の時ここから
47110 '****************************************************************************************************
47120 font FONT
47130 print chr$(13)+chr$(13)+chr$(13)
47140 color rgb(0,0,255)
47150 print "・Title:名前で運命のすべてがわかる　数秘術" + chr$(13)
47160 print "・Author:carol Adrinne,PhD"+chr$(13)
47170 print "・出版社:幻冬舎" + chr$(13)
47180 print "・HP:www.carolAdrienne.jp/"+chr$(13)
47190 print "・ISBN:978-4-344-01394-0"+chr$(13)
47200 print "・定価:1500円 + 税"+chr$(13)
47210 color rgb(255,255,255)
47220 locate 1,18
47230 print "ジョイパッド右：次へ"
47240 '****************************************************************************************************
47250 'WUXG(1920x1200)の時ここまで
47260 '****************************************************************************************************
47270 endif
47280 endif
47290 while (key$ <> chr$(13) and bg <> 2)
47300 bg = strig(1)
47310 key$ = inkey$
47320 pause 200
47330 wend
47340 '
47350 if ((bg = 2) or (key$ = chr$(13))) then
47360 pause 200:goto References2:
47370 endif
47380 'ユダヤの秘儀 カバラ大占術
47390 References2:
47400 cls 3:play "":bg = 0:key$ = ""
47410 if ((size(0)<=1280) and (size(1)<=800)) then
47420 gload Gazo$ + Gazo_WXGA$ +  "Reference2_864x640_20240219.png",0,0,0
47430 else
47440 gload Gazo$ + "Reference2_20230703.png",0,0,0
47450 gload Gazo$ + "downscreen.png",0,0,800
47460 endif
47470 '参考文献２
47480 'カバラ大占術
47490 if ex_info$(1)<>"JP" then
47500 print chr$(13) + chr$(13) + chr$(13)
47510 color  rgb(0,0,255):font 48-8
47520 locate 1,3
47530 print "・Title: ユダヤの秘儀 大占術占術" + chr$(13)
47540 print "・Author: Hironari Asano" + chr$(13)
47550 print "・Publisher: NON BOOK" + chr$(13)
47560 print "・ISBN: 4-396-10364-6" + chr$(13)
47570 print "・Price: 829 yen + tax"
47580 color rgb(255,255,255)
47590 locate 1,18
47600 print "Right joystick: Return to top"
47610 else
47620 '****************************************************************************************************
47630 '(1200x800)の時 ここから
47640 '****************************************************************************************************
47650 if ((size(0)<=1280) and (size(1)<=800)) then
47660 font FONT
47670 color  rgb(0,0,255):
47680 locate 1,5:print "・Title:ユダヤの秘儀 大占術占術" + chr$(13)
47690 locate 1,7:print "・著者：浅野 八郎" + chr$(13)
47700 locate 1,9:print "・出版社:NON BOOK" + chr$(13)
47710 locate 1,11:print "・ISBN:4-396-10364-6" + chr$(13)
47720 locate 1,13:print "・定価:829円 + 税"
47730 color rgb(255,255,255)
47740 locate 1,18
47750 print "ジョイパッド右：トップへ行く"
47760 '****************************************************************************************************
47770 '(1200x800)の時 ここまで
47780 '****************************************************************************************************
47790 else
47800 '****************************************************************************************************
47810 'WUXG(1920x1200)の時ここから
47820 '****************************************************************************************************
47830 color  rgb(0,0,255):font FONT
47840 print chr$(13) + chr$(13) + chr$(13)
47850 locate 1,3
47860 print "・Title:ユダヤの秘儀 大占術占術" + chr$(13)
47870 print "・著者：浅野　八郎" + chr$(13)
47880 print "・出版社:NON BOOK" + chr$(13)
47890 print "・ISBN:4-396-10364-6" + chr$(13)
47900 print "・定価:829円 + 税"
47910 color rgb(255,255,255)
47920 locate 1,18
47930 print "ジョイパッド右：トップへ行く"
47940 '****************************************************************************************************
47950 'WUXG(1920x1200)の時ここまで
47960 '****************************************************************************************************
47970 endif
47980 endif
47990 while ((key$ <> chr$(13)) and (bg <> 2))
48000 bg = strig(1)
48010 key$ = inkey$
48020 pause 200
48030 wend
48040 if ((bg = 2) or (key$ = chr$(13))) then
48050 pause 200:goto Main_Screen:
48060 endif
48070 end
48080 '1.数秘術　トップ画面
48090 Kabara_First_Top:
48100 cls 3:color rgb(255,255,255):play ""
48110 gload Gazo$ + "Kabara_First_Top_20230710.png",0,0,0
48120 gload Gazo$ + "downscreen.png",0,0,800
48130 No=0:init"kb:4"
48140 Play Voice$ + "KabaraTop_Selection_20230721.mp3"
48150 if ex_info$(1)<>"JP" then
48160 print chr$(13);chr$(13)
48170 color rgb(255,255,255)
48180 locate 3,4:No=0
48190 print "Please select a number" + chr$(13)
48200 print " :1. Numerology" + chr$(13)
48210 print " :2. Return to the top screen" + chr$(13)
48220 color rgb(0,0,0)
48230 sp_on 0,1
48240 locate 1,15:print "1. Select Numerology"
48250 else
48260 '****************************************************************************************************
48270 'WUXG(1920x1200)の時ここから
48280 '****************************************************************************************************
48290 print chr$(13);chr$(13)
48300 color rgb(255,255,255)
48310 locate 3,4:No=0
48320 print "番号選んでください" + chr$(13)
48330 print " :1.数秘術占い" + chr$(13)
48340 print " :2.トップ画面に戻る" + chr$(13)
48350 color rgb(0,0,0)
48360 sp_on 0,1
48370 locate 1,15:print "1.数秘術番号を求めるを選択"
48380 '****************************************************************************************************
48390 'WUXG(1920x1200)の時ここまで
48400 '****************************************************************************************************
48410 endif
48420 'KeyBord:true
48430 'Joy Pad:true
48440 '上、下:true
48450 '
48460 'ｂｇ：決定ボタン
48470 'カーソル　上
48480 'カーソル　下
48490 Kabara_First_Top2:
48500 key$ = "":bg = 0:y = 0:
48510 while (((key$ <> chr$(13)) and (key$ <> chr$(30)) and (key$ <> chr$(31)) and (bg <> 2) and (y <> 1) and (y <> -1)))
48520 key$ = inkey$
48530 bg = strig(1)
48540 y = stick(1)
48550 'PauseでCPUを休める
48560 pause 5
48570 wend
48580 '1.カーソル　下 処理 chr$(31)
48590 'カーソル　下
48600 if ex_info$(1) <> "JP" then
48610 if ((key$ = chr$(31)) or (y = 1)) then
48620 select case No
48630 '
48640 case 1:
48650 No = 0:sp_on 0,1:sp_on 2,0:sp_on 3,0:sp_on 1,0:pause 200:locate 1,15:print "                                       ":locate 1,15:print "1. Select Numerology":goto Kabara_First_Top2:
48660 case 0:
48670 No=1:sp_on 1,1:sp_on 0,0:sp_on 3,0:sp_on 2,0:pause 200:locate 1,15:print "                                              ":locate 1,15:print "2. Return to the top screen":goto Kabara_First_Top2:
48680 'case 2:
48690 '       No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print "                                              ":locate 1,15:print "1. Select Numerology Number":goto Kabara_First_Top2:
48700 end select
48710 endif
48720 else
48730 if ((key$ = chr$(31)) or (y = 1)) then
48740 select case No
48750 '
48760 case 1:
48770 No = 0:sp_on 0,1:sp_on 2,0:sp_on 3,0:sp_on 1,0:pause 200:locate 1,15:print "                                       ":locate 1,15:print "1.数秘術占いを選択":goto Kabara_First_Top2:
48780 case 0:
48790 No=1:sp_on 1,1:sp_on 0,0:sp_on 3,0:sp_on 2,0:pause 200:locate 1,15:print "                                              ":locate 1,15:print "2.トップ画面に戻るを選択":goto Kabara_First_Top2:
48800 'case 2:
48810 '       No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print "                                              ":locate 1,15:print "1.数秘術番号を求めるを選択":goto Kabara_First_Top2:
48820 end select
48830 endif
48840 '2.カーソル　上 処理 chr$(30)
48850 if ((key$ = chr$(30)) or (y = -1)) then
48860 select case No
48870 case 0:
48880 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:pause 200:locate 1,15:Print "                                       ":locate 1,15:print "2.トップ画面に戻るを選択":goto Kabara_First_Top2:
48890 case 1:
48900 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:PRINT"                                       ":locate 1,15:print "1.数秘術占いを選択":goto Kabara_First_Top2:
48910 'case 2:
48920 '      No=1:sp_on 0,0:sp_on 2,0:sp_on 1,1:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.数秘術の相性占いを選択":goto Kabara_First_Top2:
48930 end select
48940 endif
48950 endif
48960 '3.決定 処理  bg:2 or Enter key:chr$(13)
48970 if ((bg = 2) or (key$ = chr$(13))) then
48980 select case No
48990 case 0:
49000 sp_on 0,0:sp_on 1,0:sp_on 2,0:No=0: 'goto Input_Seireki:
49010 goto Kabara_TopScreen:
49020 'case 1:
49030 '    sp_on 0,0:sp_on 1,0:sp_on 2,0:No=0:goto Kabara_Aishou_Top:
49040 case 1:
49050 sp_on 0,0:sp_on 1,0:sp_on 2,0:No=0:goto Main_Screen:
49060 end select
49070 endif
49080 '
49090 'Kabara 相性占い トップ画面
49100 Kabara_Aishou_Top:
49110 cls 3:y=0:key$="":bg=0:No=0
49120 play ""
49130 gload Gazo$ + "Kabara_Aishou_Top_20230717.png",0,0,0
49140 gload Gazo$ + "downscreen.png",0,0,800
49150 if ex_info$(1)<>"JP" then
49160 play Voice$ + "Kabara_Aishou_TopScreen_20230721.mp3"
49170 print chr$(13) + chr$(13)
49180 locate 0,4:color rgb(255,255,255)
49190 print "Please select a number" + chr$(13)
49200 print " :1. Compatibility fortune-telling ...." + chr$(13)
49210 print " :2. Business compatibility fortune-telling" + chr$(13)
49220 print " :3. Return to the top screen" + chr$(13)
49230 sp_on 0,1:sp_on 1,0:sp_on 2,0
49240 color rgb(0,0,0)
49250 locate 1,15:print "1. Select compatibility fortune-telling of two men and women"
49260 else
49270 play Voice$ + "Kabara_Aishou_TopScreen_20230721.mp3"
49280 '****************************************************************************************************
49290 'WUXG(1920x1200)の時ここから
49300 '****************************************************************************************************
49310 print chr$(13) + chr$(13)
49320 locate 0,4:color rgb(255,255,255)
49330 'print "Ok"
49340 '
49350 print "番号を選んでください" + chr$(13)
49360 print " :1.男女2人の相性占い(実装不完全)" + chr$(13)
49370 print " :2.ビジネスの相性占い" + chr$(13)
49380 print " :3.トップ画面に戻る" + chr$(13)
49390 sp_on 0,1:sp_on 1,0:sp_on 2,0
49400 color rgb(0,0,0)
49410 locate 1,15:print "1.男女2人の相性占いを選択"
49420 '****************************************************************************************************
49430 'WUXG(1920x1200)の時ここまで
49440 '****************************************************************************************************
49450 endif
49460 Kabara_Aishou_Top2:
49470 key$ = "":y = 0:bg = 0:
49480 while ((key$ <> chr$(13)) and (y <> 1) and (y <> -1) and (bg <> 2) and (key$ <> chr$(30)) and (key$ <> chr$(31)))
49490 'ジョイパッド(右) ,十字キー (上下)
49500 'ジョイパッドの右のボタン bg = 2(ジョイパッド右：決定　)、Enter(chr$(13):（決定）)
49510 y = stick(1)
49520 key$ = inkey$
49530 bg = strig(1)
49540 pause 200
49550 wend
49560 'カーソル　下 or 十字キー　下
49570 if ex_info$(1)<>"JP" then
49580 if ((key$ = chr$(31)) or (y = 1)) then
49590 select case No
49600 'Option change 1 - 2
49610 'case 0 1. Compatibility fortune-telling => 2. Business compatibility fortune-telling
49620 'ok
49630 case 0:
49640 No = 1:sp_on 1,1:sp_on 2,0:sp_on 0,0:pause 200:locate 1,15:print "                                                                               ":locate 1,15:print "2. Select business compatibility fortune-telling":goto Kabara_Aishou_Top2:
49650 'Option change 2 - 3
49660 case 1:
49670 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:print "                                       ":locate 1,15:print "3. Select return to the top screen":locate 1,16:goto Kabara_Aishou_Top2:
49680 'Release time case 2 comment release
49690 case 2:
49700 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1. Select compatibility fortune-telling of two men and women":goto Kabara_Aishou_Top2:
49710 case else:
49720 goto Kabara_Aishou_Top2:
49730 end select
49740 endif
49750 if ((key$ = chr$(30)) or (y = -1)) then
49760 select case No
49770 case 0:
49780 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:locate 1,15:print "                                       ":locate 1,15:print " :3. Return to the top screen" :goto Kabara_Aishou_Top2:
49790 case 1:
49800 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print"                                       ":locate 1,15:print " :1. Compatibility fortune-telling...." :goto Kabara_Aishou_Top2:
49810 case 2:
49820 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print " :2. Business compatibility fortune-telling":goto Kabara_Aishou_Top2:
49830 case else:
49840 goto Kabara_Aishou_Top2:
49850 end select
49860 endif
49870 else
49880 if ((key$ = chr$(31)) or (y = 1)) then
49890 select case No
49900 '選択肢　1 - 2に変更
49910 'case 0 1.男女の相性占い => 2.ビジネスの相性占い
49920 'ok
49930 case 0:
49940 No = 1:sp_on 1,1:sp_on 2,0:sp_on 0,0:pause 200:locate 1,15:print "                                                                               ":locate 1,15:print "2.ビジネスの相性を選択":goto Kabara_Aishou_Top2:
49950 '選択肢　2 - 3に変更
49960 case 1:
49970 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:print "                                       ":locate 1,15:print "3.トップ画面に戻るを選択":locate 1,16:goto Kabara_Aishou_Top2:
49980 'リリース時 case 2コメント解除
49990 case 2:
50000 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.男女の相性占いを選択":goto Kabara_Aishou_Top2:
50010 case else:
50020 goto Kabara_Aishou_Top2:
50030 end select
50040 endif
50050 '十字キー　上　、カーソル　上
50060 if ((key$ = chr$(30)) or (y = -1)) then
50070 select case No
50080 case 0:
50090 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:locate 1,15:print "                                       ":locate 1,15:print "3.トップ画面に戻るを選択":goto Kabara_Aishou_Top2:
50100 case 1:
50110 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print"                                       ":locate 1,15:print "1.男女2人の相性を選択":goto Kabara_Aishou_Top2:
50120 case 2:
50130 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.ビジネスの相性を選択":goto Kabara_Aishou_Top2:
50140 case else:
50150 goto Kabara_Aishou_Top2:
50160 end select
50170 endif
50180 endif
50190 '十字キー　上下:選択
50200 'ジョイパッド 右:決定
50210 if ((bg = 2) or (key$ = chr$(13))) then
50220 select case No
50230 '1.男女の相性
50240 case 0:
50250 '男女の相性占い(未実装)トップ画面に飛ぶ
50260 cls 3:sp_on 0,0:sp_on 1,0:sp_on 2,0:goto Danjyo_Aisyou_Top:
50270 '2ビジネスの相性
50280 case 1:
50290 cls 3:sp_on 0,0:sp_on 1,0:sp_on 2,0:goto Business_Aishou_Input_1_parson:
50300 case 2:
50310 sp_on 0,0:sp_on 1,0:sp_on 2,0:pause 200:goto Main_Screen:
50320 end select
50330 endif
50340 '0.男女の相性　トップ画面　ここから
50350 Danjyo_Aisyou_Top:
50360 cls 3:y=0:key$="":bg=0:No=0
50370 play ""
50380 gload Gazo$ + "Screen1.png",0,0,0
50390 gload Gazo$ + "downscreen.png",0,0,800
50400 if ex_info$(1)<>"JP" then
50410 print chr$(13) + chr$(13)
50420 locate 0,4:color rgb(255,255,255)
50430 print "Please select a number" + chr$(13)
50440 print " :1. Compatibility with a person of ...." + chr$(13)
50450 print " :2. Compatibility between two people" + chr$(13)
50460 print " :3. Return to the top screen" + chr$(13)
50470 sp_on 0,1:sp_on 1,0:sp_on 2,0
50480 color rgb(0,0,0)
50490 locate 1,15:print "1. Compatibility with a person of ...."
50500 else
50510 print chr$(13) + chr$(13)
50520 locate 0,4:color rgb(255,255,255)
50530 '****************************************************************************************************
50540 'WUXG(1920x1200)の時ここから
50550 '****************************************************************************************************
50560 print "番号を選んでください" + chr$(13)
50570 print " :1.自分と異性の相性(未実装)" + chr$(13)
50580 print " :2.男女2人の相性" + chr$(13)
50590 print " :3.トップ画面に戻る" + chr$(13)
50600 sp_on 0,1:sp_on 1,0:sp_on 2,0
50610 color rgb(0,0,0)
50620 locate 1,15:print "1.自分と異性の相性(未実装)を選択"
50630 '****************************************************************************************************
50640 'WUXG(1920x1200)の時ここまで
50650 '****************************************************************************************************
50660 endif
50670 Danjyo_Aisyou_Top2:
50680 key$ = "":y = 0:bg = 0:
50690 while ((key$ <> chr$(13)) and (y <> 1) and (y <> -1) and (bg <> 2) and (key$ <> chr$(30)) and (key$ <> chr$(31)))
50700 'ジョイパッド(右) ,十字キー (上下)
50710 'ジョイパッドの右のボタン bg = 2(ジョイパッド右：決定　)、Enter(chr$(13):（決定）)
50720 y = stick(1)
50730 key$ = inkey$
50740 bg = strig(1)
50750 pause 200
50760 wend
50770 if ex_info$(1)<>"JP" then
50780 'Cursor down or arrow key down
50790 if ((key$ = chr$(31)) or (y = 1)) then
50800 select case No
50810 'Option 1 - 2 change
50820 'case 0 1. Compatibility fortune-telling => 2. Business compatibility fortune-telling
50830 'ok
50840 case 0:
50850 No = 1:sp_on 1,1:sp_on 2,0:sp_on 0,0:pause 200:locate 1,15:print "                                                                               ":locate 1,15:print "2. Select compatibility between two people":goto Danjyo_Aisyou_Top2:
50860 'Option 2 - 3 change
50870 case 1:
50880 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:print "                                       ":locate 1,15:print "3. Select return to the top screen":locate 1,16:goto Danjyo_Aisyou_Top2:
50890 'Release time case 2 comment release
50900 case 2:
50910 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1. Select compatibility with a person of the opposite sex (not implemented)":goto Danjyo_Aisyou_Top2:
50920 case else:
50930 goto Kabara_Aishou_Top2:
50940 end select
50950 endif
50960 'Arrow key up, cursor up
50970 if ((key$ = chr$(30)) or (y = -1)) then
50980 select case No
50990 case 0:
51000 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:locate 1,15:print "                                       ":locate 1,15:print "3. Select return to the top screen":goto Danjyo_Aisyou_Top2:
51010 case 1:
51020 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print"                                       ":locate 1,15:print "1. Select compatibility with a person of the opposite sex (not implemented)":goto Danjyo_Aisyou_Top2:
51030 case 2:
51040 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2. Select compatibility between two people":goto Danjyo_Aisyou_Top2:
51050 case else:
51060 goto Kabara_Aishou_Top2:
51070 end select
51080 endif
51090 else
51100 'カーソル　下 or 十字キー　下
51110 if ((key$ = chr$(31)) or (y = 1)) then
51120 select case No
51130 '選択肢　1 - 2に変更
51140 'case 0 1.男女の相性占い => 2.ビジネスの相性占い
51150 'ok
51160 case 0:
51170 No = 1:sp_on 1,1:sp_on 2,0:sp_on 0,0:pause 200:locate 1,15:print "                                                                               ":locate 1,15:print "2.男女2人の相性を選択":goto Danjyo_Aisyou_Top2:
51180 '選択肢　2 - 3に変更
51190 case 1:
51200 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:print "                                       ":locate 1,15:print "3.トップ画面に戻るを選択":locate 1,16:goto Danjyo_Aisyou_Top2:
51210 'リリース時 case 2コメント解除
51220 case 2:
51230 No = 0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "1.自分と異性の相性(未実装)を選択":goto Danjyo_Aisyou_Top2:
51240 case else:
51250 goto Kabara_Aishou_Top2:
51260 end select
51270 endif
51280 '十字キー　上　、カーソル　上
51290 if ((key$ = chr$(30)) or (y = -1)) then
51300 select case No
51310 case 0:
51320 No=2:sp_on 2,1:sp_on 0,0:sp_on 1,0:pause 200:locate 1,15:print "                                       ":locate 1,15:print "3.トップ画面に戻るを選択":goto Danjyo_Aisyou_Top2:
51330 case 1:
51340 No=0:sp_on 0,1:sp_on 1,0:sp_on 2,0:pause 200:locate 1,15:print"                                       ":locate 1,15:print "1.自分と異性の相性(未実装)":goto Danjyo_Aisyou_Top2:
51350 case 2:
51360 No=1:sp_on 1,1:sp_on 0,0:sp_on 2,0:pause 200:locate 1,15:print "                                      ":locate 1,15:print "2.男女2人の相性を選択":goto Danjyo_Aisyou_Top2:
51370 case else:
51380 goto Kabara_Aishou_Top2:
51390 end select
51400 endif
51410 endif
51420 end
51430 '十字キー　上下:選択
51440 'ジョイパッド 右:決定
51450 if ((bg = 2) or (key$ = chr$(13))) then
51460 select case No
51470 '1.自分と異性の相性
51480 case 0:
51490 '未実装
51500 cls 3:sp_on 0,0:sp_on 1,0:sp_on 2,0:
51510 '2男女の相性 男性の名前入力に飛ぶ
51520 case 1:
51530 cls 3:sp_on 0,0:sp_on 1,0:sp_on 2,0:goto Danjyo_Aisyou_Input_Name_male:
51540 case 2:
51550 sp_on 0,0:sp_on 1,0:sp_on 2,0:pause 200:goto Main_Screen:
51560 end select
51570 endif
51580 '0.男女の相性　トップ画面　ここまで
51590 '1.男女の相性 ここから
51600 '1-1.男性の名前を入力
51610 Danjyo_Aisyou_Input_Name_male:
51620 No=0:color RGB(255,255,255)
51630 '入力:キーボード
51640 cls 3:init "kb:2"
51650 gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
51660 gload Gazo$ + "downscreen.png",0,0,800
51670 for i=0 to 3
51680 buf_male_year(i)=0
51690 next i
51700 if ex_info$(1)<>"JP" then
51710 play "":color rgb(255,0,0):male_name$ = ""
51720 locate 0,1
51730 print "Male Compatibility" + chr$(13) + chr$(13)
51740 color rgb(255,255,255):
51750 locate 0,3
51760 print "We will find the compatibility with a man. Please enter the man's name" + chr$(13)
51770 locate 0,15:color rgb(0,0,0)
51780 Input "Man's Name:",male_name$
51790 else
51800 '****************************************************************************************************
51810 'WUXG(1920x1200)の時ここから
51820 '****************************************************************************************************
51830 play "":color rgb(255,0,0):male_name$ = ""
51840 locate 0,1
51850 print "男性の相性" + chr$(13) + chr$(13)
51860 color rgb(255,255,255):
51870 locate 0,3
51880 print "男性の相性を求めます。男性の名前を" + chr$(13)
51890 print "入れてください" + chr$(13)
51900 locate 0,15:color rgb(0,0,0)
51910 Input "男性の名前:",male_name$
51920 '****************************************************************************************************
51930 'WUXG(1920x1200)の時ここまで
51940 '****************************************************************************************************
51950 endif
51960 '-------------------------------------------
51970 '1-2:男性の生まれた年代
51980 Danjyo_Aisyou_Input_Born_Year:
51990 No=0:color RGB(255,255,255)
52000 cls 3:init "kb:4"
52010 '****************************************************************************************************
52020 'WUXG(1920x1200)の時ここから
52030 '****************************************************************************************************
52040 gload Gazo$ + "Screen1.png",0,0,0
52050 gload Gazo$ + "downscreen.png",0,0,800
52060 '****************************************************************************************************
52070 'WUXG(1920x1200)の時ここから
52080 '****************************************************************************************************
52090 play "":color rgb(255,0,0)
52100 '-------------------------------------------
52110 font 48
52120 if ex_info$(1)<>"JP" then
52130 locate 0,1
52140 color rgb(255,255,255)
52150 print "Please enter the man's birth year" + chr$(13)
52160 color rgb(255,255,255)
52170 locate 1,3
52180 print "Man's Birth Year (4 digits):";buf_male_year$
52190 else
52200 '****************************************************************************************************
52210 'WUXG(1920x1200)の時ここから
52220 '****************************************************************************************************
52230 locate 0,1
52240 '文字色：黒　 color rgb(0,0,0)
52250 color rgb(255,255,255)
52260 print "男性の生まれた年代を入れて下さい" + chr$(13)
52270 color rgb(255,255,255)
52280 locate 1,3
52290 print "男性の生まれた年代(西暦4桁):";buf_male_year$
52300 '****************************************************************************************************
52310 'WUXG(1920x1200)の時ここから
52320 '****************************************************************************************************
52330 endif
52340 color rgb(255,255,255)
52350 'locate 4,6:print ":7"
52360 'locate 9,6:print ":8"
52370 'locate 12,6:print ":9"
52380 locate 4,6
52390 print ":7  :8  :9" + chr$(13)
52400 color rgb(255,255,255)
52410 locate 4,8
52420 print ":4  :5  :6" + chr$(13)
52430 color rgb(255,255,255)
52440 locate 4,10
52450 print ":1  :2  :3" + chr$(13)
52460 locate 4,12
52470 print "    :0"
52480 locate 12,12
52490 color rgb(0,0,255)
52500 print ":Ok"
52510 sp_on 4,0: sp_on 5,0:sp_on 6,0
52520 sp_on 7,0:sp_on 8,0:sp_on 9,0
52530 sp_on 10,0:sp_on 11,0:sp_on 12,0
52540 sp_on 13,0:sp_on 14,1
52550 '-------------------------------------------------------------------------------------
52560 Danjyo_Aisyou_Input_Male_Born_Year2:
52570 key$="":bg=0:y=0:y2=0:bg2=0:
52580 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
52590 key$ = inkey$
52600 bg = strig(1)
52610 y = stick(1)
52620 y2 = stick(0)
52630 bg2=strig(0)
52640 pause 200
52650 wend
52660 '十字キー　ここから
52670 '上の矢印　または、十字キー上
52680 if ((y = -1) or (key$ = chr$(30))) then
52690 select case No
52700 'No=-1:okのとき:初期の状態
52710 '0kボタンから３に移動
52720 '上に行く 処理
52730 case -1:
52740 No=3:sp_on 12,1:sp_on 14,0
52750 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
52760 '選択肢:3
52770 '3ボタンから 6に移動
52780 case 3:
52790 No=6:sp_on 12,0:sp_on 11,1
52800 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
52810 '6ボタンから ９に移動
52820 case 6:
52830 No=9:sp_on 10,1:sp_on 11,0
52840 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
52850 '6ボタンから ９に移動　ここまで
52860 '9で上を押して何もしない
52870 case 9:
52880 '何もしない
52890 No=9
52900 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
52910 '9で上を押しても何もしない　ここまで
52920 '上　 0ボタンから2ボタン
52930 'sp_on 6,1:1
52940 'sp_on 8,1:5
52950 'sp_on 7,1:7
52960 case 0:
52970 No=2:sp_on 13,0:sp_on 9,1:
52980 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
52990 '上  0ボタンから2ボタン　ここまで
53000 '2から５になる 上
53010 case 2:
53020 No=5:sp_on 8,1:sp_on 9,0:
53030 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53040 case 5:
53050 No=8:sp_on 7,1:sp_on 8,0
53060 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53070 case 8:
53080 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53090 case 1:
53100 No=4:sp_on 5,1:sp_on 6,0
53110 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53120 case 4:
53130 No=7:sp_on 4,1:sp_on 5,0
53140 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53150 case 7:
53160 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53170 end select
53180 endif
53190 '左３　ここまで
53200 '下の矢印
53210 '中央 2
53220 if ((y=1) or (key$ = chr$(31))) then
53230 select case No
53240 '9から６に下げる
53250 case 9:
53260 No=6:sp_on 11,1:sp_on 10,0
53270 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53280 '6から３に下げる
53290 case 6:
53300 No=3:sp_on 12,1:sp_on 11,0
53310 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53320 '3から０ｋに変える
53330 case 3:
53340 No=-1:sp_on 14,1:sp_on 12,0
53350 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53360 'Okから下のボタンを押しても何もしない
53370 case -1:
53380 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53390 case 8:
53400 No=5:sp_on 8,1:sp_on 7,0
53410 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53420 case 5:
53430 No=2:sp_on 9,1:sp_on 8,0
53440 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53450 case 2:
53460 No=0:sp_on 13,1:sp_on 9,0
53470 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53480 case 0:
53490 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53500 case 7:
53510 No=4:sp_on 5,1:sp_on 4,0
53520 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53530 case 4:
53540 No=1:sp_on 6,1:sp_on 5,0
53550 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53560 case 1:
53570 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53580 end select
53590 endif
53600 '左へボタン 十字キー　左　or 　カーソル左
53610 if ((y2 = -1) or (key$ = chr$(29))) then
53620 select case No
53630 'Ok ボタン  Okから　左　０に行く
53640 case -1:
53650 No=0:sp_on 13,1:sp_on 14,0
53660 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53670 '0 ボタン  左　何もしない
53680 case 0:
53690 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53700 case 3:
53710 No=2:sp_on 9,1:sp_on 12,0:
53720 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53730 case 2:
53740 No=1:sp_on 6,1:sp_on 9,0:
53750 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53760 case 1:
53770 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53780 case 6:
53790 No=5:sp_on 8,1:sp_on 11,0
53800 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53810 case 5:
53820 No=4:sp_on 5,1:sp_on 8,0
53830 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53840 case 4:
53850 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53860 case 9:
53870 No=8:sp_on 7,1:sp_on 10,0
53880 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53890 case 8:
53900 No=7:sp_on 4,1:sp_on 7,0
53910 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53920 case 7:
53930 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
53940 end select
53950 endif
53960 '右  十字キー　右　or カーソル　右
53970 if ((y2 = 1) or (key$ = chr$(28))) then
53980 select case No
53990 '0ボタンからokボタン右に移動
54000 case 0:
54010 No=-1:sp_on 14,1:sp_on 13,0
54020 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54030 '0ボタンからokボタン 右に移動　ここまで
54040 'OKボタンで右を押して何もしない
54050 case -1:
54060 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54070 case 1:
54080 No=2:sp_on 9,1:sp_on 6,0
54090 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54100 case 2:
54110 No=3:sp_on 12,1:sp_on 9,0
54120 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54130 case 3:
54140 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54150 case 4:
54160 No=5:sp_on 8,1:sp_on 5,0
54170 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54180 case 5:
54190 No=6:sp_on 11,1:sp_on 8,0
54200 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54210 case 7:
54220 No=8:sp_on 7,1:sp_on 4,0
54230 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54240 case 8:
54250 No=9:sp_on 10,1:sp_on 7,0
54260 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54270 case 9:
54280 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54290 case 6:
54300 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Year2:
54310 end select
54320 'Okから右ボタンを押して何もしない ここまで
54330 endif
54340 '十字キー　ここまで
54350 '==============================
54360 'ここから
54370 '==============================
54380 if ((bg = 2) or (key$ = chr$(13))) then
54390 select case count
54400 case 0:
54410 count = 1
54420 if (No = -1) then
54430 count = 0:No=0
54440 buf_male_year(0) = No
54450 'Okボタンを押したとき
54460 goto Danjyo_Aisyou_Input_Male_Born_Year2:
54470 else
54480 'Okボタン以外が押されたとき
54490 if (No >= 1 and No <= 2) then
54500 buf_year$="":buf_year$ = str$(No) + "***"
54510 buf_year = No:a= No
54520 buf_Jyoushi_Born_Day(0) = No
54530 if ex_info$(1)<>"JP" then
54540 locate 1,3
54550 color rgb(255,255,255)
54560 print "Year of birth of the male (4 digits AD):";buf_year$
54570 else
54580 count=0
54590 ui_msg"The number is out of range."
54600 endif
54610 else
54620 '****************************************************************************************************
54630 'WUXG(1920x1200)の時ここから
54640 '****************************************************************************************************
54650 locate 1,3
54660 color rgb(255,255,255)
54670 print "男性の生まれた年代(西暦4桁):";buf_year$
54680 goto Danjyo_Aisyou_Input_Male_Born_Year2:
54690 '****************************************************************************************************
54700 'WUXG(1920x1200)の時ここまで
54710 '****************************************************************************************************
54720 else
54730 count=0
54740 ui_msg"数字が範囲外になります。"
54750 endif
54760 buf_year$="":buf_year=0
54770 goto Danjyo_Aisyou_Input_Male_Born_Year2:
54780 endif
54790 'endif
54800 case 1:
54810 count = 2
54820 if (No = -1) then
54830 count = 1
54840 goto Danjyo_Aisyou_Input_Male_Born_Year2:
54850 else
54860 '****************************************************************************************************
54870 'WUXG(1920x1200)の時ここから
54880 '****************************************************************************************************
54890 buf_year = a * 10 + No
54900 b=buf_year
54910 buf_year$ = str$(buf_year) + "**"
54920 buf_male_year(0)=buf_year
54930 locate 1,3
54940 color rgb(255,255,255)
54950 print "                                                                "
54960 locate 1,3
54970 print "男性の生まれた年代(西暦4桁):" + buf_year$
54980 'if (No = -1) then
54990 'count=1
55000 goto Danjyo_Aisyou_Input_Male_Born_Year2:
55010 '****************************************************************************************************
55020 'WUXG(1920x1200)の時ここまで
55030 '****************************************************************************************************
55040 endif
55050 case 2:
55060 count=3
55070 if (No=-1) then
55080 count =2
55090 goto Danjyo_Aisyou_Input_Male_Born_Year2:
55100 else
55110 buf_year = b * 10 + No
55120 c=buf_year
55130 buf_year$ = str$(buf_year) + "*"
55140 buf_male_year(0) = buf_year
55150 locate 1,3
55160 color rgb(255,255,255)
55170 print " 　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　"
55180 if ex_info$(1)<>"JP" then
55190 locate 1,3
55200 print "Year of birth of the male (4 digits AD):";buf_year$
55210 else
55220 '****************************************************************************************************
55230 'WUXG(1920x1200)の時ここから
55240 '****************************************************************************************************
55250 locate 1,3
55260 print "男性の生まれた年代(西暦4桁):";buf_year$
55270 goto Danjyo_Aisyou_Input_Male_Born_Year2:
55280 '****************************************************************************************************
55290 'WUXG(1920x1200)の時ここまで
55300 '****************************************************************************************************
55310 endif
55320 endif
55330 case 3:
55340 count=4
55350 if (No = -1) then
55360 No=0
55370 goto Danjyo_Aisyou_Input_Male_Born_Year2:
55380 else
55390 buf_year = c * 10 + No
55400 buf_year$ = str$(buf_year)
55410 buf_male_year(0) = buf_year
55420 if ex_info$(1)<>"JP" then
55430 locate 1,3
55440 color RGB(255,255,255)
55450 print "                                      "
55460 locate 1,3
55470 print "Year of birth of the male (4 digits AD):";buf_year$
55480 else
55490 locate 1,3
55500 color RGB(255,255,255)
55510 print "                                      "
55520 locate 1,3
55530 print "男性の生まれた年代(西暦4桁):";buf_year$
55540 endif
55550 buf_year=val(buf_year$)
55560 'year=val(buf_year$)
55570 'if (No=-1) then
55580 'goto Input_Born_Month:
55590 'else
55600 goto Danjyo_Aisyou_Input_Male_Born_Year2:
55610 endif
55620 case 4:
55630 'bufyear=buf_year
55640 if (No=-1) then
55650 buf_year = val(buf_year$)
55660 buf_male_year(0)=buf_year
55670 sp_on 14,0:No=0
55680 goto Danjyo_Aisyou_Input_Male_Born_Year2:
55690 else
55700 goto Danjyo_Aisyou_Input_Male_Born_Year2:
55710 endif
55720 end select
55730 endif
55740 '===========================
55750 'ここまでを部下のところにコピーする.
55760 '===========================
55770 if (bg2 = 2) then
55780 select case count2
55790 case 0:
55800 if (No = -1) then
55810 buf_male_year=0:buf_male_year$=trim$(""):buf_male_year$=trim$("****")
55820 count=0
55830 if ex_info$(1)<>"JP" then
55840 locate 1,3
55850 color rgb(255,255,255)
55860 print "                                      "
55870 locate 1,3
55880 print "Year of birth of the male (4 digits AD):" + buf_male_year$
55890 goto Danjyo_Aisyou_Input_Male_Born_Year2:
55900 else
55910 '(buf_year=0) then
55920 buf_male_year=0:buf_male_year$="****"
55930 locate 1,3
55940 print "                                       "
55950 locate 1,3
55960 print "Year of birth of the male (4 digits AD):"+buf_male_year$
55970 goto Danjyo_Aisyou_Input_Male_Born_Year2:
55980 else
55990 locate 1,3
56000 color rgb(255,255,255)
56010 print "                                      "
56020 locate 1,3
56030 print "男性の生まれた年代（西暦4桁):" + buf_male_year$
56040 goto Danjyo_Aisyou_Input_Male_Born_Year2:
56050 else
56060 '(buf_year=0) then
56070 buf_male_year=0:buf_male_year$="****"
56080 locate 1,3
56090 print "                                       "
56100 locate 1,3
56110 print "男性の生まれた年代(西暦4桁):"+buf_male_year$
56120 goto Danjyo_Aisyou_Input_Male_Born_Year2:
56130 endif
56140 endif
56150 end select
56160 endif
56170 '-------生まれた年代　男性-------------
56180 '-------生まれた月　男性-------------
56190 '1-2:男性の生まれた月
56200 Danjyo_Aisyou_Input_Male_Born_Month:
56210 cls 3:play "":count=0:count2=0
56220 'No=-1:Okのとき
56230 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_male_Month$ = "**":buf_male_month=0
56240 for i=0 to 1
56250 buf_male_month(i)=0
56260 next i
56270 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
56280 '****************************************************************************************************
56290 'WUXG(1920x1200)の時ここから
56300 '****************************************************************************************************
56310 gload Gazo$ + "Screen1.png",0,0,0
56320 gload Gazo$ + "downscreen.png",0,0,800
56330 '****************************************************************************************************
56340 'WUXG(1920x1200)の時ここまで
56350 '****************************************************************************************************
56360 'Init"kb:4"
56370 '音声ファイル再生 2023.06.07
56380 play Voice$ + "Input_Born_Month_Jyoushi_20230831.mp3"
56390 '****************************************************************************************************
56400 'WUXG(1920x1200)の時ここから
56410 '****************************************************************************************************
56420 font 48
56430 '****************************************************************************************************
56440 'WUXG(1920x1200)の時ここまで
56450 '****************************************************************************************************
56460 locate 0,1
56470 '文字色：黒　 color rgb(0,0,0)
56480 '文字色:白
56490 color rgb(255,255,255)
56500 print "男性の生まれた月を入れて下さい" + chr$(13)
56510 '文字色:白
56520 color rgb(255,255,255)
56530 locate 1,3
56540 '文字色:白
56550 print "男性の生まれた月(1月~12月):"+buf_male_Month$
56560 color rgb(255,255,255)
56570 'locate 4,6:print ":7"
56580 'locate 9,6:print ":8"
56590 'locate 12,6:print ":9"
56600 locate 4,6
56610 '文字色:赤
56620 print ":7  :8  :9" + chr$(13)
56630 color rgb(255,255,255)
56640 locate 4,8
56650 print ":4  :5  :6" + chr$(13)
56660 color rgb(255,255,255)
56670 locate 4,10
56680 print ":1  :2  :3" + chr$(13)
56690 locate 4,12
56700 print "    :0"
56710 locate 12,12
56720 color rgb(0,0,255)
56730 print ":Ok"
56740 sp_on 4,0: sp_on 5,0:sp_on 6,0
56750 sp_on 7,0:sp_on 8,0:sp_on 9,0
56760 sp_on 10,0:sp_on 11,0:sp_on 12,0
56770 sp_on 13,0:sp_on 14,1
56780 '----------------------------------------------------------------------------------------
56790 Danjyo_Aisyou_Input_Male_Born_Month2:
56800 key$="":bg=0:y=0:y2=0:bg2=0
56810 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
56820 key$ = inkey$
56830 bg = strig(1)
56840 y = stick(1)
56850 y2 = stick(0)
56860 bg2 = strig(0)
56870 pause 200
56880 wend
56890 '十字キー　ここから
56900 '上の矢印　または、十字キー上
56910 if ((y = -1) or (key$ = chr$(30))) then
56920 select case No
56930 'No=-1:okのとき:初期の状態
56940 '0kボタンから３に移動
56950 '上に行く 処理
56960 case -1:
56970 No=3:sp_on 12,1:sp_on 14,0
56980 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
56990 '選択肢:3
57000 '3ボタンから 6に移動
57010 case 3:
57020 No=6:sp_on 12,0:sp_on 11,1
57030 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57040 '6ボタンから ９に移動
57050 case 6:
57060 No=9:sp_on 10,1:sp_on 11,0
57070 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57080 '6ボタンから ９に移動　ここまで
57090 '9で上を押して何もしない
57100 case 9:
57110 '何もしない
57120 No=9
57130 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57140 '9で上を押しても何もしない　ここまで
57150 '上　 0ボタンから2ボタン
57160 'sp_on 6,1:1
57170 'sp_on 8,1:5
57180 'sp_on 7,1:7
57190 case 0:
57200 No=2:sp_on 13,0:sp_on 9,1:
57210 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57220 '上  0ボタンから2ボタン　ここまで
57230 '2から５になる 上
57240 case 2:
57250 No=5:sp_on 8,1:sp_on 9,0:
57260 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57270 case 5:
57280 No=8:sp_on 7,1:sp_on 8,0
57290 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57300 case 8:
57310 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57320 case 1:
57330 No=4:sp_on 5,1:sp_on 6,0
57340 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57350 case 4:
57360 No=7:sp_on 4,1:sp_on 5,0
57370 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57380 case 7:
57390 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57400 end select
57410 endif
57420 '左３　ここまで
57430 '下の矢印
57440 '中央 2
57450 if ((y=1) or (key$ = chr$(31))) then
57460 select case No
57470 '9から６に下げる
57480 case 9:
57490 No=6:sp_on 11,1:sp_on 10,0
57500 pause 200:gotoDanjyo_Aisyou_Input_Male_Born_Month2:
57510 '6から３に下げる
57520 case 6:
57530 No=3:sp_on 12,1:sp_on 11,0
57540 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57550 '3から０ｋに変える
57560 case 3:
57570 No=-1:sp_on 14,1:sp_on 12,0
57580 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57590 'Okから下のボタンを押しても何もしない
57600 case -1:
57610 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57620 case 8:
57630 No=5:sp_on 8,1:sp_on 7,0
57640 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57650 case 5:
57660 No=2:sp_on 9,1:sp_on 8,0
57670 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57680 case 2:
57690 No=0:sp_on 13,1:sp_on 9,0
57700 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57710 case 0:
57720 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57730 case 7:
57740 No=4:sp_on 5,1:sp_on 4,0
57750 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57760 case 4:
57770 No=1:sp_on 6,1:sp_on 5,0
57780 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57790 case 1:
57800 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57810 end select
57820 endif
57830 '左へボタン 十字キー　左　or 　カーソル左
57840 if ((y2 = -1) or (key$ = chr$(29))) then
57850 select case No
57860 'Ok ボタン  Okから　左　０に行く
57870 case -1:
57880 No=0:sp_on 13,1:sp_on 14,0
57890 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57900 '0 ボタン  左　何もしない
57910 case 0:
57920 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57930 case 3:
57940 No=2:sp_on 9,1:sp_on 12,0:
57950 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57960 case 2:
57970 No=1:sp_on 6,1:sp_on 9,0:
57980 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
57990 case 1:
58000 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58010 case 6:
58020 No=5:sp_on 8,1:sp_on 11,0
58030 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58040 case 5:
58050 No=4:sp_on 5,1:sp_on 8,0
58060 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58070 case 4:
58080 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58090 case 9:
58100 No=8:sp_on 7,1:sp_on 10,0
58110 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58120 case 8:
58130 No=7:sp_on 4,1:sp_on 7,0
58140 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58150 case 7:
58160 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58170 end select
58180 endif
58190 '右  十字キー　右　or カーソル　右
58200 if ((y2 = 1) or (key$ = chr$(28))) then
58210 select case No
58220 '0ボタンからokボタン右に移動
58230 case 0:
58240 No=-1:sp_on 14,1:sp_on 13,0
58250 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58260 '0ボタンからokボタン 右に移動　ここまで
58270 'OKボタンで右を押して何もしない
58280 case -1:
58290 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58300 case 1:
58310 No=2:sp_on 9,1:sp_on 6,0
58320 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58330 case 2:
58340 No=3:sp_on 12,1:sp_on 9,0
58350 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58360 case 3:
58370 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58380 case 4:
58390 No=5:sp_on 8,1:sp_on 5,0
58400 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58410 case 5:
58420 No=6:sp_on 11,1:sp_on 8,0
58430 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58440 case 7:
58450 No=8:sp_on 7,1:sp_on 4,0
58460 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58470 case 8:
58480 No=9:sp_on 10,1:sp_on 7,0
58490 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58500 case 9:
58510 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58520 case 6:
58530 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Month2:
58540 end select
58550 'Okから右ボタンを押して何もしない ここまで
58560 endif
58570 '十字キー　ここまで
58580 '右の丸ボタン + Enter key 決定キー
58590 if ((bg=2) or (key$=chr$(13))) then
58600 select case count
58610 case 0:
58620 if (No=-1) then No=0
58630 count = 1:buf_male_Month$ = "**":buf_male_Month$ = str$(No):buf_male_month = No:c=No
58640 if (buf_male_month > 1 and buf_male_month < 10)  then
58650 buf_male_Month$ = str$(buf_male_month)
58660 'buf_month=No
58670 endif
58680 if (buf_male_month = 1)  then
58690 buf_male_Month$ = str$(buf_male_month) + "*"
58700 'c=buf_month
58710 endif
58720 locate 1,3
58730 print "                                     "
58740 color RGB(255,255,255)
58750 locate 1,3
58760 print "男性の生まれた月(1月~12月):" + buf_male_Month$
58770 goto Danjyo_Aisyou_Input_Male_Born_Month2:
58780 case 1:
58790 count = 2:
58800 'c = val(buf_Month$)
58810 if (No = -1) then
58820 'count=0
58830 No=0
58840 month=buf_male_month
58850 buf_male_month=val(buf_male_Month$)
58860 month=buf_male_month
58870 buf_Jyoushi_Born_Day(1)=month
58880 '生まれた日に飛ぶ
58890 goto Danjyo_Aisyou_Input_Male_Born_Day:
58900 else
58910 buf_male_month = c*10 + No
58920 'if (buf_month = 1) then
58930 'buf_Month$ = str$(buf_month)
58940 'endif
58950 buf_male_Month$ = str$(buf_male_month)
58960 buf_Jyoushi_Born_Day(1) = buf_male_month
58970 locate 0,3
58980 print "                                           "
58990 locate 1,3
59000 color Rgb(255,255,255)
59010 print "男性の生まれた月(1月~12月):" + buf_male_Month$
59020 goto Danjyo_Aisyou_Input_Male_Born_Month2:
59030 endif
59040 case 2:
59050 '==================================
59060 '何もしない
59070 'coun = 2
59080 '==================================
59090 'c= val(buf_Month$)
59100 'buf_month = c*10 + No
59110 'buf_Month$ = str$(buf_month)
59120 'locate 2,3
59130 'print "上司の生まれた月(1月～12月):";buf_Month$
59140 'goto Jyoushi_Input_Born_Month2:
59150 'case 3:
59160 'count=4
59170 'b=val(buf_month$)
59180 'buf_month=c*10+No
59190 'buf_Month$=str$(buf_month)
59200 'locate 2,3
59210 'print "上司の生まれた月(1月～12月):";buf_Month$
59220 'buf_month=val(buf_Month$)
59230 'year=val(buf_year$)
59240 if (No=-1) then
59250 No=0
59260 goto Danjyo_Aisyou_Input_Male_Born_Day:
59270 else
59280 goto Danjyo_Aisyou_Input_Male_Born_Day2:
59290 endif
59300 'case 4:
59310 'bufyear=buf_year
59320 'if (No=-1) then
59330 'buf_month = val(buf_Month$)
59340 'month = buf_month
59350 'sp_on 14,0
59360 'goto Input_Born_Day:
59370 'else
59380 'goto Input_Born_Month2:
59390 'endif
59400 end select
59410 endif
59420 '左の丸ボタン　キャンセル
59430 if (bg2=2) then
59440 select case count2
59450 case 0:
59460 if (No = -1) then
59470 buf_male_month=0:buf_male_Month$="**"
59480 count=0
59490 'goto rewrite2:
59500 else
59510 if ((No >= 1 and No <= 9) or (No >= 10 and No <= 12)) then
59520 buf_male_month = 0:buf_male_Month$ = "**"
59530 locate 0,3
59540 color rgb(255,255,255)
59550 print "                                       "
59560 goto rewrite2:
59570 if (No>12) then
59580 ui_msg"値が範囲外です。"
59590 goto rewrite2:
59600 endif
59610 endif
59620 endif
59630 rewrite2:
59640 locate 2,3
59650 color rgb(255,255,255)
59660 print "                                      "
59670 locate 2,3
59680 print "男性の生まれた月(1月~12月):"+buf_male_Month$
59690 goto Danjyo_Aisyou_Input_Male_Born_Month2:
59700 end select
59710 'endif
59720 endif
59730 end
59740 '-------生まれた月　男性 ここまで-------------
59750 '-------生まれた日　男性 ここから-------------
59760 Danjyo_Aisyou_Input_Male_Born_Day:
59770 cls 3:play "":count=0:count2=0
59780 'No=-1:Okのとき
59790 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_male_Day$ = "**":buf_male_day = 0
59800 for i=0 to 1
59810 buf_day(i)=0
59820 next i
59830 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
59840 '****************************************************************************************************
59850 'WUXG(1920x1200)の時ここから
59860 '****************************************************************************************************
59870 gload Gazo$ + "Screen1.png",0,0,0
59880 gload Gazo$ + "downscreen.png",0,0,800
59890 '****************************************************************************************************
59900 'WUXG(1920x1200)の時ここまで
59910 '****************************************************************************************************
59920 'Init"kb:4"
59930 '音声ファイル再生 2023.06.07
59940 play Voice$ + "Input_Born_Month_Jyoushi_20230831.mp3"
59950 font 48
59960 locate 0,1
59970 '文字色：黒　 color rgb(0,0,0)
59980 '文字色:白
59990 color rgb(255,255,255)
60000 print "男性の生まれた日を入れて下さい" + chr$(13)
60010 '文字色:白
60020 color rgb(255,255,255)
60030 locate 1,3
60040 '文字色:白
60050 print "男性の生まれた日(1月~31月):" + buf_Day$
60060 color rgb(255,255,255)
60070 'locate 4,6:print ":7"
60080 'locate 9,6:print ":8"
60090 'locate 12,6:print ":9"
60100 locate 4,6
60110 '文字色:赤
60120 print ":7  :8  :9" + chr$(13)
60130 color rgb(255,255,255)
60140 locate 4,8
60150 print ":4  :5  :6" + chr$(13)
60160 color rgb(255,255,255)
60170 locate 4,10
60180 print ":1  :2  :3" + chr$(13)
60190 locate 4,12
60200 print "    :0"
60210 locate 12,12
60220 color rgb(0,0,255)
60230 print ":Ok"
60240 sp_on 4,0: sp_on 5,0:sp_on 6,0
60250 sp_on 7,0:sp_on 8,0:sp_on 9,0
60260 sp_on 10,0:sp_on 11,0:sp_on 12,0
60270 sp_on 13,0:sp_on 14,1
60280 '-------------------------------------------------
60290 Danjyo_Aisyou_Input_Male_Born_Day2:
60300 key$="":bg=0:y=0:y2=0:bg2=0
60310 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
60320 key$ = inkey$
60330 bg = strig(1)
60340 y = stick(1)
60350 y2 = stick(0)
60360 bg2 = strig(0)
60370 pause 200
60380 wend
60390 '十字キー　ここから
60400 '上の矢印　または、十字キー上
60410 if ((y = -1) or (key$ = chr$(30))) then
60420 select case No
60430 'No=-1:okのとき:初期の状態
60440 '0kボタンから３に移動
60450 '上に行く 処理
60460 case -1:
60470 No=3:sp_on 12,1:sp_on 14,0
60480 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
60490 '選択肢:3
60500 '3ボタンから 6に移動
60510 case 3:
60520 No=6:sp_on 12,0:sp_on 11,1
60530 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
60540 '6ボタンから ９に移動
60550 case 6:
60560 No=9:sp_on 10,1:sp_on 11,0
60570 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
60580 '6ボタンから ９に移動　ここまで
60590 '9で上を押して何もしない
60600 case 9:
60610 '何もしない
60620 No=9
60630 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
60640 '9で上を押しても何もしない　ここまで
60650 '上　 0ボタンから2ボタン
60660 'sp_on 6,1:1
60670 'sp_on 8,1:5
60680 'sp_on 7,1:7
60690 case 0:
60700 No=2:sp_on 13,0:sp_on 9,1:
60710 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
60720 '上  0ボタンから2ボタン　ここまで
60730 '2から５になる 上
60740 case 2:
60750 No=5:sp_on 8,1:sp_on 9,0:
60760 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
60770 case 5:
60780 No=8:sp_on 7,1:sp_on 8,0
60790 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
60800 case 8:
60810 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
60820 case 1:
60830 No=4:sp_on 5,1:sp_on 6,0
60840 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
60850 case 4:
60860 No=7:sp_on 4,1:sp_on 5,0
60870 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
60880 case 7:
60890 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
60900 end select
60910 endif
60920 '左３　ここまで
60930 '下の矢印
60940 '中央 2
60950 if ((y=1) or (key$ = chr$(31))) then
60960 select case No
60970 '9から６に下げる
60980 case 9:
60990 No=6:sp_on 11,1:sp_on 10,0
61000 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61010 '6から３に下げる
61020 case 6:
61030 No=3:sp_on 12,1:sp_on 11,0
61040 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61050 '3から０ｋに変える
61060 case 3:
61070 No=-1:sp_on 14,1:sp_on 12,0
61080 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61090 'Okから下のボタンを押しても何もしない
61100 case -1:
61110 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61120 case 8:
61130 No=5:sp_on 8,1:sp_on 7,0
61140 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61150 case 5:
61160 No=2:sp_on 9,1:sp_on 8,0
61170 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61180 case 2:
61190 No=0:sp_on 13,1:sp_on 9,0
61200 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61210 case 0:
61220 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61230 case 7:
61240 No=4:sp_on 5,1:sp_on 4,0
61250 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61260 case 4:
61270 No=1:sp_on 6,1:sp_on 5,0
61280 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61290 case 1:
61300 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61310 end select
61320 endif
61330 '左へボタン 十字キー　左　or 　カーソル左
61340 if ((y2 = -1) or (key$ = chr$(29))) then
61350 select case No
61360 'Ok ボタン  Okから　左　０に行く
61370 case -1:
61380 No=0:sp_on 13,1:sp_on 14,0
61390 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61400 '0 ボタン  左　何もしない
61410 case 0:
61420 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61430 case 3:
61440 No=2:sp_on 9,1:sp_on 12,0:
61450 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61460 case 2:
61470 No=1:sp_on 6,1:sp_on 9,0:
61480 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61490 case 1:
61500 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61510 case 6:
61520 No=5:sp_on 8,1:sp_on 11,0
61530 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61540 case 5:
61550 No=4:sp_on 5,1:sp_on 8,0
61560 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61570 case 4:
61580 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61590 case 9:
61600 No=8:sp_on 7,1:sp_on 10,0
61610 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61620 case 8:
61630 No=7:sp_on 4,1:sp_on 7,0
61640 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61650 case 7:
61660 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61670 end select
61680 endif
61690 '右  十字キー　右　or カーソル　右
61700 if ((y2 = 1) or (key$ = chr$(28))) then
61710 select case No
61720 '0ボタンからokボタン右に移動
61730 case 0:
61740 No=-1:sp_on 14,1:sp_on 13,0
61750 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61760 '0ボタンからokボタン 右に移動　ここまで
61770 'OKボタンで右を押して何もしない
61780 case -1:
61790 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61800 case 1:
61810 No=2:sp_on 9,1:sp_on 6,0
61820 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61830 case 2:
61840 No=3:sp_on 12,1:sp_on 9,0
61850 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61860 case 3:
61870 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61880 case 4:
61890 No=5:sp_on 8,1:sp_on 5,0
61900 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61910 case 5:
61920 No=6:sp_on 11,1:sp_on 8,0
61930 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61940 case 7:
61950 No=8:sp_on 7,1:sp_on 4,0
61960 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
61970 case 8:
61980 No=9:sp_on 10,1:sp_on 7,0
61990 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62000 case 9:
62010 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62020 case 6:
62030 pause 200:goto Danjyo_Aisyou_Input_Male_Born_Day2:
62040 end select
62050 'Okから右ボタンを押して何もしない ここまで
62060 endif
62070 '十字キー　ここまで
62080 '右の丸ボタン + Enter key 決定キー
62090 if ((bg=2) or (key$=chr$(13))) then
62100 select case count
62110 case 0:
62120 if (No=-1) then No=0
62130 count = 1:buf_male_Day$ = "**":buf_male_Day$ = str$(No):buf_male_day = No:c=No
62140 if (buf_male_day > 1 and buf_male_day < 10)  then
62150 buf_male_Day$ = str$(buf_male_day)
62160 'buf_month=No
62170 endif
62180 if (buf_male_day = 1)  then
62190 buf_male_Day$ = str$(buf_male_day) + "*"
62200 'c=buf_month
62210 endif
62220 locate 1,3
62230 print "                                     "
62240 color RGB(255,255,255)
62250 locate 1,3
62260 print "男性の生まれた日(1月~31月):" + buf_male_Day$
62270 goto Danjyo_Aisyou_Input_Male_Born_Day2:
62280 case 1:
62290 count = 2:
62300 'c = val(buf_Month$)
62310 if (No = -1) then
62320 'count=0
62330 No=0
62340 day=buf_male_Day
62350 buf_male_Day=val(buf_male_Day$)
62360 day=buf_male_Day
62370 buf_Jyoushi_Born_Day(2)=day
62380 '生まれた日に飛ぶ
62390 goto Danjyo_Aisyou_Input_Male_Born_Day:
62400 else
62410 buf_male_Day = c*10 + No
62420 'if (buf_month = 1) then
62430 'buf_Month$ = str$(buf_month)
62440 'endif
62450 buf_male_Day$ = str$(buf_male_Day)
62460 buf_male_Born_Day(2) = buf_male_Day:
62470 locate 0,3
62480 print "                                           "
62490 locate 1,3
62500 color Rgb(255,255,255)
62510 print "男性の生まれた月(1月~12月):" + buf_male_Day$
62520 goto Danjyo_Aisyou_Input_Male_Born_Day2:
62530 endif
62540 case 2:
62550 '==================================
62560 '何もしない
62570 'coun = 2
62580 '==================================
62590 'c= val(buf_Month$)
62600 'buf_month = c*10 + No
62610 'buf_Month$ = str$(buf_month)
62620 'locate 2,3
62630 'print "上司の生まれた月(1月～12月):";buf_Month$
62640 'goto Jyoushi_Input_Born_Month2:
62650 'case 3:
62660 'count=4
62670 'b=val(buf_month$)
62680 'buf_month=c*10+No
62690 'buf_Month$=str$(buf_month)
62700 'locate 2,3
62710 'print "上司の生まれた月(1月～12月):";buf_Month$
62720 'buf_month=val(buf_Month$)
62730 'year=val(buf_year$)
62740 if (No=-1) then
62750 No=0
62760 goto Danjyo_Aisyou_Input_Male_Born_Day:
62770 else
62780 goto Danjyo_Aisyou_Input_Male_Born_Day2:
62790 endif
62800 'case 4:
62810 'bufyear=buf_year
62820 'if (No=-1) then
62830 'buf_month = val(buf_Month$)
62840 'month = buf_month
62850 'sp_on 14,0
62860 'goto Input_Born_Day:
62870 'else
62880 'goto Input_Born_Month2:
62890 'endif
62900 end select
62910 endif
62920 '左の丸ボタン　キャンセル
62930 if (bg2=2) then
62940 select case count2
62950 case 0:
62960 if (No = -1) then
62970 buf_male_day=0:buf_male_Day$="**"
62980 count=0
62990 'goto rewrite2:
63000 else
63010 if ((No >= 1 and No <= 9) or (No >= 10 and No <= 12)) then
63020 buf_male_day = 0:buf_male_Day$ = "**"
63030 locate 0,3
63040 color rgb(255,255,255)
63050 print "                                       "
63060 goto rewrite2:
63070 if (No>12) then
63080 ui_msg"値が範囲外です。"
63090 goto rewrite2:
63100 endif
63110 endif
63120 endif
63130 rewrite2:
63140 locate 2,3
63150 color rgb(255,255,255)
63160 print "                                      "
63170 locate 2,3
63180 print "男性の生まれた日(1月~31月):"+buf_male_Day$
63190 goto Danjyo_Aisyou_Input_Male_Born_Day2:
63200 end select
63210 'endif
63220 endif
63230 end
63240 '-------生まれた日　女性　ここまで-------------
63250 '1-1.女性の名前を入力
63260 Danjyo_Aisyou_Input_Name_female:
63270 No=0:color RGB(255,255,255)
63280 '入力:キーボード
63290 cls 3:init "kb:2"
63300 '****************************************************************************************************
63310 'WUXG(1920x1200)の時ここから
63320 '****************************************************************************************************
63330 gload Gazo$ + "Screen1.png",0,0,0
63340 gload Gazo$ + "downscreen.png",0,0,800
63350 '****************************************************************************************************
63360 'WUXG(1920x1200)の時ここまで
63370 '****************************************************************************************************
63380 play "":color rgb(255,0,0):female_name$ = ""
63390 locate 0,1
63400 print "女性の相性" + chr$(13) + chr$(13)
63410 color rgb(255,255,255):
63420 locate 0,3
63430 print "女性の相性を求めます。男性の名前を" + chr$(13)
63440 print "入れてください" + chr$(13)
63450 locate 0,15:color rgb(0,0,0)
63460 Input "女性の名前:",female_name$
63470 '-------------------------------------------
63480 '-------生まれた年代　女性 ここから-------------
63490 Danjyo_Aisyou_Input_feMale_Born_Year:
63500 cls 3:play "":count=0:count2=0
63510 'No=-1:Okのとき
63520 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_female_Year$ = "****":buf_female_year = 0
63530 for i=0 to 1
63540 buf_day(i)=0
63550 next i
63560 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
63570 gload Gazo$ + "Screen1.png",0,0,0
63580 gload Gazo$ + "downscreen.png",0,0,800
63590 'Init"kb:4"
63600 '音声ファイル再生 2023.06.07
63610 play Voice$ + "Input_Born_Month_Jyoushi_20230831.mp3"
63620 '****************************************************************************************************
63630 'WUXG(1920x1200)の時ここから
63640 '****************************************************************************************************
63650 font 48
63660 '****************************************************************************************************
63670 'WUXG(1920x1200)の時ここまで
63680 '****************************************************************************************************
63690 locate 0,1
63700 '文字色：黒　 color rgb(0,0,0)
63710 '文字色:白
63720 color rgb(255,255,255)
63730 print "女性の生まれた年代を入れて下さい" + chr$(13)
63740 '文字色:白
63750 color rgb(255,255,255)
63760 locate 1,3
63770 '文字色:白
63780 print "女性の生まれた年代(西暦4桁):" + buf_female_Year$
63790 color rgb(255,255,255)
63800 'locate 4,6:print ":7"
63810 'locate 9,6:print ":8"
63820 'locate 12,6:print ":9"
63830 locate 4,6
63840 '文字色:赤
63850 print ":7  :8  :9" + chr$(13)
63860 color rgb(255,255,255)
63870 locate 4,8
63880 print ":4  :5  :6" + chr$(13)
63890 color rgb(255,255,255)
63900 locate 4,10
63910 print ":1  :2  :3" + chr$(13)
63920 locate 4,12
63930 print "    :0"
63940 locate 12,12
63950 color rgb(0,0,255)
63960 print ":Ok"
63970 sp_on 4,0: sp_on 5,0:sp_on 6,0
63980 sp_on 7,0:sp_on 8,0:sp_on 9,0
63990 sp_on 10,0:sp_on 11,0:sp_on 12,0
64000 sp_on 13,0:sp_on 14,1
64010 '---------------------------------------------
64020 Danjyo_Aisyou_Input_feMale_Born_Year2:
64030 key$="":bg=0:y=0:y2=0:bg2=0:
64040 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
64050 key$ = inkey$
64060 bg = strig(1)
64070 y = stick(1)
64080 y2 = stick(0)
64090 bg2=strig(0)
64100 pause 200
64110 wend
64120 '十字キー　ここから
64130 '上の矢印　または、十字キー上
64140 if ((y = -1) or (key$ = chr$(30))) then
64150 select case No
64160 'No=-1:okのとき:初期の状態
64170 '0kボタンから３に移動
64180 '上に行く 処理
64190 case -1:
64200 No=3:sp_on 12,1:sp_on 14,0
64210 pause 200:gotoDanjyo_Aisyou_Input_feMale_Born_Year2:
64220 '選択肢:3
64230 '3ボタンから 6に移動
64240 case 3:
64250 No=6:sp_on 12,0:sp_on 11,1
64260 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
64270 '6ボタンから ９に移動
64280 case 6:
64290 No=9:sp_on 10,1:sp_on 11,0
64300 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
64310 '6ボタンから ９に移動　ここまで
64320 '9で上を押して何もしない
64330 case 9:
64340 '何もしない
64350 No=9
64360 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
64370 '9で上を押しても何もしない　ここまで
64380 '上　 0ボタンから2ボタン
64390 'sp_on 6,1:1
64400 'sp_on 8,1:5
64410 'sp_on 7,1:7
64420 case 0:
64430 No=2:sp_on 13,0:sp_on 9,1:
64440 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
64450 '上  0ボタンから2ボタン　ここまで
64460 '2から５になる 上
64470 case 2:
64480 No=5:sp_on 8,1:sp_on 9,0:
64490 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
64500 case 5:
64510 No=8:sp_on 7,1:sp_on 8,0
64520 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
64530 case 8:
64540 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
64550 case 1:
64560 No=4:sp_on 5,1:sp_on 6,0
64570 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
64580 case 4:
64590 No=7:sp_on 4,1:sp_on 5,0
64600 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
64610 case 7:
64620 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
64630 end select
64640 endif
64650 '左３　ここまで
64660 '下の矢印
64670 '中央 2
64680 if ((y=1) or (key$ = chr$(31))) then
64690 select case No
64700 '9から６に下げる
64710 case 9:
64720 No=6:sp_on 11,1:sp_on 10,0
64730 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
64740 '6から３に下げる
64750 case 6:
64760 No=3:sp_on 12,1:sp_on 11,0
64770 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
64780 '3から０ｋに変える
64790 case 3:
64800 No=-1:sp_on 14,1:sp_on 12,0
64810 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
64820 'Okから下のボタンを押しても何もしない
64830 case -1:
64840 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
64850 case 8:
64860 No=5:sp_on 8,1:sp_on 7,0
64870 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
64880 case 5:
64890 No=2:sp_on 9,1:sp_on 8,0
64900 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
64910 case 2:
64920 No=0:sp_on 13,1:sp_on 9,0
64930 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
64940 case 0:
64950 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
64960 case 7:
64970 No=4:sp_on 5,1:sp_on 4,0
64980 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
64990 case 4:
65000 No=1:sp_on 6,1:sp_on 5,0
65010 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65020 case 1:
65030 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65040 end select
65050 endif
65060 '左へボタン 十字キー　左　or 　カーソル左
65070 if ((y2 = -1) or (key$ = chr$(29))) then
65080 select case No
65090 'Ok ボタン  Okから　左　０に行く
65100 case -1:
65110 No=0:sp_on 13,1:sp_on 14,0
65120 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65130 '0 ボタン  左　何もしない
65140 case 0:
65150 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65160 case 3:
65170 No=2:sp_on 9,1:sp_on 12,0:
65180 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65190 case 2:
65200 No=1:sp_on 6,1:sp_on 9,0:
65210 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65220 case 1:
65230 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65240 case 6:
65250 No=5:sp_on 8,1:sp_on 11,0
65260 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65270 case 5:
65280 No=4:sp_on 5,1:sp_on 8,0
65290 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65300 case 4:
65310 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65320 case 9:
65330 No=8:sp_on 7,1:sp_on 10,0
65340 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65350 case 8:
65360 No=7:sp_on 4,1:sp_on 7,0
65370 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65380 case 7:
65390 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65400 end select
65410 endif
65420 '右  十字キー　右　or カーソル　右
65430 if ((y2 = 1) or (key$ = chr$(28))) then
65440 select case No
65450 '0ボタンからokボタン右に移動
65460 case 0:
65470 No=-1:sp_on 14,1:sp_on 13,0
65480 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65490 '0ボタンからokボタン 右に移動　ここまで
65500 'OKボタンで右を押して何もしない
65510 case -1:
65520 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65530 case 1:
65540 No=2:sp_on 9,1:sp_on 6,0
65550 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65560 case 2:
65570 No=3:sp_on 12,1:sp_on 9,0
65580 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65590 case 3:
65600 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65610 case 4:
65620 No=5:sp_on 8,1:sp_on 5,0
65630 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65640 case 5:
65650 No=6:sp_on 11,1:sp_on 8,0
65660 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65670 case 7:
65680 No=8:sp_on 7,1:sp_on 4,0
65690 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65700 case 8:
65710 No=9:sp_on 10,1:sp_on 7,0
65720 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65730 case 9:
65740 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65750 case 6:
65760 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65770 end select
65780 'Okから右ボタンを押して何もしない ここまで
65790 endif
65800 '十字キー　ここまで
65810 '==============================
65820 'ここから
65830 '==============================
65840 if ((bg = 2) or (key$ = chr$(13))) then
65850 select case count
65860 case 0:
65870 count = 1
65880 if (No = -1) then
65890 count = 0:No=0
65900 buf_feMale_Born_Day(0) = No
65910 'Okボタンを押したとき
65920 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
65930 else
65940 'Okボタン以外が押されたとき
65950 if (No >= 1 and No <= 2) then
65960 buf_female_year$="":buf_female_year$ = str$(No) + "***"
65970 buf_female_year = No:a= No
65980 buf_Jyoushi_Born_Day(0) = No
65990 locate 1,3
66000 color rgb(255,255,255)
66010 print "女性の生まれた年代(西暦4桁):";buf_female_year$
66020 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66030 else
66040 count=0
66050 ui_msg"数字が範囲外になります。"
66060 buf_female_year$="":buf_female_year=0
66070 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66080 endif
66090 endif
66100 case 1:
66110 count = 2
66120 if (No = -1) then
66130 count = 1
66140 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66150 else
66160 buf_female_year = a * 10 + No
66170 b=buf_female_year
66180 buf_year$ = str$(buf_female_year) + "**"
66190 buf_Jyoushi_Born_Day(0)=buf_female_year
66200 locate 1,3
66210 color rgb(255,255,255)
66220 print "                                                                "
66230 locate 1,3
66240 print "女性の生まれた年代(西暦4桁):" + buf_female_year$
66250 'if (No = -1) then
66260 'count=1
66270 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66280 endif
66290 case 2:
66300 count=3
66310 if (No=-1) then
66320 count =2
66330 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66340 else
66350 buf_female_year = b * 10 + No
66360 c=buf_female_year
66370 buf_female_year$ = str$(buf_female_year) + "*"
66380 buf_Jyoushi_Born_Day(0) = buf_female_year
66390 locate 1,3
66400 color rgb(255,255,255)
66410 print "                                        "
66420 locate 1,3
66430 print "女性の生まれた年代(西暦4桁):";buf_female_year$
66440 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66450 endif
66460 case 3:
66470 count=4
66480 if (No = -1) then
66490 No=0
66500 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66510 else
66520 buf_female_year = c * 10 + No
66530 buf_female_year$ = str$(buf_female_year)
66540 buf_Jyoushi_Born_Day(0) = buf_female_year
66550 locate 1,3
66560 color RGB(255,255,255)
66570 print "                                      "
66580 locate 1,3
66590 print "女性の生まれた年代(西暦4桁):";buf_female_year$
66600 buf_female_year=val(buf_female_year$)
66610 'year=val(buf_year$)
66620 'if (No=-1) then
66630 'goto Input_Born_Month:
66640 'else
66650 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66660 endif
66670 case 4:
66680 'bufyear=buf_year
66690 if (No=-1) then
66700 buf_female_year = val(buf_female_year$)
66710 buf_Jyoushi_Born_Day(0)=buf_female_year
66720 sp_on 14,0:No=0
66730 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66740 else
66750 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66760 endif
66770 end select
66780 endif
66790 '===========================
66800 'ここまでを部下のところにコピーする.
66810 '===========================
66820 if (bg2 = 2) then
66830 select case count2
66840 case 0:
66850 if (No = -1) then
66860 buf_female_year=0:buf_female_year$=trim$(""):buf_female_year$=trim$("****")
66870 count=0
66880 locate 1,3
66890 color rgb(255,255,255)
66900 print "                                      "
66910 locate 1,3
66920 print "女性の生まれた年代（西暦4桁):" + buf_female_year$
66930 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
66940 else
66950 '(buf_year=0) then
66960 buf_female_year=0:buf_year$="****"
66970 locate 1,3
66980 print "                                       "
66990 locate 1,3
67000 print "女性の生まれた年代(西暦4桁):"+buf_female_year$
67010 goto Danjyo_Aisyou_Input_feMale_Born_Year2:
67020 'endif
67030 endif
67040 end select
67050 endif
67060 '-------生まれた年代　女性 ここまで-------------
67070 '-------生まれた月　女性 ここまで--------------
67080 Danjyo_Aisyou_Input_feMale_Born_Month:
67090 cls 3:play "":count=0:count2=0
67100 'No=-1:Okのとき
67110 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_female_Month$ = "**":buf_female_month=0
67120 for i=0 to 1
67130 buf_month(i)=0
67140 next i
67150 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
67160 '****************************************************************************************************
67170 'WUXG(1920x1200)の時ここから
67180 '****************************************************************************************************
67190 gload Gazo$ + "Screen1.png",0,0,0
67200 gload Gazo$ + "downscreen.png",0,0,800
67210 '****************************************************************************************************
67220 'WUXG(1920x1200)の時ここから
67230 '****************************************************************************************************
67240 'Init"kb:4"
67250 '音声ファイル再生 2023.06.07
67260 play Voice$ + "Input_Born_Month_Jyoushi_20230831.mp3"
67270 font 48
67280 locate 0,1
67290 '文字色：黒　 color rgb(0,0,0)
67300 '文字色:白
67310 color rgb(255,255,255)
67320 print "女性の生まれた月を入れて下さい" + chr$(13)
67330 '文字色:白
67340 color rgb(255,255,255)
67350 locate 1,3
67360 '文字色:白
67370 print "女性の生まれた月(1月~12月):"+buf_female_Month$
67380 color rgb(255,255,255)
67390 'locate 4,6:print ":7"
67400 'locate 9,6:print ":8"
67410 'locate 12,6:print ":9"
67420 locate 4,6
67430 '文字色:赤
67440 print ":7  :8  :9" + chr$(13)
67450 color rgb(255,255,255)
67460 locate 4,8
67470 print ":4  :5  :6" + chr$(13)
67480 color rgb(255,255,255)
67490 locate 4,10
67500 print ":1  :2  :3" + chr$(13)
67510 locate 4,12
67520 print "    :0"
67530 locate 12,12
67540 color rgb(0,0,255)
67550 print ":Ok"
67560 sp_on 4,0: sp_on 5,0:sp_on 6,0
67570 sp_on 7,0:sp_on 8,0:sp_on 9,0
67580 sp_on 10,0:sp_on 11,0:sp_on 12,0
67590 sp_on 13,0:sp_on 14,1
67600 '---------------------------------------------
67610 Danjyo_Aisyou_Input_feMale_Born_Month2:
67620 key$="":bg=0:y=0:y2=0:bg2=0
67630 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
67640 key$ = inkey$
67650 bg = strig(1)
67660 y = stick(1)
67670 y2 = stick(0)
67680 bg2 = strig(0)
67690 pause 200
67700 wend
67710 '十字キー　ここから
67720 '上の矢印　または、十字キー上
67730 if ((y = -1) or (key$ = chr$(30))) then
67740 select case No
67750 'No=-1:okのとき:初期の状態
67760 '0kボタンから３に移動
67770 '上に行く 処理
67780 case -1:
67790 No=3:sp_on 12,1:sp_on 14,0
67800 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
67810 '選択肢:3
67820 '3ボタンから 6に移動
67830 case 3:
67840 No=6:sp_on 12,0:sp_on 11,1
67850 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
67860 '6ボタンから ９に移動
67870 case 6:
67880 No=9:sp_on 10,1:sp_on 11,0
67890 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
67900 '6ボタンから ９に移動　ここまで
67910 '9で上を押して何もしない
67920 case 9:
67930 '何もしない
67940 No=9
67950 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
67960 '9で上を押しても何もしない　ここまで
67970 '上　 0ボタンから2ボタン
67980 'sp_on 6,1:1
67990 'sp_on 8,1:5
68000 'sp_on 7,1:7
68010 case 0:
68020 No=2:sp_on 13,0:sp_on 9,1:
68030 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68040 '上  0ボタンから2ボタン　ここまで
68050 '2から５になる 上
68060 case 2:
68070 No=5:sp_on 8,1:sp_on 9,0:
68080 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68090 case 5:
68100 No=8:sp_on 7,1:sp_on 8,0
68110 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68120 case 8:
68130 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68140 case 1:
68150 No=4:sp_on 5,1:sp_on 6,0
68160 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68170 case 4:
68180 No=7:sp_on 4,1:sp_on 5,0
68190 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68200 case 7:
68210 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68220 end select
68230 endif
68240 '左３　ここまで
68250 '下の矢印
68260 '中央 2
68270 if ((y=1) or (key$ = chr$(31))) then
68280 select case No
68290 '9から６に下げる
68300 case 9:
68310 No=6:sp_on 11,1:sp_on 10,0
68320 pause 200:goto　Danjyo_Aisyou_Input_feMale_Born_Month2:
68330 '6から３に下げる
68340 case 6:
68350 No=3:sp_on 12,1:sp_on 11,0
68360 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68370 '3から０ｋに変える
68380 case 3:
68390 No=-1:sp_on 14,1:sp_on 12,0
68400 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68410 'Okから下のボタンを押しても何もしない
68420 case -1:
68430 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68440 case 8:
68450 No=5:sp_on 8,1:sp_on 7,0
68460 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68470 case 5:
68480 No=2:sp_on 9,1:sp_on 8,0
68490 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68500 case 2:
68510 No=0:sp_on 13,1:sp_on 9,0
68520 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68530 case 0:
68540 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68550 case 7:
68560 No=4:sp_on 5,1:sp_on 4,0
68570 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68580 case 4:
68590 No=1:sp_on 6,1:sp_on 5,0
68600 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68610 case 1:
68620 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68630 end select
68640 endif
68650 '左へボタン 十字キー　左　or 　カーソル左
68660 if ((y2 = -1) or (key$ = chr$(29))) then
68670 select case No
68680 'Ok ボタン  Okから　左　０に行く
68690 case -1:
68700 No=0:sp_on 13,1:sp_on 14,0
68710 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68720 '0 ボタン  左　何もしない
68730 case 0:
68740 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68750 case 3:
68760 No=2:sp_on 9,1:sp_on 12,0:
68770 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68780 case 2:
68790 No=1:sp_on 6,1:sp_on 9,0:
68800 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68810 case 1:
68820 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68830 case 6:
68840 No=5:sp_on 8,1:sp_on 11,0
68850 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68860 case 5:
68870 No=4:sp_on 5,1:sp_on 8,0
68880 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68890 case 4:
68900 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68910 case 9:
68920 No=8:sp_on 7,1:sp_on 10,0
68930 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68940 case 8:
68950 No=7:sp_on 4,1:sp_on 7,0
68960 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68970 case 7:
68980 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
68990 end select
69000 endif
69010 '右  十字キー　右　or カーソル　右
69020 if ((y2 = 1) or (key$ = chr$(28))) then
69030 select case No
69040 '0ボタンからokボタン右に移動
69050 case 0:
69060 No=-1:sp_on 14,1:sp_on 13,0
69070 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69080 '0ボタンからokボタン 右に移動　ここまで
69090 'OKボタンで右を押して何もしない
69100 case -1:
69110 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69120 case 1:
69130 No=2:sp_on 9,1:sp_on 6,0
69140 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69150 case 2:
69160 No=3:sp_on 12,1:sp_on 9,0
69170 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69180 case 3:
69190 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69200 case 4:
69210 No=5:sp_on 8,1:sp_on 5,0
69220 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69230 case 5:
69240 No=6:sp_on 11,1:sp_on 8,0
69250 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69260 case 7:
69270 No=8:sp_on 7,1:sp_on 4,0
69280 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69290 case 8:
69300 No=9:sp_on 10,1:sp_on 7,0
69310 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69320 case 9:
69330 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69340 case 6:
69350 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69360 end select
69370 'Okから右ボタンを押して何もしない ここまで
69380 endif
69390 '十字キー　ここまで
69400 '右の丸ボタン + Enter key 決定キー
69410 if ((bg=2) or (key$=chr$(13))) then
69420 select case count
69430 case 0:
69440 if (No=-1) then No=0
69450 count = 1:buf_female_Month$ = "**":buf_female_Month$ = str$(No):buf_female_month = No:c=No
69460 if (buf_female_month > 1 and buf_female_month < 10)  then
69470 buf_female_Month$ = str$(buf_female_month)
69480 'buf_month=No
69490 endif
69500 if (buf_female_month = 1)  then
69510 buf_female_Month$ = str$(buf_female_month) + "*"
69520 'c=buf_month
69530 endif
69540 locate 1,3
69550 print "                                     "
69560 color RGB(255,255,255)
69570 locate 1,3
69580 print "女性の生まれた月(1月~12月):" + buf_female_Month$
69590 goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69600 case 1:
69610 count = 2:
69620 'c = val(buf_Month$)
69630 if (No = -1) then
69640 'count=0
69650 No=0
69660 month=buf_female_month
69670 buf_female_month=val(buf_female_Month$)
69680 month=buf_female_month
69690 buf_Jyoushi_Born_Day(1)=month
69700 '生まれた日に飛ぶ
69710 goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69720 else
69730 buf_female_month = c*10 + No
69740 'if (buf_month = 1) then
69750 'buf_Month$ = str$(buf_month)
69760 'endif
69770 buf_female_Month$ = str$(buf_female_month)
69780 buf_Jyoushi_Born_Day(1) = buf_female_month
69790 locate 0,3
69800 print "                                           "
69810 locate 1,3
69820 color Rgb(255,255,255)
69830 print "女性の生まれた月(1月~12月):" + buf_female_Month$
69840 goto Danjyo_Aisyou_Input_feMale_Born_Month2:
69850 endif
69860 case 2:
69870 '==================================
69880 '何もしない
69890 'coun = 2
69900 '==================================
69910 'c= val(buf_Month$)
69920 'buf_month = c*10 + No
69930 'buf_Month$ = str$(buf_month)
69940 'locate 2,3
69950 'print "上司の生まれた月(1月～12月):";buf_Month$
69960 'goto Jyoushi_Input_Born_Month2:
69970 'case 3:
69980 'count=4
69990 'b=val(buf_month$)
70000 'buf_month=c*10+No
70010 'buf_Month$=str$(buf_month)
70020 'locate 2,3
70030 'print "上司の生まれた月(1月～12月):";buf_Month$
70040 'buf_month=val(buf_Month$)
70050 'year=val(buf_year$)
70060 if (No=-1) then
70070 No=0
70080 goto Danjyo_Aisyou_Input_Male_Born_Day:
70090 else
70100 goto Danjyo_Aisyou_Input_Male_Born_Day2:
70110 endif
70120 'case 4:
70130 'bufyear=buf_year
70140 'if (No=-1) then
70150 'buf_month = val(buf_Month$)
70160 'month = buf_month
70170 'sp_on 14,0
70180 'goto Input_Born_Day:
70190 'else
70200 'goto Input_Born_Month2:
70210 'endif
70220 end select
70230 endif
70240 '左の丸ボタン　キャンセル
70250 if (bg2=2) then
70260 select case count2
70270 case 0:
70280 if (No = -1) then
70290 buf_female_month=0:buf_female_Month$="**"
70300 count=0
70310 'goto rewrite2:
70320 else
70330 if ((No >= 1 and No <= 9) or (No >= 10 and No <= 12)) then
70340 buf_female_month = 0:buf_female_Month$ = "**"
70350 locate 0,3
70360 color rgb(255,255,255)
70370 print "                                       "
70380 goto rewrite2:
70390 if (No>12) then
70400 ui_msg"値が範囲外です。"
70410 goto rewrite2:
70420 endif
70430 endif
70440 endif
70450 rewrite2:
70460 locate 2,3
70470 color rgb(255,255,255)
70480 print "                                      "
70490 locate 2,3
70500 print "女性の生まれた月(1月~12月):"+buf_female_Month$
70510 goto Danjyo_Aisyou_Input_feMale_Born_Month2:
70520 end select
70530 'endif
70540 endif
70550 end
70560 '-------生まれた月　女性 ここまで-------------
70570 '-------生まれた日　女性 ここまで-------------
70580 Danjyo_Aisyou_Input_feMale_Born_Day:
70590 cls 3:play "":count=0:count2=0
70600 'No=-1:Okのとき
70610 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_female_Day$ = "**":buf_female_day = 0
70620 for i=0 to 1
70630 buf_female_day(i)=0
70640 next i
70650 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
70660 '****************************************************************************************************
70670 'WUXG(1920x1200)の時ここから
70680 '****************************************************************************************************
70690 gload Gazo$ + "Screen1.png",0,0,0
70700 gload Gazo$ + "downscreen.png",0,0,800
70710 '****************************************************************************************************
70720 'WUXG(1920x1200)の時ここまで
70730 '****************************************************************************************************
70740 'Init"kb:4"
70750 '音声ファイル再生 2023.06.07
70760 play Voice$ + "Input_Born_Month_Jyoushi_20230831.mp3"
70770 font 48
70780 locate 0,1
70790 '文字色：黒　 color rgb(0,0,0)
70800 '文字色:白
70810 color rgb(255,255,255)
70820 print "女性の生まれた日を入れて下さい" + chr$(13)
70830 '文字色:白
70840 color rgb(255,255,255)
70850 locate 1,3
70860 '文字色:白
70870 print "女性の生まれた日(1月~31月):" + buf_female_Day$
70880 color rgb(255,255,255)
70890 'locate 4,6:print ":7"
70900 'locate 9,6:print ":8"
70910 'locate 12,6:print ":9"
70920 locate 4,6
70930 '文字色:赤
70940 print ":7  :8  :9" + chr$(13)
70950 color rgb(255,255,255)
70960 locate 4,8
70970 print ":4  :5  :6" + chr$(13)
70980 color rgb(255,255,255)
70990 locate 4,10
71000 print ":1  :2  :3" + chr$(13)
71010 locate 4,12
71020 print "    :0"
71030 locate 12,12
71040 color rgb(0,0,255)
71050 print ":Ok"
71060 sp_on 4,0: sp_on 5,0:sp_on 6,0
71070 sp_on 7,0:sp_on 8,0:sp_on 9,0
71080 sp_on 10,0:sp_on 11,0:sp_on 12,0
71090 sp_on 13,0:sp_on 14,1
71100 '---------------------------------------------
71110 Danjyo_Aisyou_Input_feMale_Born_Day2:
71120 key$="":bg=0:y=0:y2=0:bg2=0
71130 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
71140 key$ = inkey$
71150 bg = strig(1)
71160 y = stick(1)
71170 y2 = stick(0)
71180 bg2 = strig(0)
71190 pause 200
71200 wend
71210 '十字キー　ここから
71220 '上の矢印　または、十字キー上
71230 if ((y = -1) or (key$ = chr$(30))) then
71240 select case No
71250 'No=-1:okのとき:初期の状態
71260 '0kボタンから３に移動
71270 '上に行く 処理
71280 case -1:
71290 No=3:sp_on 12,1:sp_on 14,0
71300 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
71310 '選択肢:3
71320 '3ボタンから 6に移動
71330 case 3:
71340 No=6:sp_on 12,0:sp_on 11,1
71350 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
71360 '6ボタンから ９に移動
71370 case 6:
71380 No=9:sp_on 10,1:sp_on 11,0
71390 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
71400 '6ボタンから ９に移動　ここまで
71410 '9で上を押して何もしない
71420 case 9:
71430 '何もしない
71440 No=9
71450 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
71460 '9で上を押しても何もしない　ここまで
71470 '上　 0ボタンから2ボタン
71480 'sp_on 6,1:1
71490 'sp_on 8,1:5
71500 'sp_on 7,1:7
71510 case 0:
71520 No=2:sp_on 13,0:sp_on 9,1:
71530 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
71540 '上  0ボタンから2ボタン　ここまで
71550 '2から５になる 上
71560 case 2:
71570 No=5:sp_on 8,1:sp_on 9,0:
71580 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
71590 case 5:
71600 No=8:sp_on 7,1:sp_on 8,0
71610 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
71620 case 8:
71630 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
71640 case 1:
71650 No=4:sp_on 5,1:sp_on 6,0
71660 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
71670 case 4:
71680 No=7:sp_on 4,1:sp_on 5,0
71690 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
71700 case 7:
71710 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
71720 end select
71730 endif
71740 '左３　ここまで
71750 '下の矢印
71760 '中央 2
71770 if ((y=1) or (key$ = chr$(31))) then
71780 select case No
71790 '9から６に下げる
71800 case 9:
71810 No=6:sp_on 11,1:sp_on 10,0
71820 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
71830 '6から３に下げる
71840 case 6:
71850 No=3:sp_on 12,1:sp_on 11,0
71860 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
71870 '3から０ｋに変える
71880 case 3:
71890 No=-1:sp_on 14,1:sp_on 12,0
71900 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
71910 'Okから下のボタンを押しても何もしない
71920 case -1:
71930 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
71940 case 8:
71950 No=5:sp_on 8,1:sp_on 7,0
71960 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
71970 case 5:
71980 No=2:sp_on 9,1:sp_on 8,0
71990 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72000 case 2:
72010 No=0:sp_on 13,1:sp_on 9,0
72020 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72030 case 0:
72040 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72050 case 7:
72060 No=4:sp_on 5,1:sp_on 4,0
72070 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72080 case 4:
72090 No=1:sp_on 6,1:sp_on 5,0
72100 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72110 case 1:
72120 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72130 end select
72140 endif
72150 '左へボタン 十字キー　左　or 　カーソル左
72160 if ((y2 = -1) or (key$ = chr$(29))) then
72170 select case No
72180 'Ok ボタン  Okから　左　０に行く
72190 case -1:
72200 No=0:sp_on 13,1:sp_on 14,0
72210 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72220 '0 ボタン  左　何もしない
72230 case 0:
72240 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72250 case 3:
72260 No=2:sp_on 9,1:sp_on 12,0:
72270 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72280 case 2:
72290 No=1:sp_on 6,1:sp_on 9,0:
72300 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72310 case 1:
72320 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72330 case 6:
72340 No=5:sp_on 8,1:sp_on 11,0
72350 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72360 case 5:
72370 No=4:sp_on 5,1:sp_on 8,0
72380 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72390 case 4:
72400 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72410 case 9:
72420 No=8:sp_on 7,1:sp_on 10,0
72430 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72440 case 8:
72450 No=7:sp_on 4,1:sp_on 7,0
72460 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72470 case 7:
72480 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72490 end select
72500 endif
72510 '右  十字キー　右　or カーソル　右
72520 if ((y2 = 1) or (key$ = chr$(28))) then
72530 select case No
72540 '0ボタンからokボタン右に移動
72550 case 0:
72560 No=-1:sp_on 14,1:sp_on 13,0
72570 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72580 '0ボタンからokボタン 右に移動　ここまで
72590 'OKボタンで右を押して何もしない
72600 case -1:
72610 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72620 case 1:
72630 No=2:sp_on 9,1:sp_on 6,0
72640 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72650 case 2:
72660 No=3:sp_on 12,1:sp_on 9,0
72670 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72680 case 3:
72690 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72700 case 4:
72710 No=5:sp_on 8,1:sp_on 5,0
72720 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72730 case 5:
72740 No=6:sp_on 11,1:sp_on 8,0
72750 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72760 case 7:
72770 No=8:sp_on 7,1:sp_on 4,0
72780 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72790 case 8:
72800 No=9:sp_on 10,1:sp_on 7,0
72810 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72820 case 9:
72830 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72840 case 6:
72850 pause 200:goto Danjyo_Aisyou_Input_feMale_Born_Day2:
72860 end select
72870 'Okから右ボタンを押して何もしない ここまで
72880 endif
72890 '十字キー　ここまで
72900 '右の丸ボタン + Enter key 決定キー
72910 if ((bg=2) or (key$=chr$(13))) then
72920 select case count
72930 case 0:
72940 if (No=-1) then No=0
72950 count = 1:buf_female_Day$ = "**":buf_female_Day$ = str$(No):buf_female_day = No:c=No
72960 if (buf_female_day > 1 and buf_female_day < 10)  then
72970 buf_female_Day$ = str$(buf_female_day)
72980 'buf_month=No
72990 endif
73000 if (buf_female_day = 1)  then
73010 buf_female_Day$ = str$(buf_female_day) + "*"
73020 'c=buf_month
73030 endif
73040 locate 1,3
73050 print "                                     "
73060 color RGB(255,255,255)
73070 locate 1,3
73080 print "女性の生まれた日(1月~31月):" + buf_female_Day$
73090 goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73100 case 1:
73110 count = 2:
73120 'c = val(buf_Month$)
73130 if (No = -1) then
73140 'count=0
73150 No=0
73160 day=buf_female_day
73170 buf_female_day=val(buf_female_day$)
73180 day=bu_female_day
73190 buf_female_day(1)=day
73200 '生まれた日に飛ぶ
73210 goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73220 else
73230 bu_female_day = c*10 + No
73240 'if (buf_month = 1) then
73250 'buf_Month$ = str$(buf_month)
73260 'endif
73270 buf_female_day$ = str$(buf_female_day)
73280 buf_female_day(1) = buf_female_day
73290 locate 0,3
73300 print "                                           "
73310 locate 1,3
73320 color Rgb(255,255,255)
73330 print "女性の生まれた日(1月~31月):" + buf_female_Day$
73340 goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73350 endif
73360 case 2:
73370 '==================================
73380 '何もしない
73390 'coun = 2
73400 '==================================
73410 'c= val(buf_Month$)
73420 'buf_month = c*10 + No
73430 'buf_Month$ = str$(buf_month)
73440 'locate 2,3
73450 'print "上司の生まれた月(1月～12月):";buf_Month$
73460 'goto Jyoushi_Input_Born_Month2:
73470 'case 3:
73480 'count=4
73490 'b=val(buf_month$)
73500 'buf_month=c*10+No
73510 'buf_Month$=str$(buf_month)
73520 'locate 2,3
73530 'print "上司の生まれた月(1月～12月):";buf_Month$
73540 'buf_month=val(buf_Month$)
73550 'year=val(buf_year$)
73560 if (No=-1) then
73570 No=0
73580 goto Danjyo_Aisyou_Input_Male_Born_Day:
73590 else
73600 goto Danjyo_Aisyou_Input_feMale_Born_Day2:
73610 endif
73620 'case 4:
73630 'bufyear=buf_year
73640 'if (No=-1) then
73650 'buf_month = val(buf_Month$)
73660 'month = buf_month
73670 'sp_on 14,0
73680 'goto Input_Born_Day:
73690 'else
73700 'goto Input_Born_Month2:
73710 'endif
73720 end select
73730 endif
73740 '左の丸ボタン　キャンセル
73750 if (bg2=2) then
73760 select case count2
73770 case 0:
73780 if (No = -1) then
73790 buf_female_day=0:buf_female_Day$="**"
73800 count=0
73810 'goto rewrite2:
73820 else
73830 if ((No >= 1 and No <= 9) or (No >= 10 and No <= 12)) then
73840 buf_female_day = 0:buf_female_Day$ = "**"
73850 locate 0,3
73860 color rgb(255,255,255)
73870 print "                                       "
73880 goto rewrite2:
73890 if (No>12) then
73900 ui_msg"値が範囲外です。"
73910 goto rewrite2:
73920 endif
73930 endif
73940 endif
73950 rewrite2:
73960 locate 2,3
73970 color rgb(255,255,255)
73980 print "                                      "
73990 locate 2,3
74000 print "女性の生まれた日(1月~31月):"+buf_female_Day$
74010 goto Danjyo_Aisyou_Input_feMale_Born_Day2:
74020 end select
74030 'endif
74040 endif
74050 end
74060 '-------生まれた日　女性 ここまで-------------
74070 '1.男女の相性 ここまで
74080 '2.ビジネスの相性　
74090 '1.1人目のビジネスの相性　名前入力　1人目
74100 Business_Aishou_Input_1_parson:
74110 No=0:color RGB(255,255,255)
74120 cls 3:init "kb:2"
74130 '****************************************************************************************************
74140 'WUXG(1920x1200)の時ここから
74150 '****************************************************************************************************
74160 gload Gazo$ + "Screen1.png",0,0,0
74170 gload Gazo$ + "downscreen.png",0,0,800
74180 '****************************************************************************************************
74190 'WUXG(1920x1200)の時ここまで
74200 '****************************************************************************************************
74210 play "":color rgb(255,0,0):name$ = ""
74220 locate 0,1
74230 print "ビジネスの相性 1人目" + chr$(13) + chr$(13)
74240 color rgb(255,255,255):
74250 locate 0,3
74260 print "ビジネスの相性を求めます。1人目の名前を" + chr$(13)
74270 print "入れてください" + chr$(13)
74280 locate 0,15:color rgb(0,0,0)
74290 Input "1人目の名前:",name$
74300 'color rgb(0,0,0)
74310 'locate 0,13:print "                                     "
74320 'locate 0,13:print "1人目の名前を入力してエンターキー":
74330 'buffer_name$(0):1人目の名前
74340 buffer_name$(0) = name$:
74350 goto Business_Aishou_Input_2_Parson:
74360 '2.2人目のビジネスの相性 名前入力 2人目
74370 Business_Aishou_Input_2_Parson:
74380 cls 3:init "kb:2":name$ = "":No=0
74390 '****************************************************************************************************
74400 'WUXG(1920x1200)の時ここから
74410 '****************************************************************************************************
74420 gload Gazo$ + "Screen1.png",0,0,0
74430 gload Gazo$ + "downscreen.png",0,0,800
74440 '****************************************************************************************************
74450 'WUXG(1920x1200)の時ここまで
74460 '****************************************************************************************************
74470 color rgb(255,0,0)
74480 'Title
74490 locate 0,1
74500 print "ビジネスの相性　2人目"
74510 locate 0,3
74520 color rgb(255,255,255)
74530 print "ビジネスの相性を求めます。2人目の名前を" + chr$(13)
74540 print "入れてください" + chr$(13)
74550 locate 0,15:color rgb(0,0,0)
74560 Input "2人目の名前:",name$
74570 'color rgb(0,0,0)
74580 'locate 0,15:print "                                              "
74590 'locate 0,15:print "2人目の名前を入力してエンター ":
74600 '2人目
74610 '2人目の名前を入れるに代入
74620 buffer_name$(1) = name$:
74630 goto Select_jyoushi:
74640 '3.上司の選択
74650 Select_jyoushi:
74660 '****************************************************************************************************
74670 'WUXG(1920x1200)の時ここから
74680 '****************************************************************************************************
74690 cls 3:gload Gazo$ + "Screen1.png",0,0,0
74700 gload Gazo$ + "downscreen.png",0,0,800
74710 '****************************************************************************************************
74720 'WUXG(1920x1200)の時ここまで
74730 '****************************************************************************************************
74740 init "kb:4":No=0
74750 color rgb(0,0,255)
74760 locate 1,1
74770 print "上司の選択"
74780 color rgb(255,255,255)
74790 locate 0,4:print "名前から上司の方を選んでください"
74800 locate 0,6
74810 print " :";buffer_name$(0);"が上 司";chr$(13)
74820 locate 0,8
74830 print " :";buffer_name$(1);"が上 司";chr$(13)
74840 locate 0,15:
74850 print "                                     "
74860 locate 0,15:color rgb(0,0,0)
74870 print "上司の方を選んで右の丸ボタン"
74880 sp_on 0,1:sp_on 1,0:sp_on 2,0
74890 Select_jyoushi2:
74900 'ここでNo=0をおいてはいけない
74910 y=0:key$="":bg=0:
74920 while ((key$ <> chr$(13)) and (y <> 1) and (y <> -1) and (bg <> 2))
74930 y = stick(1)
74940 key$ = inkey$
74950 bg = strig(1)
74960 pause 5
74970 wend
74980 '1.カーソル下の処理　or 十字キーの下処理
74990 if ((key$ = chr$(31)) or (y = 1)) then
75000 select case No
75010 case 0:
75020 No=1:sp_on 1,1:sp_on 0,0:pause 200:goto Select_jyoushi2:'上司の方を選択
75030 case 1:
75040 No=0:sp_on 0,1:sp_on 1,0:pause 200:goto Select_jyoushi2:'上司の方を選択
75050 end select
75060 endif
75070 '2.カーソル上処理　or 十字キーの上の処理
75080 if ((key$ = chr$(30)) or (y = -1)) then
75090 select case No
75100 case 0:
75110 No=1:sp_on 1,1:sp_on 0,0:pause 200:goto Select_jyoushi2:
75120 case 1:
75130 No=0:sp_on 0,1:sp_on 1,0:pause 200:goto Select_jyoushi2:
75140 end select
75150 endif
75160 if ((key$ = chr$(13)) or (bg = 2)) then
75170 select case No
75180 case 0:
75190 '上司(name1)を配列に代入
75200 buffer_name$(2) = buffer_name$(0):cls 3:color rgb(255,255,255):print buffer_name$(2);chr$(13):sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:goto Jyoushi_Input_Seireki:
75210 case 1:
75220 '上司（name2)を配列に代入
75230 buffer_name$(2) = buffer_name$(1):print buffer_name$(2);chr$(13):sp_on 0,0:sp_on 1,0:sp_on 2,0:sp_on 3,0:goto Jyoushi_Input_Seireki:
75240 end select
75250 endif
75260 '3.決定ボタン　Enter or 右の丸ボタン
75270 '1.誕生日入力
75280 '1-1.生まれた年を入力
75290 'Jyoushi_born_year:
75300 'cls 3:gload Gazo$ + "Screen1.png",0,0,0
75310 '---------------------------------------------'
75320 '誕生日入力(生れた年代)
75330 Jyoushi_Input_Seireki:
75340 'buf_Jyoushi_Born_Year:上司の生まれた年代
75350 'buf_Jyoushi_Born_Day(0) = born_year
75360 cls 3:play "":count=0:count2=0
75370 init"kb:4"
75380 'No=-1:Okのとき
75390 :key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_year$ = "****"
75400 for i=0 to 3
75410 buf_Jyoushi_Born_Day(i)=0
75420 next i
75430 '****************************************************************************************************
75440 'WUXG(1920x1200)の時ここから
75450 '****************************************************************************************************
75460 gload Gazo$ + "Screen2.png",0,0,0
75470 gload Gazo$ + "downscreen.png",0,0,800
75480 '****************************************************************************************************
75490 'WUXG(1920x1200)の時ここまで
75500 '****************************************************************************************************
75510 'Init"kb:2"
75520 '音声ファイル再生 2023.06.07
75530 play Voice$ + "Input_Born_Year_Jyoushi_20230831.mp3"
75540 font 48
75550 locate 0,1
75560 '文字色：黒　 color rgb(0,0,0)
75570 color rgb(255,255,255)
75580 print "上司の生まれた年代を入れて下さい" + chr$(13)
75590 color rgb(255,255,255)
75600 locate 1,3
75610 print "上司の生まれた年代(西暦4桁):";buf_year$
75620 color rgb(255,255,255)
75630 'locate 4,6:print ":7"
75640 'locate 9,6:print ":8"
75650 'locate 12,6:print ":9"
75660 'locate 4,6
75670 'print ":7  :8  :9" + chr$(13)
75680 'color rgb(255,255,255)
75690 'locate 4,8
75700 'print ":4  :5  :6" + chr$(13)
75710 'color rgb(255,255,255)
75720 'locate 4,10
75730 'print ":1  :2  :3" + chr$(13)
75740 'locate 4,12
75750 'print "    :0"
75760 'locate 12,12
75770 'color rgb(0,0,255)
75780 'print ":Ok"
75790 sp_on 4,0: sp_on 5,0:sp_on 6,0
75800 sp_on 7,0:sp_on 8,0:sp_on 9,0
75810 sp_on 10,0:sp_on 11,0:sp_on 12,0
75820 sp_on 13,0:sp_on 14,1
75830 Jyoushi_Input_Seireki2:
75840 key$="":bg=0:y=0:y2=0:bg2=0:
75850 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
75860 key$ = inkey$
75870 bg = strig(1)
75880 y = stick(1)
75890 y2 = stick(0)
75900 bg2=strig(0)
75910 pause 200
75920 wend
75930 '十字キー　ここから
75940 '上の矢印　または、十字キー上
75950 if ((y = -1) or (key$ = chr$(30))) then
75960 select case No
75970 'No=-1:okのとき:初期の状態
75980 '0kボタンから３に移動
75990 '上に行く 処理
76000 case -1:
76010 No=3:sp_on 12,1:sp_on 14,0
76020 pause 200:goto Jyoushi_Input_Seireki2:
76030 '選択肢:3
76040 '3ボタンから 6に移動
76050 case 3:
76060 No=6:sp_on 12,0:sp_on 11,1
76070 pause 200:goto Jyoushi_Input_Seireki2:
76080 '6ボタンから ９に移動
76090 case 6:
76100 No=9:sp_on 10,1:sp_on 11,0
76110 pause 200:goto Jyoushi_Input_Seireki2:
76120 '6ボタンから ９に移動　ここまで
76130 '9で上を押して何もしない
76140 case 9:
76150 '何もしない
76160 No=9
76170 pause 200:goto Jyoushi_Input_Seireki2:
76180 '9で上を押しても何もしない　ここまで
76190 '上　 0ボタンから2ボタン
76200 'sp_on 6,1:1
76210 'sp_on 8,1:5
76220 'sp_on 7,1:7
76230 case 0:
76240 No=2:sp_on 13,0:sp_on 9,1:
76250 pause 200:goto Jyoushi_Input_Seireki2:
76260 '上  0ボタンから2ボタン　ここまで
76270 '2から５になる 上
76280 case 2:
76290 No=5:sp_on 8,1:sp_on 9,0:
76300 pause 200:goto Jyoushi_Input_Seireki2:
76310 case 5:
76320 No=8:sp_on 7,1:sp_on 8,0
76330 pause 200:goto Jyoushi_Input_Seireki2:
76340 case 8:
76350 pause 200:goto Jyoushi_Input_Seireki2:
76360 case 1:
76370 No=4:sp_on 5,1:sp_on 6,0
76380 pause 200:goto Jyoushi_Input_Seireki2:
76390 case 4:
76400 No=7:sp_on 4,1:sp_on 5,0
76410 pause 200:goto Jyoushi_Input_Seireki2:
76420 case 7:
76430 pause 200:goto Jyoushi_Input_Seireki2:
76440 end select
76450 endif
76460 '左３　ここまで
76470 '下の矢印
76480 '中央 2
76490 if ((y=1) or (key$ = chr$(31))) then
76500 select case No
76510 '9から６に下げる
76520 case 9:
76530 No=6:sp_on 11,1:sp_on 10,0
76540 pause 200:goto Jyoushi_Input_Seireki2:
76550 '6から３に下げる
76560 case 6:
76570 No=3:sp_on 12,1:sp_on 11,0
76580 pause 200:goto Jyoushi_Input_Seireki2:
76590 '3から０ｋに変える
76600 case 3:
76610 No=-1:sp_on 14,1:sp_on 12,0
76620 pause 200:goto Jyoushi_Input_Seireki2:
76630 'Okから下のボタンを押しても何もしない
76640 case -1:
76650 pause 200:goto Jyoushi_Input_Seireki2:
76660 case 8:
76670 No=5:sp_on 8,1:sp_on 7,0
76680 pause 200:goto Jyoushi_Input_Seireki2:
76690 case 5:
76700 No=2:sp_on 9,1:sp_on 8,0
76710 pause 200:goto Jyoushi_Input_Seireki2:
76720 case 2:
76730 No=0:sp_on 13,1:sp_on 9,0
76740 pause 200:goto Jyoushi_Input_Seireki2:
76750 case 0:
76760 pause 200:goto Jyoushi_Input_Seireki2:
76770 case 7:
76780 No=4:sp_on 5,1:sp_on 4,0
76790 pause 200:goto Jyoushi_Input_Seireki2:
76800 case 4:
76810 No=1:sp_on 6,1:sp_on 5,0
76820 pause 200:goto Jyoushi_Input_Seireki2:
76830 case 1:
76840 pause 200:goto Jyoushi_Input_Seireki2:
76850 end select
76860 endif
76870 '左へボタン 十字キー　左　or 　カーソル左
76880 if ((y2 = -1) or (key$ = chr$(29))) then
76890 select case No
76900 'Ok ボタン  Okから　左　０に行く
76910 case -1:
76920 No=0:sp_on 13,1:sp_on 14,0
76930 pause 200:goto Jyoushi_Input_Seireki2:
76940 '0 ボタン  左　何もしない
76950 case 0:
76960 pause 200:goto Jyoushi_Input_Seireki2:
76970 case 3:
76980 No=2:sp_on 9,1:sp_on 12,0:
76990 pause 200:goto Jyoushi_Input_Seireki2:
77000 case 2:
77010 No=1:sp_on 6,1:sp_on 9,0:
77020 pause 200:goto Jyoushi_Input_Seireki2:
77030 case 1:
77040 pause 200:goto Jyoushi_Input_Seireki2:
77050 case 6:
77060 No=5:sp_on 8,1:sp_on 11,0
77070 pause 200:goto Jyoushi_Input_Seireki2:
77080 case 5:
77090 No=4:sp_on 5,1:sp_on 8,0
77100 pause 200:goto Jyoushi_Input_Seireki2:
77110 case 4:
77120 pause 200:goto Jyoushi_Input_Seireki2:
77130 case 9:
77140 No=8:sp_on 7,1:sp_on 10,0
77150 pause 200:goto Jyoushi_Input_Seireki2:
77160 case 8:
77170 No=7:sp_on 4,1:sp_on 7,0
77180 pause 200:goto Jyoushi_Input_Seireki2:
77190 case 7:
77200 pause 200:goto Jyoushi_Input_Seireki2:
77210 end select
77220 endif
77230 '右  十字キー　右　or カーソル　右
77240 if ((y2 = 1) or (key$ = chr$(28))) then
77250 select case No
77260 '0ボタンからokボタン右に移動
77270 case 0:
77280 No=-1:sp_on 14,1:sp_on 13,0
77290 pause 200:goto Jyoushi_Input_Seireki2:
77300 '0ボタンからokボタン 右に移動　ここまで
77310 'OKボタンで右を押して何もしない
77320 case -1:
77330 pause 200:goto Jyoushi_Input_Seireki2:
77340 case 1:
77350 No=2:sp_on 9,1:sp_on 6,0
77360 pause 200:goto Jyoushi_Input_Seireki2:
77370 case 2:
77380 No=3:sp_on 12,1:sp_on 9,0
77390 pause 200:goto Jyoushi_Input_Seireki2:
77400 case 3:
77410 pause 200:goto Jyoushi_Input_Seireki2:
77420 case 4:
77430 No=5:sp_on 8,1:sp_on 5,0
77440 pause 200:goto Jyoushi_Input_Seireki2:
77450 case 5:
77460 No=6:sp_on 11,1:sp_on 8,0
77470 pause 200:goto Jyoushi_Input_Seireki2:
77480 case 7:
77490 No=8:sp_on 7,1:sp_on 4,0
77500 pause 200:goto Jyoushi_Input_Seireki2:
77510 case 8:
77520 No=9:sp_on 10,1:sp_on 7,0
77530 pause 200:goto Jyoushi_Input_Seireki2:
77540 case 9:
77550 pause 200:goto Jyoushi_Input_Seireki2:
77560 case 6:
77570 pause 200:goto Jyoushi_Input_Seireki2:
77580 end select
77590 'Okから右ボタンを押して何もしない ここまで
77600 endif
77610 '十字キー　ここまで
77620 '==============================
77630 'ここから
77640 '==============================
77650 if ((bg = 2) or (key$ = chr$(13))) then
77660 select case count
77670 case 0:
77680 count = 1
77690 if (No = -1) then
77700 count = 0:No=0
77710 buf_Jyoushi_Born_Day(0) = No
77720 'Okボタンを押したとき
77730 goto Jyoushi_Input_Seireki2:
77740 else
77750 'Okボタン以外が押されたとき
77760 if (No >= 1 and No <= 2) then
77770 buf_year$="":buf_year$ = str$(No) + "***"
77780 buf_year = No:a= No
77790 buf_Jyoushi_Born_Day(0) = No
77800 locate 1,3
77810 color rgb(255,255,255)
77820 print "上司の生まれた年代(西暦4桁):";buf_year$
77830 goto Jyoushi_Input_Seireki2:
77840 else
77850 count=0
77860 ui_msg"数字が範囲外になります。"
77870 buf_year$="":buf_year=0
77880 goto Jyoushi_Input_Seireki2:
77890 endif
77900 endif
77910 case 1:
77920 count = 2
77930 if (No = -1) then
77940 count = 1
77950 goto Jyoushi_Input_Seireki2:
77960 else
77970 buf_year = a * 10 + No
77980 b=buf_year
77990 buf_year$ = str$(buf_year) + "**"
78000 buf_Jyoushi_Born_Day(0)=buf_year
78010 locate 1,3
78020 color rgb(255,255,255)
78030 print "                                                                "
78040 locate 1,3
78050 print "上司の生まれた年代(西暦4桁):" + buf_year$
78060 'if (No = -1) then
78070 'count=1
78080 goto Jyoushi_Input_Seireki2:
78090 endif
78100 case 2:
78110 count=3
78120 if (No=-1) then
78130 count =2
78140 goto Jyoushi_Input_Seireki2:
78150 else
78160 buf_year = b * 10 + No
78170 c=buf_year
78180 buf_year$ = str$(buf_year) + "*"
78190 buf_Jyoushi_Born_Day(0) = buf_year
78200 locate 1,3
78210 color rgb(255,255,255)
78220 print "                                        "
78230 locate 1,3
78240 print "上司の生まれた年代(西暦4桁):";buf_year$
78250 goto Jyoushi_Input_Seireki2:
78260 endif
78270 case 3:
78280 count=4
78290 if (No = -1) then
78300 No=0
78310 goto Jyoushi_Input_Seireki2:
78320 else
78330 buf_year = c * 10 + No
78340 buf_year$ = str$(buf_year)
78350 buf_Jyoushi_Born_Day(0) = buf_year
78360 locate 1,3
78370 color RGB(255,255,255)
78380 print "                                      "
78390 locate 1,3
78400 print "上司の生まれた年代(西暦4桁):";buf_year$
78410 buf_year=val(buf_year$)
78420 'year=val(buf_year$)
78430 'if (No=-1) then
78440 'goto Input_Born_Month:
78450 'else
78460 goto Jyoushi_Input_Seireki2:
78470 endif
78480 case 4:
78490 'bufyear=buf_year
78500 if (No=-1) then
78510 buf_year = val(buf_year$)
78520 buf_Jyoushi_Born_Day(0)=buf_year
78530 sp_on 14,0:No=0
78540 goto Jyoushi_Input_Born_Month:
78550 else
78560 goto Jyoushi_Input_Seireki2:
78570 endif
78580 end select
78590 endif
78600 '===========================
78610 'ここまでを部下のところにコピーする.
78620 '===========================
78630 if (bg2 = 2) then
78640 select case count2
78650 case 0:
78660 if (No = -1) then
78670 buf_year=0:buf_year$=trim$(""):buf_year$=trim$("****")
78680 count=0
78690 locate 1,3
78700 color rgb(255,255,255)
78710 print "                                      "
78720 locate 1,3
78730 print "上司の生まれた年代（西暦4桁):" + buf_year$
78740 goto Jyoushi_Input_Seireki2:
78750 else
78760 '(buf_year=0) then
78770 buf_year=0:buf_year$="****"
78780 locate 1,3
78790 print "                                       "
78800 locate 1,3
78810 print "上司の生まれた年代(西暦4桁):"+buf_year$
78820 goto Jyoushi_Input_Seireki2:
78830 'endif
78840 endif
78850 end select
78860 endif
78870 'Input"上司の生れた年代(4桁,〜2025年):",year
78880 'if year > 2025 then goto Jyoushi_Input_Seireki:
78890 'if year = 123 then cls 3:cls 4:goto Main_Screen:
78900 '"4桁目"
78910 'bufyear4 = fix(year / 1000)
78920 '"3桁目"
78930 'bufyear3 = fix((year - (bufyear4 * 1000)) / 100)
78940 '"2桁目"
78950 'bufyear2 = fix((year - ((bufyear4 * 1000)+(bufyear3*100)))/10)
78960 '"1桁目"
78970 'bufyear1 = fix((year - ((bufyear4*
78980 'bufyear = bufyear1+bufyear2+bufyear3+bufyear4
78990 '2.生まれた月を入力
79000 Jyoushi_Input_Born_Month:
79010 cls 3:play "":count=0:count2=0
79020 'No=-1:Okのとき
79030 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_Month$ = "**":buf_month=0
79040 for i=0 to 1
79050 buf_month(i)=0
79060 next i
79070 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
79080 '****************************************************************************************************
79090 'WUXG(1920x1200)の時ここから
79100 '****************************************************************************************************
79110 gload Gazo$ + "Screen2.png",0,0,0
79120 gload Gazo$ + "downscreen.png",0,0,800
79130 '****************************************************************************************************
79140 'WUXG(1920x1200)の時ここまで
79150 '****************************************************************************************************
79160 'Init"kb:4"
79170 '音声ファイル再生 2023.06.07
79180 play Voice$ + "Input_Born_Month_Jyoushi_20230831.mp3"
79190 font 48
79200 locate 0,1
79210 '文字色：黒　 color rgb(0,0,0)
79220 '文字色:白
79230 color rgb(255,255,255)
79240 print "上司の生まれた月を入れて下さい" + chr$(13)
79250 '文字色:白
79260 color rgb(255,255,255)
79270 locate 1,3
79280 '文字色:白
79290 print "上司の生まれた月(1月~12月):"+buf_Month$
79300 color rgb(255,255,255)
79310 'locate 4,6:print ":7"
79320 'locate 9,6:print ":8"
79330 'locate 12,6:print ":9"
79340 'locate 4,6
79350 '文字色:赤
79360 'print ":7  :8  :9" + chr$(13)
79370 'color rgb(255,255,255)
79380 'locate 4,8
79390 'print ":4  :5  :6" + chr$(13)
79400 'color rgb(255,255,255)
79410 'locate 4,10
79420 'print ":1  :2  :3" + chr$(13)
79430 'locate 4,12
79440 'print "    :0"
79450 'locate 12,12
79460 'color rgb(0,0,255)
79470 'print ":Ok"
79480 sp_on 4,0: sp_on 5,0:sp_on 6,0
79490 sp_on 7,0:sp_on 8,0:sp_on 9,0
79500 sp_on 10,0:sp_on 11,0:sp_on 12,0
79510 sp_on 13,0:sp_on 14,1
79520 Jyoushi_Input_Born_Month2:
79530 key$="":bg=0:y=0:y2=0:bg2=0
79540 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
79550 key$ = inkey$
79560 bg = strig(1)
79570 y = stick(1)
79580 y2 = stick(0)
79590 bg2 = strig(0)
79600 pause 200
79610 wend
79620 '十字キー　ここから
79630 '上の矢印　または、十字キー上
79640 if ((y = -1) or (key$ = chr$(30))) then
79650 select case No
79660 'No=-1:okのとき:初期の状態
79670 '0kボタンから３に移動
79680 '上に行く 処理
79690 case -1:
79700 No=3:sp_on 12,1:sp_on 14,0
79710 pause 200:goto Jyoushi_Input_Born_Month2:
79720 '選択肢:3
79730 '3ボタンから 6に移動
79740 case 3:
79750 No=6:sp_on 12,0:sp_on 11,1
79760 pause 200:goto Jyoushi_Input_Born_Month2:
79770 '6ボタンから ９に移動
79780 case 6:
79790 No=9:sp_on 10,1:sp_on 11,0
79800 pause 200:goto Jyoushi_Input_Born_Month2:
79810 '6ボタンから ９に移動　ここまで
79820 '9で上を押して何もしない
79830 case 9:
79840 '何もしない
79850 No=9
79860 pause 200:goto Jyoushi_Input_Born_Month2:
79870 '9で上を押しても何もしない　ここまで
79880 '上　 0ボタンから2ボタン
79890 'sp_on 6,1:1
79900 'sp_on 8,1:5
79910 'sp_on 7,1:7
79920 case 0:
79930 No=2:sp_on 13,0:sp_on 9,1:
79940 pause 200:goto Jyoushi_Input_Born_Month2:
79950 '上  0ボタンから2ボタン　ここまで
79960 '2から５になる 上
79970 case 2:
79980 No=5:sp_on 8,1:sp_on 9,0:
79990 pause 200:goto Jyoushi_Input_Born_Month2:
80000 case 5:
80010 No=8:sp_on 7,1:sp_on 8,0
80020 pause 200:goto Jyoushi_Input_Born_Month2:
80030 case 8:
80040 pause 200:goto Input_Born_Month2:
80050 case 1:
80060 No=4:sp_on 5,1:sp_on 6,0
80070 pause 200:goto Jyoushi_Input_Born_Month2:
80080 case 4:
80090 No=7:sp_on 4,1:sp_on 5,0
80100 pause 200:goto Jyoushi_Input_Born_Month2:
80110 case 7:
80120 pause 200:goto Input_Born_Month2:
80130 end select
80140 endif
80150 '左３　ここまで
80160 '下の矢印
80170 '中央 2
80180 if ((y=1) or (key$ = chr$(31))) then
80190 select case No
80200 '9から６に下げる
80210 case 9:
80220 No=6:sp_on 11,1:sp_on 10,0
80230 pause 200:goto Jyoushi_Input_Born_Month2:
80240 '6から３に下げる
80250 case 6:
80260 No=3:sp_on 12,1:sp_on 11,0
80270 pause 200:goto Jyoushi_Input_Born_Month2:
80280 '3から０ｋに変える
80290 case 3:
80300 No=-1:sp_on 14,1:sp_on 12,0
80310 pause 200:goto Jyoushi_Input_Born_Month2:
80320 'Okから下のボタンを押しても何もしない
80330 case -1:
80340 pause 200:goto Jyoushi_Input_Born_Month2:
80350 case 8:
80360 No=5:sp_on 8,1:sp_on 7,0
80370 pause 200:goto Jyoushi_Input_Born_Month2:
80380 case 5:
80390 No=2:sp_on 9,1:sp_on 8,0
80400 pause 200:goto Jyoushi_Input_Born_Month2:
80410 case 2:
80420 No=0:sp_on 13,1:sp_on 9,0
80430 pause 200:goto Jyoushi_Input_Born_Month2:
80440 case 0:
80450 pause 200:goto Jyoushi_Input_Born_Month2:
80460 case 7:
80470 No=4:sp_on 5,1:sp_on 4,0
80480 pause 200:goto Jyoushi_Input_Born_Month2:
80490 case 4:
80500 No=1:sp_on 6,1:sp_on 5,0
80510 pause 200:goto Jyoushi_Input_Born_Month2:
80520 case 1:
80530 pause 200:goto Jyoushi_Input_Born_Month2:
80540 end select
80550 endif
80560 '左へボタン 十字キー　左　or 　カーソル左
80570 if ((y2 = -1) or (key$ = chr$(29))) then
80580 select case No
80590 'Ok ボタン  Okから　左　０に行く
80600 case -1:
80610 No=0:sp_on 13,1:sp_on 14,0
80620 pause 200:goto Jyoushi_Input_Born_Month2:
80630 '0 ボタン  左　何もしない
80640 case 0:
80650 pause 200:goto Jyoushi_Input_Born_Month2:
80660 case 3:
80670 No=2:sp_on 9,1:sp_on 12,0:
80680 pause 200:goto Jyoushi_Input_Born_Month2:
80690 case 2:
80700 No=1:sp_on 6,1:sp_on 9,0:
80710 pause 200:goto Jyoushi_Input_Born_Month2:
80720 case 1:
80730 pause 200:goto Jyoushi_Input_Born_Month2:
80740 case 6:
80750 No=5:sp_on 8,1:sp_on 11,0
80760 pause 200:goto Jyoushi_Input_Born_Month2:
80770 case 5:
80780 No=4:sp_on 5,1:sp_on 8,0
80790 pause 200:goto Jyoushi_Input_Born_Month2:
80800 case 4:
80810 pause 200:goto Jyoushi_Input_Born_Month2:
80820 case 9:
80830 No=8:sp_on 7,1:sp_on 10,0
80840 pause 200:goto Input_Born_Month2:
80850 case 8:
80860 No=7:sp_on 4,1:sp_on 7,0
80870 pause 200:goto Jyoushi_Input_Born_Month2:
80880 case 7:
80890 pause 200:goto Jyoushi_Input_Born_Month2:
80900 end select
80910 endif
80920 '右  十字キー　右　or カーソル　右
80930 if ((y2 = 1) or (key$ = chr$(28))) then
80940 select case No
80950 '0ボタンからokボタン右に移動
80960 case 0:
80970 No=-1:sp_on 14,1:sp_on 13,0
80980 pause 200:goto Jyoushi_Input_Born_Month2:
80990 '0ボタンからokボタン 右に移動　ここまで
81000 'OKボタンで右を押して何もしない
81010 case -1:
81020 pause 200:goto Jyoushi_Input_Born_Month2:
81030 case 1:
81040 No=2:sp_on 9,1:sp_on 6,0
81050 pause 200:goto Jyoushi_Input_Born_Month2:
81060 case 2:
81070 No=3:sp_on 12,1:sp_on 9,0
81080 pause 200:goto Jyoushi_Input_Born_Month2:
81090 case 3:
81100 pause 200:goto Jyoushi_Input_Born_Month2:
81110 case 4:
81120 No=5:sp_on 8,1:sp_on 5,0
81130 pause 200:goto Jyoushi_Input_Born_Month2:
81140 case 5:
81150 No=6:sp_on 11,1:sp_on 8,0
81160 pause 200:goto Jyoushi_Input_Born_Month2:
81170 case 7:
81180 No=8:sp_on 7,1:sp_on 4,0
81190 pause 200:goto Jyoushi_Input_Born_Month2:
81200 case 8:
81210 No=9:sp_on 10,1:sp_on 7,0
81220 pause 200:goto Jyoushi_Input_Born_Month2:
81230 case 9:
81240 pause 200:goto Jyoushi_Input_Born_Month2:
81250 case 6:
81260 pause 200:goto Jyoushi_Input_Born_Month2:
81270 end select
81280 'Okから右ボタンを押して何もしない ここまで
81290 endif
81300 '十字キー　ここまで
81310 '右の丸ボタン + Enter key 決定キー
81320 if ((bg=2) or (key$=chr$(13))) then
81330 select case count
81340 case 0:
81350 if (No=-1) then No=0
81360 count = 1:buf_Month$ = "**":buf_Month$ = str$(No):buf_month = No:c=No
81370 if (buf_month > 1 and buf_month < 10)  then
81380 buf_Month$ = str$(buf_month)
81390 'buf_month=No
81400 endif
81410 if (buf_month = 1)  then
81420 buf_Month$ = str$(buf_month) + "*"
81430 'c=buf_month
81440 endif
81450 locate 1,3
81460 print "                                     "
81470 color RGB(255,255,255)
81480 locate 1,3
81490 print "上司の生まれた月(1月~12月):" + buf_Month$
81500 goto Jyoushi_Input_Born_Month2:
81510 case 1:
81520 count = 2:
81530 'c = val(buf_Month$)
81540 if (No = -1) then
81550 'count=0
81560 No=0
81570 month=buf_month
81580 buf_month=val(buf_Month$)
81590 month=buf_month
81600 buf_Jyoushi_Born_Day(1)=month
81610 '生まれた日に飛ぶ
81620 goto Jyoushi_Input_Born_Day:
81630 else
81640 buf_month = c*10 + No
81650 'if (buf_month = 1) then
81660 'buf_Month$ = str$(buf_month)
81670 'endif
81680 buf_Month$ = str$(buf_month)
81690 buf_Jyoushi_Born_Day(1) = buf_month
81700 locate 0,3
81710 print "                                           "
81720 locate 1,3
81730 color Rgb(255,255,255)
81740 print "上司の生まれた月(1月~12月):" + buf_Month$
81750 goto Jyoushi_Input_Born_Month2:
81760 endif
81770 case 2:
81780 '==================================
81790 '何もしない
81800 'coun = 2
81810 '==================================
81820 'c= val(buf_Month$)
81830 'buf_month = c*10 + No
81840 'buf_Month$ = str$(buf_month)
81850 'locate 2,3
81860 'print "上司の生まれた月(1月～12月):";buf_Month$
81870 'goto Jyoushi_Input_Born_Month2:
81880 'case 3:
81890 'count=4
81900 'b=val(buf_month$)
81910 'buf_month=c*10+No
81920 'buf_Month$=str$(buf_month)
81930 'locate 2,3
81940 'print "上司の生まれた月(1月～12月):";buf_Month$
81950 'buf_month=val(buf_Month$)
81960 'year=val(buf_year$)
81970 if (No=-1) then
81980 No=0
81990 goto Jyoushi_Input_Born_Day:
82000 else
82010 goto Jyoushi_Input_Born_Month2:
82020 endif
82030 'case 4:
82040 'bufyear=buf_year
82050 'if (No=-1) then
82060 'buf_month = val(buf_Month$)
82070 'month = buf_month
82080 'sp_on 14,0
82090 'goto Input_Born_Day:
82100 'else
82110 'goto Input_Born_Month2:
82120 'endif
82130 end select
82140 endif
82150 '左の丸ボタン　キャンセル
82160 if (bg2=2) then
82170 select case count2
82180 case 0:
82190 if (No = -1) then
82200 buf_month=0:buf_Month$="**"
82210 count=0
82220 'goto rewrite2:
82230 else
82240 if ((No >= 1 and No <= 9) or (No >= 10 and No <= 12)) then
82250 buf_month = 0:buf_Month$ = "**"
82260 locate 0,3
82270 color rgb(255,255,255)
82280 print "                                       "
82290 goto rewrite2:
82300 if (No>12) then
82310 ui_msg"値が範囲外です。"
82320 goto rewrite2:
82330 endif
82340 endif
82350 endif
82360 rewrite2:
82370 locate 2,3
82380 color rgb(255,255,255)
82390 print "                                      "
82400 locate 2,3
82410 print "上司の生まれた月(1月~12月):"+buf_Month$
82420 goto Jyoushi_Input_Born_Month2:
82430 end select
82440 'endif
82450 endif
82460 end
82470 'end
82480 '生れた日を入力
82490 Jyoushi_Input_Born_Day:
82500 '生まれた日入力
82510 cls 3:play ""
82520 'No=-1:Okのとき
82530 init"kb:4":key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_Day$ = "**":count=0:bg2=0:count2=0
82540 for i=0 to 1
82550 buf_day(i)=0
82560 next i
82570 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
82580 '****************************************************************************************************
82590 'WUXG(1920x1200)の時ここから
82600 '****************************************************************************************************
82610 gload Gazo$ + "Screen2.png",0,0,0
82620 gload Gazo$ + "downscreen.png",0,0,800
82630 '****************************************************************************************************
82640 'WUXG(1920x1200)の時ここまで
82650 '****************************************************************************************************
82660 'Init"kb:2"
82670 '音声ファイル再生 2023.06.07
82680 play Voice$ + "Input_Born_Day_Jyoushi_20230831.mp3"
82690 font 48
82700 locate 1,1
82710 '文字色：黒　 color rgb(0,0,0)
82720 color rgb(255,255,255)
82730 print "上司の生まれた日を入れて下さい" + chr$(13)
82740 locate 1,3
82750 color rgb(255,255,255)
82760 print "                                      "
82770 locate 1,3
82780 print "上司の生まれた日(1日~31日):"+buf_Day$
82790 color rgb(255,255,255)
82800 'locate 4,6:print ":7"
82810 'locate 9,6:print ":8"
82820 'locate 12,6:print ":9"
82830 'locate 4,6
82840 'print ":7  :8  :9" + chr$(13)
82850 'color rgb(255,255,255)
82860 'locate 4,8
82870 'print ":4  :5  :6" + chr$(13)
82880 'color rgb(255,255,255)
82890 'locate 4,10
82900 'print ":1  :2  :3" + chr$(13)
82910 'locate 4,12
82920 'print "    :0"
82930 'locate 12,12
82940 'color rgb(0,0,255)
82950 'print ":Ok"
82960 sp_on 4,0: sp_on 5,0:sp_on 6,0
82970 sp_on 7,0:sp_on 8,0:sp_on 9,0
82980 sp_on 10,0:sp_on 11,0:sp_on 12,0
82990 sp_on 13,0:sp_on 14,1
83000 Jyoushi_Input_Born_Day2:
83010 key$="":bg=0:y=0:y2=0:bg2=0:
83020 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
83030 key$ = inkey$
83040 bg = strig(1)
83050 y = stick(1)
83060 y2 = stick(0)
83070 bg2 = strig(0)
83080 pause 200
83090 wend
83100 '十字キー　ここから
83110 '上の矢印　または、十字キー上
83120 if ((y = -1) or (key$ = chr$(30))) then
83130 select case No
83140 'No=-1:okのとき:初期の状態
83150 '0kボタンから３に移動
83160 '上に行く 処理
83170 case -1:
83180 No=3:sp_on 12,1:sp_on 14,0
83190 pause 200:goto Jyoushi_Input_Born_Day2:
83200 '選択肢:3
83210 '3ボタンから 6に移動
83220 case 3:
83230 No=6:sp_on 12,0:sp_on 11,1
83240 pause 200:goto Jyoushi_Input_Born_Day2:
83250 '6ボタンから ９に移動
83260 case 6:
83270 No=9:sp_on 10,1:sp_on 11,0
83280 pause 200:goto Jyoushi_Input_Born_Day2:
83290 '6ボタンから ９に移動　ここまで
83300 '9で上を押して何もしない
83310 case 9:
83320 '何もしない
83330 No=9
83340 pause 200:goto Jyoushi_Input_Born_Day2:
83350 '9で上を押しても何もしない　ここまで
83360 '上　 0ボタンから2ボタン
83370 'sp_on 6,1:1
83380 'sp_on 8,1:5
83390 'sp_on 7,1:7
83400 case 0:
83410 No=2:sp_on 13,0:sp_on 9,1:
83420 pause 200:goto Jyoushi_Input_Born_Day2:
83430 '上  0ボタンから2ボタン　ここまで
83440 '2から５になる 上
83450 case 2:
83460 No=5:sp_on 8,1:sp_on 9,0:
83470 pause 200:goto Jyoushi_Input_Born_Day2:
83480 case 5:
83490 No=8:sp_on 7,1:sp_on 8,0
83500 pause 200:goto Jyoushi_Input_Born_Day2:
83510 case 8:
83520 pause 200:goto Jyoushi_Input_Born_Day2:
83530 case 1:
83540 No=4:sp_on 5,1:sp_on 6,0
83550 pause 200:goto Jyoushi_Input_Born_Day2:
83560 case 4:
83570 No=7:sp_on 4,1:sp_on 5,0
83580 pause 200:goto Jyoushi_Input_Born_Day2:
83590 case 7:
83600 pause 200:goto Jyoushi_Input_Born_Day2:
83610 end select
83620 endif
83630 '左３　ここまで
83640 '下の矢印
83650 '中央 2
83660 if ((y=1) or (key$ = chr$(31))) then
83670 select case No
83680 '9から６に下げる
83690 case 9:
83700 No=6:sp_on 11,1:sp_on 10,0
83710 pause 200:goto Jyoushi_Input_Born_Day2:
83720 '6から３に下げる
83730 case 6:
83740 No=3:sp_on 12,1:sp_on 11,0
83750 pause 200:goto Jyoushi_Input_Born_Day2:
83760 '3から０ｋに変える
83770 case 3:
83780 No=-1:sp_on 14,1:sp_on 12,0
83790 pause 200:goto Jyoushi_Input_Born_Day2:
83800 'Okから下のボタンを押しても何もしない
83810 case -1:
83820 pause 200:goto Jyoushi_Input_Born_Day2:
83830 case 8:
83840 No=5:sp_on 8,1:sp_on 7,0
83850 pause 200:goto Jyoushi_Input_Born_Day2:
83860 case 5:
83870 No=2:sp_on 9,1:sp_on 8,0
83880 pause 200:goto Jyoushi_Input_Born_Day2:
83890 case 2:
83900 No=0:sp_on 13,1:sp_on 9,0
83910 pause 200:goto Jyoushi_Input_Born_Day2:
83920 case 0:
83930 pause 200:goto Jyoushi_Input_Born_Day2:
83940 case 7:
83950 No=4:sp_on 5,1:sp_on 4,0
83960 pause 200:goto Jyoushi_Input_Born_Day2:
83970 case 4:
83980 No=1:sp_on 6,1:sp_on 5,0
83990 pause 200:goto Jyoushi_Input_Born_Day2:
84000 case 1:
84010 pause 200:goto Jyoushi_Input_Born_Day2:
84020 end select
84030 endif
84040 '左へボタン 十字キー　左　or 　カーソル左
84050 if ((y2 = -1) or (key$ = chr$(29))) then
84060 select case No
84070 'Ok ボタン  Okから　左　０に行く
84080 case -1:
84090 No=0:sp_on 13,1:sp_on 14,0
84100 pause 200:goto Jyoushi_Input_Born_Day2:
84110 '0 ボタン  左　何もしない
84120 case 0:
84130 pause 200:goto Jyoushi_Input_Born_Day2:
84140 case 3:
84150 No=2:sp_on 9,1:sp_on 12,0:
84160 pause 200:goto Jyoushi_Input_Born_Day2:
84170 case 2:
84180 No=1:sp_on 6,1:sp_on 9,0:
84190 pause 200:goto Jyoushi_Input_Born_Day2:
84200 case 1:
84210 pause 200:goto Jyoushi_Input_Born_Day2:
84220 case 6:
84230 No=5:sp_on 8,1:sp_on 11,0
84240 pause 200:goto Jyoushi_Input_Born_Day2:
84250 case 5:
84260 No=4:sp_on 5,1:sp_on 8,0
84270 pause 200:goto Jyoushi_Input_Born_Day2:
84280 case 4:
84290 pause 200:goto Jyoushi_Input_Born_Day2:
84300 case 9:
84310 No=8:sp_on 7,1:sp_on 10,0
84320 pause 200:goto Jyoushi_Input_Born_Day2:
84330 case 8:
84340 No=7:sp_on 4,1:sp_on 7,0
84350 pause 200:goto Jyoushi_Input_Born_Day2:
84360 case 7:
84370 pause 200:goto Jyoushi_Input_Born_Day2:
84380 end select
84390 endif
84400 '右  十字キー　右　or カーソル　右
84410 if ((y2 = 1) or (key$ = chr$(28))) then
84420 select case No
84430 '0ボタンからokボタン右に移動
84440 case 0:
84450 No=-1:sp_on 14,1:sp_on 13,0
84460 pause 200:goto Jyoushi_Input_Born_Day2:
84470 '0ボタンからokボタン 右に移動　ここまで
84480 'OKボタンで右を押して何もしない
84490 case -1:
84500 pause 200:goto Jyoushi_Input_Born_Day2:
84510 case 1:
84520 No=2:sp_on 9,1:sp_on 6,0
84530 pause 200:goto Jyoushi_Input_Born_Day2:
84540 case 2:
84550 No=3:sp_on 12,1:sp_on 9,0
84560 pause 200:goto Jyoushi_Input_Born_Day2:
84570 case 3:
84580 pause 200:goto Jyoushi_Input_Born_Day2:
84590 case 4:
84600 No=5:sp_on 8,1:sp_on 5,0
84610 pause 200:goto Jyoushi_Input_Born_Day2:
84620 case 5:
84630 No=6:sp_on 11,1:sp_on 8,0
84640 pause 200:goto Jyoushi_Input_Born_Day2:
84650 case 7:
84660 No=8:sp_on 7,1:sp_on 4,0
84670 pause 200:goto Jyoushi_Input_Born_Day2:
84680 case 8:
84690 No=9:sp_on 10,1:sp_on 7,0
84700 pause 200:goto Jyoushi_Input_Born_Day2:
84710 case 9:
84720 pause 200:goto Jyoushi_Input_Born_Day2:
84730 case 6:
84740 pause 200:goto Jyoushi_Input_Born_Day2:
84750 end select
84760 'Okから右ボタンを押して何もしない ここまで
84770 endif
84780 '十字キー　ここまで
84790 '右の丸ボタンを押したとき
84800 if ((bg = 2) or (key$ = chr$(13))) then
84810 'count :決定ボタンを押した回数
84820 select case (count)
84830 '1桁目入力
84840 case 0:
84850 count = 1:
84860 if (No = -1) then
84870 '1桁目　OKでは何もしない
84880 No=c
84890 'goto Jyoushi_Input_Born_Day2:
84900 else
84910 'ok以外のボタンを押したとき
84920 buf_day = No:buf_Day$ = str$(No)
84930 buf_Jyoushi_Born_Day(2)=buf_day
84940 c=No
84950 locate 1,3
84960 print "                                      "
84970 color RGB(255,255,255)
84980 locate 1,3
84990 print "上司の生まれた日(1日~31日):" + buf_Day$
85000 endif
85010 'check2:
85020 'if (buf_day >= 1 and buf_day <= 9) then
85030 'sp_on 14,0
85040 'goto complate_jyoushi:
85050 'else
85060 'sp_on 14,0
85070 goto Jyoushi_Input_Born_Day2:
85080 'end
85090 'endif
85100 case 1:
85110 '10未満の数字ボタン+okボタン or 2桁目の数字ボタン
85120 count = 2:
85130 'locate 2,3
85140 'color RGB(255,255,255)
85150 'print "生まれた日(1日~31日):";buf_Day$
85160 'Okボタンを押したときの処理
85170 '入力値　10未満のとき
85180 'buf_day = c * 10 + No
85190 if (No = -1) then
85200 c=buf_day:No=0
85210 'buf_day = c
85220 buf_Day$ = str$(buf_day)
85230 '10以下のとき
85240 'if (buf_day < 10) then
85250 sp_on 14,0
85260 goto complate_jyoushi:
85270 'end
85280 'endif
85290 else
85300 'c=No
85310 buf_day = c * 10 + No
85320 buf_Day$ = str$(buf_day)
85330 'buf_day = c:buf_Day$=str$(buf_day)
85340 buf_Jyoushi_Born_Day(2)=buf_day
85350 locate 1,3
85360 print "                                           "
85370 locate 1,3
85380 color Rgb(255,255,255)
85390 print "上司の生まれた日(1日~31日):" + buf_Day$
85400 goto Jyoushi_Input_Born_Day2:
85410 'goto
85420 endif
85430 'endif
85440 '生まれた日　2桁目の数字　or 1桁の数字 + ok
85450 case 2:
85460 'buf_day = c * 10 + No
85470 'buf_Jyoushi_Born_Day(2)=buf_day
85480 'locate 1,3
85490 'print "                                      "
85500 'locate 1,3
85510 'locate 2,3
85520 'print "生まれた日(1日〜31日):";buf_Day
85530 'No=-1:ok ボタンを押したとき
85540 if (No = -1) then
85550 'if ((buf_day > 0) and (buf_day < 32)) then
85560 No=0
85570 sp_on 14,0
85580 goto complate_jyoushi:
85590 'end
85600 else
85610 goto Jyoushi_Input_Born_Day2:
85620 'endif
85630 'Okボタン以外を押したとき
85640 'else
85650 'c=val(buf_Day$)
85660 'buf_day = c * 10 + No
85670 'buf_Jyoushi_Born_Day(2) = buf_day
85680 'buf_Day$ = str$(buf_day)
85690 'locate 1,3
85700 'print "上司の生まれた日(1日~31日):";buf_Day$
85710 'goto Jyoushi_Input_Born_Day2:
85720 endif
85730 'case 3:
85740 'count=4
85750 'c=val(buf_day$)
85760 'buf_day=c*10+No
85770 'buf_day$=str$(buf_day)
85780 'locate 2,3
85790 'print "生まれた日を入れてください:";buf_day$
85800 'year=val(buf_year$)
85810 'if (No = -1) then
85820 'goto Jyoushi_Input_Born_Day:
85830 'sp_on 14,0:
85840 'goto complate_jyoushi:
85850 'else
85860 'goto Jyoushi_Input_Born_Month2:
85870 'endif
85880 'case 4:
85890 'bufyear=buf_year
85900 'if (No=-1) then
85910 'buf_day = val(buf_day$)
85920 'bufday = buf_day
85930 'sp_on 14,0
85940 'goto Jyoushi_Input_Born_Day2:
85950 'else
85960 'goto Jyoushi_Input_Born_Day2:
85970 'endif
85980 end select
85990 endif
86000 if (bg2=2) then
86010 select case count2
86020 case 0:
86030 if (No=-1) then
86040 buf_day=0:buf_Day$="**":No=0
86050 if (buf_day >= 1 and buf_day <= 31) then
86060 count=0
86070 buf_day=0:buf_Day$ = "**"
86080 goto rewrite_day3:
86090 else
86100 buf_day=0:buf_Day$ = "**"
86110 ui_msg"値が範囲外です"
86120 endif
86130 goto rewrite_day3:
86140 else
86150 goto rewrite_day3:
86160 endif
86170 rewrite_day3:
86180 locate 2,3
86190 color rgb(255,255,255)
86200 print "                                      "
86210 locate 2,3
86220 print "生まれた日(1日~31日):" + buf_Day$
86230 goto Jyoushi_Input_Born_Day2:
86240 end select
86250 endif
86260 '--------------------------------------------'
86270 'locate 2,0:color rgb(255,0,0)
86280 'print "上司の生まれた年代を入力"
86290 'color rgb(255,255,255)
86300 'locate 2,3:print "生まれた年代を西暦4桁で入れてください"
86310 'locate 2,4:Input "上司の生まれた年:",born_year
86320 '誕生日データーを配列に代入
86330 'buf_Jyoushi_Born_Year:上司の生まれた年代
86340 'buf_Jyoushi_Born_Day(0) = born_year
86350 'born_year = 0
86360 '---------------------------------------------'
86370 'goto Jyoushi_born_month:
86380 '1-2.生まれた月を入力
86390 'Jyoushi_born_month:
86400 'cls 3:gload Gazo$ + "Screen1.png",0,0,0
86410 'init "kb:4"
86420 'locate 2,1:
86430 'color rgb(255,0,0)
86440 'print "上司の生まれた月入力"
86450 'color rgb(255,255,255)
86460 'locate 2,4:print "生まれた月を入力してください"
86470 'locate 2,5
86480 'Input "上司の生まれ月:",born_month
86490 'buf_Jyoushi_Born_Day(1) = born_month
86500 'born_month = 0
86510 'goto Jyoushi_born_day:
86520 'buf_Jyoushi_Born_day
86530 '1-3.生まれた日を入力
86540 'Jyoushi_born_day:
86550 'cls 3:gload Gazo$ + "Screen1.png",0,0,0
86560 'init "kb:4"
86570 'locate 2,1:color rgb(255,0,0)
86580 'print "上司の生まれた日　入力"
86590 'locate 2,4:color rgb(255,255,255)
86600 'print "生まれた日を入力してください"
86610 'locate 2,5
86620 'Input "上司の生まれた日:",born_day
86630 'buf_Jyoushi_Born_Day(2) = born_day
86640 'born_day = 0
86650 'goto buka_born_year:
86660 '2.部下の誕生日入力
86670 '2-1.生まれた年を入力
86680 'buka_born_year:
86690 'cls 3:gload Gazo$+"Screen1.png",0,0,0
86700 'init "kb:2"
86710 'locate 1,1:color rgb(255,0,0)
86720 'print "部下の生まれた年代入力"
86730 'locate 0,4:color rgb(255,255,255)
86740 'print "部下の生まれた年（西暦4桁）を入れてください"
86750 'locate 0,5
86760 'Input "部下の生まれた年(西暦4桁):",born_year
86770 'buf_Buka_Born_Day(0) = born_year
86780 'born_year = 0
86790 '2-2.生まれた月を入力
86800 'buka_born_month:
86810 'cls 3:gload Gazo$+"Screen1.png",0,0,0
86820 'init "kb:2"
86830 'locate 2,1:color rgb(255,0,0)
86840 'print "部下の生まれた月 入力"
86850 'locate 2,4:color rgb(255,255,255)
86860 'print "部下の生まれた月を入力してください"
86870 'locate 2,5:Input "部下の生まれた月:",born_month
86880 'buf_Buka_Born_Day(1) = born_month
86890 '2-3.生まれた日を入力
86900 'buka_born_day:
86910 'cls 3:gload Gazo$ + "Screen1.png",0,0,0
86920 'init "kb:2"
86930 'locate 2,1:color rgb(255,0,0)
86940 'print "生まれた日入力"
86950 'color rgb(255,255,255)
86960 'locate 2,4:print "生まれた日を入力してください"
86970 'locate 2,5:Input "部下の生まれた日:",born_day
86980 'buf_Buka_Born_Day(2) = born_day
86990 'born_day=0:goto Result_Business_Aisyou:
87000 '--------------------------------------------'
87010 complate_jyoushi:
87020 a = buf_Jyoushi_Born_Day(0):b = buf_Jyoushi_Born_Day(1):c = buf_Jyoushi_Born_Day(2)
87030 buf_Jyoushi = Kabara_Num(a,b,c)
87040 a_1=buf_Jyoushi
87050 goto Buka_Input_Seireki:
87060 '--------------------------------------------'
87070 '部下'
87080 '1.部下の生まれた年代'
87090 Buka_Input_Seireki:
87100 cls 3:play "":count=0:count2=0
87110 init"kb:4"
87120 'No=-1:Okのとき
87130 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_buka_year$ = "****":buf_buka_year=0
87140 for i=0 to 3
87150 buf_Buka_Born_Day(i)=0
87160 next i
87170 '****************************************************************************************************
87180 'WUXG(1920x1200)の時ここから
87190 '****************************************************************************************************
87200 gload Gazo$ + "Screen2.png",0,0,0
87210 gload Gazo$ + "downscreen.png",0,0,800
87220 '****************************************************************************************************
87230 'WUXG(1920x1200)の時ここまで
87240 '****************************************************************************************************
87250 'Init"kb:2"
87260 '音声ファイル再生 2023.06.07
87270 play Voice$ + "Input_Born_Year_Buka_20230831.mp3"
87280 font 48
87290 locate 0,1
87300 '文字色：黒　 color rgb(0,0,0)
87310 color rgb(255,255,255)
87320 print "部下の生まれた年代を入れて下さい" + chr$(13)
87330 color rgb(255,255,255)
87340 locate 1,3
87350 print "部下の生まれた年代(西暦4桁):"+buf_buka_year$
87360 color rgb(255,255,255)
87370 'locate 4,6:print ":7"
87380 'locate 9,6:print ":8"
87390 'locate 12,6:print ":9"
87400 'locate 4,6
87410 'print ":7  :8  :9" + chr$(13)
87420 'color rgb(255,255,255)
87430 'locate 4,8
87440 'print ":4  :5  :6" + chr$(13)
87450 'color rgb(255,255,255)
87460 'locate 4,10
87470 'print ":1  :2  :3" + chr$(13)
87480 'locate 4,12
87490 'print "    :0"
87500 'locate 12,12
87510 'color rgb(0,0,255)
87520 'print ":Ok"
87530 sp_on 4,0: sp_on 5,0:sp_on 6,0
87540 sp_on 7,0:sp_on 8,0:sp_on 9,0
87550 sp_on 10,0:sp_on 11,0:sp_on 12,0
87560 sp_on 13,0:sp_on 14,1
87570 Buka_Input_Seireki2:
87580 key$="":bg=0:y=0:y2=0:bg2=0:
87590 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
87600 key$ = inkey$
87610 bg = strig(1)
87620 y = stick(1)
87630 y2 = stick(0)
87640 bg2=strig(0)
87650 pause 200
87660 wend
87670 '十字キー　ここから
87680 '上の矢印　または、十字キー上
87690 if ((y = -1) or (key$ = chr$(30))) then
87700 select case No
87710 'No=-1:okのとき:初期の状態
87720 '0kボタンから３に移動
87730 '上に行く 処理
87740 case -1:
87750 No=3:sp_on 12,1:sp_on 14,0
87760 pause 200:goto Buka_Input_Seireki2:
87770 '選択肢:3
87780 '3ボタンから 6に移動
87790 case 3:
87800 No=6:sp_on 12,0:sp_on 11,1
87810 pause 200:goto Buka_Input_Seireki2:
87820 '6ボタンから ９に移動
87830 case 6:
87840 No=9:sp_on 10,1:sp_on 11,0
87850 pause 200:goto Buka_Input_Seireki2:
87860 '6ボタンから ９に移動　ここまで
87870 '9で上を押して何もしない
87880 case 9:
87890 '何もしない
87900 No=9
87910 pause 200:goto Buka_Input_Seireki2:
87920 '9で上を押しても何もしない　ここまで
87930 '上　 0ボタンから2ボタン
87940 'sp_on 6,1:1
87950 'sp_on 8,1:5
87960 'sp_on 7,1:7
87970 case 0:
87980 No=2:sp_on 13,0:sp_on 9,1:
87990 pause 200:goto Buka_Input_Seireki2:
88000 '上  0ボタンから2ボタン　ここまで
88010 '2から５になる 上
88020 case 2:
88030 No=5:sp_on 8,1:sp_on 9,0:
88040 pause 200:goto Buka_Input_Seireki2:
88050 case 5:
88060 No=8:sp_on 7,1:sp_on 8,0
88070 pause 200:goto Buka_Input_Seireki2:
88080 case 8:
88090 pause 200:goto Buka_Input_Seireki2:
88100 case 1:
88110 No=4:sp_on 5,1:sp_on 6,0
88120 pause 200:goto Buka_Input_Seireki2:
88130 case 4:
88140 No=7:sp_on 4,1:sp_on 5,0
88150 pause 200:goto Buka_Input_Seireki2:
88160 case 7:
88170 pause 200:goto Buka_Input_Seireki2:
88180 end select
88190 endif
88200 '左３　ここまで
88210 '下の矢印
88220 '中央 2
88230 if ((y=1) or (key$ = chr$(31))) then
88240 select case No
88250 '9から６に下げる
88260 case 9:
88270 No=6:sp_on 11,1:sp_on 10,0
88280 pause 200:goto Buka_Input_Seireki2:
88290 '6から３に下げる
88300 case 6:
88310 No=3:sp_on 12,1:sp_on 11,0
88320 pause 200:goto Buka_Input_Seireki2:
88330 '3から０ｋに変える
88340 case 3:
88350 No=-1:sp_on 14,1:sp_on 12,0
88360 pause 200:goto Buka_Input_Seireki2:
88370 'Okから下のボタンを押しても何もしない
88380 case -1:
88390 pause 200:goto Buka_Input_Seireki2:
88400 case 8:
88410 No=5:sp_on 8,1:sp_on 7,0
88420 pause 200:goto Buka_Input_Seireki2:
88430 case 5:
88440 No=2:sp_on 9,1:sp_on 8,0
88450 pause 200:goto Buka_Input_Seireki2:
88460 case 2:
88470 No=0:sp_on 13,1:sp_on 9,0
88480 pause 200:goto Buka_Input_Seireki2:
88490 case 0:
88500 pause 200:goto Buka_Input_Seireki2:
88510 case 7:
88520 No=4:sp_on 5,1:sp_on 4,0
88530 pause 200:goto Buka_Input_Seireki2:
88540 case 4:
88550 No=1:sp_on 6,1:sp_on 5,0
88560 pause 200:goto Buka_Input_Seireki2:
88570 case 1:
88580 pause 200:goto Buka_Input_Seireki2:
88590 end select
88600 endif
88610 '左へボタン 十字キー　左　or 　カーソル左
88620 if ((y2 = -1) or (key$ = chr$(29))) then
88630 select case No
88640 'Ok ボタン  Okから　左　０に行く
88650 case -1:
88660 No=0:sp_on 13,1:sp_on 14,0
88670 pause 200:goto Buka_Input_Seireki2:
88680 '0 ボタン  左　何もしない
88690 case 0:
88700 pause 200:goto Buka_Input_Seireki2:
88710 case 3:
88720 No=2:sp_on 9,1:sp_on 12,0:
88730 pause 200:goto Buka_Input_Seireki2:
88740 case 2:
88750 No=1:sp_on 6,1:sp_on 9,0:
88760 pause 200:goto Buka_Input_Seireki2:
88770 case 1:
88780 pause 200:goto Buka_Input_Seireki2:
88790 case 6:
88800 No=5:sp_on 8,1:sp_on 11,0
88810 pause 200:goto Buka_Input_Seireki2:
88820 case 5:
88830 No=4:sp_on 5,1:sp_on 8,0
88840 pause 200:goto Buka_Input_Seireki2:
88850 case 4:
88860 pause 200:goto Buka_Input_Seireki2:
88870 case 9:
88880 No=8:sp_on 7,1:sp_on 10,0
88890 pause 200:goto Buka_Input_Seireki2:
88900 case 8:
88910 No=7:sp_on 4,1:sp_on 7,0
88920 pause 200:goto Buka_Input_Seireki2:
88930 case 7:
88940 pause 200:goto Buka_Input_Seireki2:
88950 end select
88960 endif
88970 '右  十字キー　右　or カーソル　右
88980 if ((y2 = 1) or (key$ = chr$(28))) then
88990 select case No
89000 '0ボタンからokボタン右に移動
89010 case 0:
89020 No=-1:sp_on 14,1:sp_on 13,0
89030 pause 200:goto Buka_Input_Seireki2:
89040 '0ボタンからokボタン 右に移動　ここまで
89050 'OKボタンで右を押して何もしない
89060 case -1:
89070 pause 200:goto Buka_Input_Seireki2:
89080 case 1:
89090 No=2:sp_on 9,1:sp_on 6,0
89100 pause 200:goto Buka_Input_Seireki2:
89110 case 2:
89120 No=3:sp_on 12,1:sp_on 9,0
89130 pause 200:goto Buka_Input_Seireki2:
89140 case 3:
89150 pause 200:goto Buka_Input_Seireki2:
89160 case 4:
89170 No=5:sp_on 8,1:sp_on 5,0
89180 pause 200:goto Buka_Input_Seireki2:
89190 case 5:
89200 No=6:sp_on 11,1:sp_on 8,0
89210 pause 200:goto Buka_Input_Seireki2:
89220 case 7:
89230 No=8:sp_on 7,1:sp_on 4,0
89240 pause 200:goto Buka_Input_Seireki2:
89250 case 8:
89260 No=9:sp_on 10,1:sp_on 7,0
89270 pause 200:goto Buka_Input_Seireki2:
89280 case 9:
89290 pause 200:goto Buka_Input_Seireki2:
89300 case 6:
89310 pause 200:goto Buka_Input_Seireki2:
89320 end select
89330 'Okから右ボタンを押して何もしない ここまで
89340 endif
89350 '十字キー　ここまで
89360 '＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝
89370 'ここからコメント
89380 '右の丸ボタン決定を押した数:count
89390 'if ((bg=2) or (key$=chr$(13))) then
89400 'select case count
89410 'case 0:
89420 'count=1
89430 'if (No = -1) then
89440 'count = 0
89450 'Okボタンを押したとき
89460 '
89470 'goto Buka_Input_Seireki2:
89480 'else
89490 'Okボタン以外が押されたとき
89500 'if (No >= 1 and No <= 2) then
89510 'buf_buka_year$ = "":buf_buka_year$ = str$(No)
89520 'buf_buka_year = No
89530 'buf_Buka_Born_Day(0) = bufyear
89540 'locate 2,3
89550 'color rgb(255,255,255)
89560 'print "部下の生まれた年代(西暦4桁):";buf_buka_year$
89570 'goto Buka_Input_Seireki2:
89580 'else
89590 'count=0
89600 'ui_msg"数字が範囲外になります。"
89610 'buf_buka_year$ ="":buf_buka_year=0
89620 'goto Buka_Input_Seireki2:
89630 'endif
89640 'endif
89650 'case 1:
89660 'count = 2
89670 'if (No = -1) then
89680 'count = 1
89690 'goto Buka_Input_Seireki2:
89700 'else
89710 'b = val(buf_buka_year$)
89720 'buf_buka_year = b * 10 + No
89730 'buf_buka_year$ = str$(buf_buka_year)
89740 'buf_Buka_Born_Day(0) = bufyear
89750 'locate 1,3
89760 'color rgb(255,255,255)
89770 'print "                                                                "
89780 'locate 1,3
89790 'print "部下の生まれた年代(西暦4桁):";buf_buka_year$
89800 'if (No = -1) then
89810 'count=1
89820 'goto Buka_Input_Seireki2:
89830 'endif
89840 'case 2:
89850 'count = 3
89860 'if (No = -1) then
89870 'count = 2
89880 'buf_Buka_Born_Day(0)=bufyear
89890 'goto Buka_Input_Seireki2:
89900 'else
89910 'b = val(buf_buka_year$)
89920 'buf_buka_year = b*10 + No
89930 'buf_buka_year$ = str$(buf_buka_year)
89940 'locate 1,3
89950 'color rgb(255,255,255)
89960 'print "                                        "
89970 'locate 1,3
89980 'print "部下の生まれた年代(西暦4桁):"+buf_buka_year$
89990 'goto Buka_Input_Seireki2:
90000 'endif
90010 'case 3:
90020 'count=4
90030 'if (No = -1) then
90040 'count=3
90050 'goto Buka_Input_Seireki2:
90060 'else
90070 'b = buf_buka_year
90080 'buf_buka_year = b * 10 + No
90090 'buf_buka_year$=str$(buf_buka_year)
90100 'locate 1,3
90110 'color RGB(255,255,255)
90120 'print "                                      "
90130 'locate 1,3
90140 'print "部下の生まれた年代(西暦4桁):";buf_buka_year$
90150 'buf_year=val(buf_year$)
90160 'year=val(buf_year$)
90170 'if (No=-1) then
90180 'goto Input_Born_Month:
90190 'else
90200 'goto Buka_Input_Seireki2:
90210 'endif
90220 'case 4:
90230 'bufyear=buf_year
90240 'if (No=-1) then
90250 'buf_year = val(buf_year$)
90260 'bufyear = buf_year
90270 'sp_on 14,0
90280 'goto Buka_Input_Born_Month:
90290 'else
90300 'goto Buka_Input_Seireki2:
90310 'endif
90320 'end select
90330 'endif
90340 'if (bg2 = 2) then
90350 'select case count2
90360 'case 0:
90370 'if (No = -1) then
90380 'buf_buka_year=0:buf_buka_year$=trim$(""):buf_buka_year$=trim$("****")
90390 'count=0
90400 'locate 1,3
90410 'color rgb(255,255,255)
90420 'print "                                      "
90430 'locate 1,3
90440 'print "部下の生まれた年代（西暦4桁):";buf_buka_year$
90450 'goto Buka_Input_Seireki2:
90460 'else
90470 '(buf_year=0) then
90480 'buf_buka_year=0:buf_buka_year$="****"
90490 'goto Buka_Input_Seireki2:
90500 'endif
90510 'endif
90520 'end select
90530 'endif
90540 'end
90550 'ここまでコメント
90560 '================================================================
90570 if ((bg=2) or (key$=chr$(13))) then
90580 select case count
90590 case 0:
90600 count = 1
90610 if (No=-1) then
90620 count = 0
90630 buf_Buka_Born_Day(0) = No
90640 'Okボタンを押したとき
90650 goto Buka_Input_Seireki2:
90660 else
90670 'Okボタン以外が押されたとき
90680 if (No>=1 and No<=2) then
90690 buf_buka_year$="":buf_buka_year$=str$(No) + "***":a = No
90700 buf_buka_year = No
90710 buf_Buka_Born_Day(0) = No
90720 locate 1,3
90730 color rgb(255,255,255)
90740 print "部下の生まれた年代(西暦4桁):";buf_buka_year$
90750 goto Buka_Input_Seireki2:
90760 else
90770 count=0
90780 ui_msg"数字が範囲外になります。"
90790 buf_buka_year$="":buf_buka_year=0
90800 goto Buka_Input_Seireki2:
90810 endif
90820 endif
90830 case 1:
90840 count = 2
90850 if (No = -1) then
90860 count = 1
90870 goto Buka_Input_Seireki2:
90880 else
90890 'b = val(buf_buka_year$)
90900 buf_buka_year = a * 10 + No
90910 b=buf_buka_year
90920 buf_buka_year$ = str$(buf_buka_year)+"**"
90930 buf_Buka_Born_Day(0)=buf_buka_year
90940 locate 1,3
90950 color rgb(255,255,255)
90960 print "                                                                "
90970 locate 1,3
90980 print "部下の生まれた年代(西暦4桁):"+buf_buka_year$
90990 'if (No = -1) then
91000 'count=1
91010 goto Buka_Input_Seireki2:
91020 endif
91030 case 2:
91040 count=3
91050 if (No=-1) then
91060 count =2:No=0
91070 goto Buka_Input_Seireki2:
91080 else
91090 'b = val(buf_buka_year$)
91100 buf_buka_year = b * 10 + No
91110 c = buf_buka_year
91120 buf_buka_year$ = str$(buf_buka_year) + "*"
91130 buf_Buka_Born_Day(0) = buf_buka_year
91140 locate 1,3
91150 color rgb(255,255,255)
91160 print "                                        "
91170 locate 1,3
91180 print "部下の生まれた年代(西暦4桁):";buf_buka_year$
91190 goto Buka_Input_Seireki2:
91200 endif
91210 case 3:
91220 count=4
91230 if (No = -1) then
91240 'count=3:No=0
91250 goto Buka_Input_Seireki2:
91260 else
91270 'b = val(buf_buka_year$)
91280 buf_buka_year=c * 10 + No
91290 buf_buka_year$=str$(buf_buka_year)
91300 buf_Buka_Born_Day(0)=buf_buka_year
91310 locate 1,3
91320 color RGB(255,255,255)
91330 print "                                      "
91340 locate 1,3
91350 print "部下の生まれた年代(西暦4桁):";buf_buka_year$
91360 buf_buka_year=val(buf_buka_year$)
91370 'year=val(buf_year$)
91380 'if (No=-1) then
91390 'goto Input_Born_Month:
91400 'else
91410 goto Buka_Input_Seireki2:
91420 endif
91430 case 4:
91440 'bufyear=buf_year
91450 if (No = -1) then
91460 buf_buka_year = val(buf_buka_year$)
91470 buf_Buka_Born_Day(0)=buf_buka_year
91480 sp_on 14,0
91490 goto Buka_Input_Born_Month:
91500 else
91510 goto Buka_Input_Seireki2:
91520 endif
91530 end select
91540 endif
91550 '================================================================
91560 'ここにコピーする。
91570 '================================================================
91580 'Input"部下の生れた年代(4桁,〜2025年):",year
91590 'if year > 2025 then goto Jyoushi_Input_Seireki:
91600 'if year = 123 then cls 3:cls 4:goto Main_Screen:
91610 '"4桁目"
91620 'bufyear4 = fix(year / 1000)
91630 '"3桁目"
91640 'bufyear3 = fix((year - (bufyear4 * 1000)) / 100)
91650 '"2桁目"
91660 'bufyear2 = fix((year - ((bufyear4 * 1000)+(bufyear3*100)))/10)
91670 '"1桁目"
91680 'bufyear1 = fix((year - ((bufyear4*
91690 'bufyear = bufyear1+bufyear2+bufyear3+bufyear4
91700 '1.部下の生まれた年代'
91710 '2.部下の生まれた月'
91720 Buka_Input_Born_Month:
91730 cls 3:play "":count=0:count2=0
91740 'No=-1:Okのとき
91750 key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_buka_Month$ = "**":buf_buka_month=0
91760 for i=0 to 1
91770 buf_month(i)=0
91780 next i
91790 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
91800 '****************************************************************************************************
91810 'WUXG(1920x1200)の時ここから
91820 '****************************************************************************************************
91830 gload Gazo$ + "Screen2.png",0,0,0
91840 gload Gazo$ + "downscreen.png",0,0,800
91850 '****************************************************************************************************
91860 'WUXG(1920x1200)の時ここから
91870 '****************************************************************************************************
91880 'Init"kb:4"
91890 '音声ファイル再生 2023.06.07
91900 play Voice$ + "Input_Born_Month_Buka_20230831.mp3"
91910 '****************************************************************************************************
91920 'WUXG(1920x1200)の時ここから
91930 '****************************************************************************************************
91940 font 48
91950 '****************************************************************************************************
91960 'WUXG(1920x1200)の時ここまで
91970 '****************************************************************************************************
91980 locate 0,1
91990 '文字色：黒　 color rgb(0,0,0)
92000 '文字色:白
92010 color rgb(255,255,255)
92020 print "部下の生まれた月を入れて下さい" + chr$(13)
92030 '文字色:白
92040 color rgb(255,255,255)
92050 locate 1,3
92060 '文字色:白
92070 print "部下の生まれた月(1月~12月):"+buf_buka_Month$
92080 color rgb(255,255,255)
92090 'locate 4,6:print ":7"
92100 'locate 9,6:print ":8"
92110 'locate 12,6:print ":9"
92120 'locate 4,6
92130 '文字色:赤
92140 'print ":7  :8  :9" + chr$(13)
92150 'color rgb(255,255,255)
92160 'locate 4,8
92170 'print ":4  :5  :6" + chr$(13)
92180 'color rgb(255,255,255)
92190 'locate 4,10
92200 'print ":1  :2  :3" + chr$(13)
92210 'locate 4,12
92220 'print "    :0"
92230 'locate 12,12
92240 'color rgb(0,0,255)
92250 'print ":Ok"
92260 sp_on 4,0: sp_on 5,0:sp_on 6,0
92270 sp_on 7,0:sp_on 8,0:sp_on 9,0
92280 sp_on 10,0:sp_on 11,0:sp_on 12,0
92290 sp_on 13,0:sp_on 14,1
92300 Buka_Input_Born_Month2:
92310 key$="":bg=0:y=0:y2=0:bg2=0
92320 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
92330 key$ = inkey$
92340 bg = strig(1)
92350 y = stick(1)
92360 y2 = stick(0)
92370 bg2 = strig(0)
92380 pause 200
92390 wend
92400 '十字キー　ここから
92410 '上の矢印　または、十字キー上
92420 if ((y = -1) or (key$ = chr$(30))) then
92430 select case No
92440 'No=-1:okのとき:初期の状態
92450 '0kボタンから３に移動
92460 '上に行く 処理
92470 case -1:
92480 No=3:sp_on 12,1:sp_on 14,0
92490 pause 200:goto Buka_Input_Born_Month2:
92500 '選択肢:3
92510 '3ボタンから 6に移動
92520 case 3:
92530 No=6:sp_on 12,0:sp_on 11,1
92540 pause 200:goto Buka_Input_Born_Month2:
92550 '6ボタンから ９に移動
92560 case 6:
92570 No=9:sp_on 10,1:sp_on 11,0
92580 pause 200:goto Buka_Input_Born_Month2:
92590 '6ボタンから ９に移動　ここまで
92600 '9で上を押して何もしない
92610 case 9:
92620 '何もしない
92630 No=9
92640 pause 200:goto Buka_Input_Born_Month2:
92650 '9で上を押しても何もしない　ここまで
92660 '上　 0ボタンから2ボタン
92670 'sp_on 6,1:1
92680 'sp_on 8,1:5
92690 'sp_on 7,1:7
92700 case 0:
92710 No=2:sp_on 13,0:sp_on 9,1:
92720 pause 200:goto Buka_Input_Born_Month2:
92730 '上  0ボタンから2ボタン　ここまで
92740 '2から５になる 上
92750 case 2:
92760 No=5:sp_on 8,1:sp_on 9,0:
92770 pause 200:goto Buka_Input_Born_Month2:
92780 case 5:
92790 No=8:sp_on 7,1:sp_on 8,0
92800 pause 200:goto Buka_Input_Born_Month2:
92810 case 8:
92820 pause 200:goto Buka_Input_Born_Month2:
92830 case 1:
92840 No=4:sp_on 5,1:sp_on 6,0
92850 pause 200:goto Buka_Input_Born_Month2:
92860 case 4:
92870 No=7:sp_on 4,1:sp_on 5,0
92880 pause 200:goto Buka_Input_Born_Month2:
92890 case 7:
92900 pause 200:goto Buka_Input_Born_Month2:
92910 end select
92920 endif
92930 '左３　ここまで
92940 '下の矢印
92950 '中央 2
92960 if ((y=1) or (key$ = chr$(31))) then
92970 select case No
92980 '9から６に下げる
92990 case 9:
93000 No=6:sp_on 11,1:sp_on 10,0
93010 pause 200:goto Buka_Input_Born_Month2:
93020 '6から３に下げる
93030 case 6:
93040 No=3:sp_on 12,1:sp_on 11,0
93050 pause 200:goto Buka_Input_Born_Month2:
93060 '3から０ｋに変える
93070 case 3:
93080 No=-1:sp_on 14,1:sp_on 12,0
93090 pause 200:goto Buka_Input_Born_Month2:
93100 'Okから下のボタンを押しても何もしない
93110 case -1:
93120 pause 200:goto Buka_Input_Born_Month2:
93130 case 8:
93140 No=5:sp_on 8,1:sp_on 7,0
93150 pause 200:goto Buka_Input_Born_Month2:
93160 case 5:
93170 No=2:sp_on 9,1:sp_on 8,0
93180 pause 200:goto Buka_Input_Born_Month2:
93190 case 2:
93200 No=0:sp_on 13,1:sp_on 9,0
93210 pause 200:goto Buka_Input_Born_Month2:
93220 case 0:
93230 pause 200:goto Buka_Input_Born_Month2:
93240 case 7:
93250 No=4:sp_on 5,1:sp_on 4,0
93260 pause 200:goto Buka_Input_Born_Month2:
93270 case 4:
93280 No=1:sp_on 6,1:sp_on 5,0
93290 pause 200:goto Buka_Input_Born_Month2:
93300 case 1:
93310 pause 200:goto Buka_Input_Born_Month2:
93320 end select
93330 endif
93340 '左へボタン 十字キー　左　or 　カーソル左
93350 if ((y2 = -1) or (key$ = chr$(29))) then
93360 select case No
93370 'Ok ボタン  Okから　左　０に行く
93380 case -1:
93390 No=0:sp_on 13,1:sp_on 14,0
93400 pause 200:goto Buka_Input_Born_Month2:
93410 '0 ボタン  左　何もしない
93420 case 0:
93430 pause 200:goto Buka_Input_Born_Month2:
93440 case 3:
93450 No=2:sp_on 9,1:sp_on 12,0:
93460 pause 200:goto Buka_Input_Born_Month2:
93470 case 2:
93480 No=1:sp_on 6,1:sp_on 9,0:
93490 pause 200:goto Buka_Input_Born_Month2:
93500 case 1:
93510 pause 200:goto Buka_Input_Born_Month2:
93520 case 6:
93530 No=5:sp_on 8,1:sp_on 11,0
93540 pause 200:goto Buka_Input_Born_Month2:
93550 case 5:
93560 No=4:sp_on 5,1:sp_on 8,0
93570 pause 200:goto Buka_Input_Born_Month2:
93580 case 4:
93590 pause 200:goto Buka_Input_Born_Month2:
93600 case 9:
93610 No=8:sp_on 7,1:sp_on 10,0
93620 pause 200:goto Buka_Input_Born_Month2:
93630 case 8:
93640 No=7:sp_on 4,1:sp_on 7,0
93650 pause 200:goto Buka_Input_Born_Month2:
93660 case 7:
93670 pause 200:goto Buka_Input_Born_Month2:
93680 end select
93690 endif
93700 '右  十字キー　右　or カーソル　右
93710 if ((y2 = 1) or (key$ = chr$(28))) then
93720 select case No
93730 '0ボタンからokボタン右に移動
93740 case 0:
93750 No=-1:sp_on 14,1:sp_on 13,0
93760 pause 200:goto Buka_Input_Born_Month2:
93770 '0ボタンからokボタン 右に移動　ここまで
93780 'OKボタンで右を押して何もしない
93790 case -1:
93800 pause 200:goto Buka_Input_Born_Month2:
93810 case 1:
93820 No=2:sp_on 9,1:sp_on 6,0
93830 pause 200:goto Buka_Input_Born_Month2:
93840 case 2:
93850 No=3:sp_on 12,1:sp_on 9,0
93860 pause 200:goto Buka_Input_Born_Month2:
93870 case 3:
93880 pause 200:goto Buka_Input_Born_Month2:
93890 case 4:
93900 No=5:sp_on 8,1:sp_on 5,0
93910 pause 200:goto Buka_Input_Born_Month2:
93920 case 5:
93930 No=6:sp_on 11,1:sp_on 8,0
93940 pause 200:goto Buka_Input_Born_Month2:
93950 case 7:
93960 No=8:sp_on 7,1:sp_on 4,0
93970 pause 200:goto Buka_Input_Born_Month2:
93980 case 8:
93990 No=9:sp_on 10,1:sp_on 7,0
94000 pause 200:goto Buka_Input_Born_Month2:
94010 case 9:
94020 pause 200:goto Buka_Input_Born_Month2:
94030 case 6:
94040 pause 200:goto Buka_Input_Born_Month2:
94050 end select
94060 'Okから右ボタンを押して何もしない ここまで
94070 endif
94080 '十字キー　ここまで
94090 '右の丸ボタン　決定キー
94100 if ((bg=2) or (key$=chr$(13))) then
94110 select case count
94120 case 0:
94130 count=1:buf_buka_Month$="*":buf_buka_Month$=str$(No)+"*":buf_buka_month=No
94140 buf_Buka_Born_Day(1)=buf_buka_month:a=buf_buka_month
94150 locate 1,3
94160 color RGB(255,255,255)
94170 print "部下の生まれた月(1月~12月):"+buf_buka_Month$
94180 goto Buka_Input_Born_Month2:
94190 case 1:
94200 count = 2:buf_buka_month=a*10+No
94210 if (No = -1) then
94220 'count=0
94230 month=buf_buka_month
94240 buf_buka_month=val(buf_buka_Month$)
94250 month=buf_buka_month
94260 '生まれた日に飛ぶ
94270 goto Buka_Input_Born_Day:
94280 else
94290 buf_buka_month = a * 10 + No
94300 buf_buka_Month$ = str$(buf_buka_month)
94310 buf_Buka_Born_Day(1) = buf_buka_month
94320 locate 1,3
94330 color Rgb(255,255,255)
94340 print "部下の生まれた月(1月~12月):" + buf_buka_Month$
94350 goto Buka_Input_Born_Month2:
94360 endif
94370 case 2:
94380 count=3
94390 'c= val(buf_Month$)
94400 'buf_month = c*10 + No
94410 'buf_Month$ = str$(buf_month)
94420 'locate 2,3
94430 'print "部下の生まれた月(1月～12月):";buf_Month$
94440 'goto Buka_Input_Born_Month2:
94450 'case 3:
94460 'count=4
94470 'b=val(buf_month$)
94480 'buf_month=c*10+No
94490 'buf_Month$=str$(buf_month)
94500 'locate 2,3
94510 'print "部下の生まれた月(1月～12月):";buf_Month$
94520 'buf_month=val(buf_Month$)
94530 'year=val(buf_year$)
94540 if (No=-1) then
94550 goto Buka_Input_Born_Day:
94560 else
94570 goto Input_Born_Month2:
94580 endif
94590 'case 4:
94600 'bufyear=buf_year
94610 'if (No=-1) then
94620 'buf_month = val(buf_Month$)
94630 'month = buf_month
94640 'sp_on 14,0
94650 'goto Input_Born_Day:
94660 'else
94670 'goto Input_Born_Month2:
94680 'endif
94690 end select
94700 endif
94710 '左の丸ボタン　キャンセル
94720 if (bg2=2) then
94730 select case count2
94740 case 0:
94750 if (No = -1) then
94760 buf_buka_month=0:buf_buka_Month$="**"
94770 count=0
94780 goto rewrite2:
94790 else
94800 if ((No>=1 and No<=9) or (No>=10 and No <=12)) then
94810 buf_month=0:buf_Month$="**"
94820 locate 2,3
94830 color rgb(255,255,255)
94840 print "                                       "
94850 goto rewrite2:
94860 if (No>12) then
94870 ui_msg"値が範囲外です。"
94880 goto rewrite2:
94890 endif
94900 endif
94910 endif
94920 rewrite2:
94930 locate 2,3
94940 color rgb(255,255,255)
94950 print "                                      "
94960 locate 2,3
94970 print "部下の生まれた月(1月~12月):";buf_buka_Month$
94980 goto Buka_Input_Born_Month2:
94990 end select
95000 'endif
95010 endif
95020 end
95030 '2.部下の生まれた月'
95040 '3.部下の生まれた日'
95050 '生れた日を入力
95060 Buka_Input_Born_Day:
95070 '生まれた日入力
95080 cls 3:play ""
95090 'No=-1:Okのとき
95100 init"kb:4":key$="":bg = 0:y = 0:No = -1:y2 = 0:buf_Day$ = "**":count=0:bg2=0
95110 for i=0 to 1
95120 buf_day(i)=0
95130 next i
95140 'gload Gazo$ + "Input_BornYear_20230601.png",0,0,0
95150 '****************************************************************************************************
95160 'WUXG(1920x1200)の時ここから
95170 '****************************************************************************************************
95180 gload Gazo$ + "Screen2.png",0,0,0
95190 gload Gazo$ + "downscreen.png",0,0,800
95200 '****************************************************************************************************
95210 'WUXG(1920x1200)の時ここまで
95220 '****************************************************************************************************
95230 'Init"kb:2"
95240 '音声ファイル再生 2023.06.07
95250 play Voice$ + "Input_Born_Day_Buka_20230831.mp3"
95260 font 48
95270 locate 0,1
95280 '文字色：黒　 color rgb(0,0,0)
95290 color rgb(255,255,255)
95300 print "部下の生まれた日を入れて下さい" + chr$(13)
95310 color rgb(255,255,255)
95320 locate 1,3
95330 print "部下の生まれた日(1日~31日):";buf_Day$
95340 color rgb(255,255,255)
95350 'locate 4,6:print ":7"
95360 'locate 9,6:print ":8"
95370 'locate 12,6:print ":9"
95380 'locate 4,6
95390 'print ":7  :8  :9" + chr$(13)
95400 'color rgb(255,255,255)
95410 'locate 4,8
95420 'print ":4  :5  :6" + chr$(13)
95430 'color rgb(255,255,255)
95440 'locate 4,10
95450 'print ":1  :2  :3" + chr$(13)
95460 'locate 4,12
95470 'print "    :0"
95480 'locate 12,12
95490 'color rgb(0,0,255)
95500 'print ":Ok"
95510 sp_on 4,0: sp_on 5,0:sp_on 6,0
95520 sp_on 7,0:sp_on 8,0:sp_on 9,0
95530 sp_on 10,0:sp_on 11,0:sp_on 12,0
95540 sp_on 13,0:sp_on 14,1
95550 Buka_Input_Born_Day2:
95560 '
95570 key$="":bg=0:y=0:y2=0:bg2=0
95580 while ((key$ <> chr$(13)) and (bg <> 2) and (y <> 1) and (y <> -1) and (y2 <> 1) and (y2 <> -1) and (key$ <> chr$(29)) and (bg2 <> 2))
95590 key$ = inkey$
95600 bg = strig(1)
95610 y = stick(1)
95620 y2 = stick(0)
95630 bg2 = strig(0)
95640 pause 200
95650 wend
95660 '十字キー　ここから
95670 '上の矢印　または、十字キー上
95680 if ((y = -1) or (key$ = chr$(30))) then
95690 select case No
95700 'No=-1:okのとき:初期の状態
95710 '0kボタンから３に移動
95720 '上に行く 処理
95730 case -1:
95740 No=3:sp_on 12,1:sp_on 14,0
95750 pause 200:goto Buka_Input_Born_Day2:
95760 '選択肢:3
95770 '3ボタンから 6に移動
95780 case 3:
95790 No=6:sp_on 12,0:sp_on 11,1
95800 pause 200:goto Buka_Input_Born_Day2:
95810 '6ボタンから ９に移動
95820 case 6:
95830 No=9:sp_on 10,1:sp_on 11,0
95840 pause 200:goto Buka_Input_Born_Day2:
95850 '6ボタンから ９に移動　ここまで
95860 '9で上を押して何もしない
95870 case 9:
95880 '何もしない
95890 No=9
95900 pause 200:goto Buka_Input_Born_Day2:
95910 '9で上を押しても何もしない　ここまで
95920 '上　 0ボタンから2ボタン
95930 'sp_on 6,1:1
95940 'sp_on 8,1:5
95950 'sp_on 7,1:7
95960 case 0:
95970 No=2:sp_on 13,0:sp_on 9,1:
95980 pause 200:goto Buka_Input_Born_Day2:
95990 '上  0ボタンから2ボタン　ここまで
96000 '2から５になる 上
96010 case 2:
96020 No=5:sp_on 8,1:sp_on 9,0:
96030 pause 200:goto Buka_Input_Born_Day2:
96040 case 5:
96050 No=8:sp_on 7,1:sp_on 8,0
96060 pause 200:goto Buka_Input_Born_Day2:
96070 case 8:
96080 pause 200:goto Buka_Input_Born_Day2:
96090 case 1:
96100 No=4:sp_on 5,1:sp_on 6,0
96110 pause 200:goto Buka_Input_Born_Day2:
96120 case 4:
96130 No=7:sp_on 4,1:sp_on 5,0
96140 pause 200:goto Buka_Input_Born_Day2:
96150 case 7:
96160 pause 200:goto Buka_Input_Born_Day2:
96170 end select
96180 endif
96190 '左３　ここまで
96200 '下の矢印
96210 '中央 2
96220 if ((y=1) or (key$ = chr$(31))) then
96230 select case No
96240 '9から６に下げる
96250 case 9:
96260 No=6:sp_on 11,1:sp_on 10,0
96270 pause 200:goto Buka_Input_Born_Day2:
96280 '6から３に下げる
96290 case 6:
96300 No=3:sp_on 12,1:sp_on 11,0
96310 pause 200:goto Buka_Input_Born_Day2:
96320 '3から０ｋに変える
96330 case 3:
96340 No=-1:sp_on 14,1:sp_on 12,0
96350 pause 200:goto Buka_Input_Born_Day2:
96360 'Okから下のボタンを押しても何もしない
96370 case -1:
96380 pause 200:goto Buka_Input_Born_Day2:
96390 case 8:
96400 No=5:sp_on 8,1:sp_on 7,0
96410 pause 200:goto Buka_Input_Born_Day2:
96420 case 5:
96430 No=2:sp_on 9,1:sp_on 8,0
96440 pause 200:goto Buka_Input_Born_Day2:
96450 case 2:
96460 No=0:sp_on 13,1:sp_on 9,0
96470 pause 200:goto Buka_Input_Born_Day2:
96480 case 0:
96490 pause 200:goto Buka_Input_Born_Day2:
96500 case 7:
96510 No=4:sp_on 5,1:sp_on 4,0
96520 pause 200:goto Buka_Input_Born_Day2:
96530 case 4:
96540 No=1:sp_on 6,1:sp_on 5,0
96550 pause 200:goto Buka_Input_Born_Day2:
96560 case 1:
96570 pause 200:goto Buka_Input_Born_Day2:
96580 end select
96590 endif
96600 '左へボタン 十字キー　左　or 　カーソル左
96610 if ((y2 = -1) or (key$ = chr$(29))) then
96620 select case No
96630 'Ok ボタン  Okから　左　０に行く
96640 case -1:
96650 No=0:sp_on 13,1:sp_on 14,0
96660 pause 200:goto Buka_Input_Born_Day2:
96670 '0 ボタン  左　何もしない
96680 case 0:
96690 pause 200:goto Buka_Input_Born_Day2:
96700 case 3:
96710 No=2:sp_on 9,1:sp_on 12,0:
96720 pause 200:goto Buka_Input_Born_Day2:
96730 case 2:
96740 No=1:sp_on 6,1:sp_on 9,0:
96750 pause 200:goto Buka_Input_Born_Day2:
96760 case 1:
96770 pause 200:goto Buka_Input_Born_Day2:
96780 case 6:
96790 No=5:sp_on 8,1:sp_on 11,0
96800 pause 200:goto Buka_Input_Born_Day2:
96810 case 5:
96820 No=4:sp_on 5,1:sp_on 8,0
96830 pause 200:goto Buka_Input_Born_Day2:
96840 case 4:
96850 pause 200:goto Buka_Input_Born_Day2:
96860 case 9:
96870 No=8:sp_on 7,1:sp_on 10,0
96880 pause 200:goto Buka_Input_Born_Day2:
96890 case 8:
96900 No=7:sp_on 4,1:sp_on 7,0
96910 pause 200:goto Buka_Input_Born_Day2:
96920 case 7:
96930 pause 200:goto Buka_Input_Born_Day2:
96940 end select
96950 endif
96960 '右  十字キー　右　or カーソル　右
96970 if ((y2 = 1) or (key$ = chr$(28))) then
96980 select case No
96990 '0ボタンからokボタン右に移動
97000 case 0:
97010 No=-1:sp_on 14,1:sp_on 13,0
97020 pause 200:goto Buka_Input_Born_Day2:
97030 '0ボタンからokボタン 右に移動　ここまで
97040 'OKボタンで右を押して何もしない
97050 case -1:
97060 pause 200:goto Buka_Input_Born_Day2:
97070 case 1:
97080 No=2:sp_on 9,1:sp_on 6,0
97090 pause 200:goto Buka_Input_Born_Day2:
97100 case 2:
97110 No=3:sp_on 12,1:sp_on 9,0
97120 pause 200:goto Buka_Input_Born_Day2:
97130 case 3:
97140 pause 200:goto Buka_Input_Born_Day2:
97150 case 4:
97160 No=5:sp_on 8,1:sp_on 5,0
97170 pause 200:goto Buka_Input_Born_Day2:
97180 case 5:
97190 No=6:sp_on 11,1:sp_on 8,0
97200 pause 200:goto Buka_Input_Born_Day2:
97210 case 7:
97220 No=8:sp_on 7,1:sp_on 4,0
97230 pause 200:goto Buka_Input_Born_Day2:
97240 case 8:
97250 No=9:sp_on 10,1:sp_on 7,0
97260 pause 200:goto Buka_Input_Born_Day2:
97270 case 9:
97280 pause 200:goto Buka_Input_Born_Day2:
97290 case 6:
97300 pause 200:goto Buka_Input_Born_Day2:
97310 end select
97320 'Okから右ボタンを押して何もしない ここまで
97330 endif
97340 '十字キー　ここまで
97350 '右の丸ボタンを押したとき
97360 if ((bg = 2) or (key$ = chr$(13))) then
97370 'count :決定ボタンを押した回数
97380 select case (count)
97390 '1桁目入力
97400 case 0:
97410 count = 1:
97420 if (No = -1) then
97430 '1桁目　OKでは何もしない
97440 'goto check:
97450 No=0
97460 else
97470 'ok以外のボタンを押したとき
97480 buf_buka_day = No:buf_buka_Day$ = str$(No)
97490 if (buf_buka_day = 1 or buf_buka_day=2 or buf_buka_buka_day=3 ) then
97500 buf_buka_Day$ = str$(No) + "*"
97510 endif
97520 a=No
97530 buf_Buka_Born_Day(2) = buf_buka_day
97540 locate 1,3
97550 print"                                      "
97560 color RGB(255,255,255)
97570 locate 1,3
97580 print "部下の生まれた日(1日~31日):" + buf_buka_Day$
97590 endif
97600 check2:
97610 if (No >= 1 and No <= 9) then
97620 sp_on 14,0
97630 goto Buka_Input_Born_Day2:
97640 else
97650 sp_on 14,0
97660 goto Result_Business_Aisyou:
97670 end
97680 endif
97690 case 1:
97700 '10未満の数字ボタン+okボタン or 2桁目の数字ボタン
97710 count = 2:
97720 'locate 2,3
97730 'color RGB(255,255,255)
97740 'print "生まれた日(1日~31日):";buf_Day$
97750 'Okボタンを押したときの処理
97760 '入力値　10未満のとき
97770 'c = buf_day
97780 if (No = -1) then
97790 'c=buf_day
97800 ' buf_day = c
97810 'buf_Day$ = str$(buf_day)
97820 '10以下のとき
97830 No=0
97840 if (buf_day < 10) then
97850 sp_on 14,0
97860 goto Result_Business_Aisyou:
97870 end
97880 endif
97890 else
97900 sp_on 14,0
97910 'c=No
97920 buf_buka_day = a * 10 + No
97930 buf_buka_Day$ = str$(buf_buka_day)
97940 buf_Buka_Born_Day(2) = buf_buka_day
97950 locate 0,3
97960 color Rgb(255,255,255)
97970 print "                                       "
97980 locate 1,3
97990 print "部下の生まれた日(1日~31日):" + buf_buka_Day$
98000 goto Buka_Input_Born_Day2:
98010 endif
98020 '生まれた日　2桁目の数字　or 1桁の数字 + ok
98030 case 2:
98040 count=0
98050 'c=val(buf_Day$)
98060 'buf_day=c*10+No
98070 'buf_Day$=str$(buf_day)
98080 'day=buf_day
98090 'locate 2,3
98100 'print "生まれた日(1日〜31日):";buf_Day$
98110 'No=-1:ok ボタンを押したとき
98120 if (No = -1) then No=0
98130 if ((buf_buka_day > 0) and (buf_buka_day < 32)) then
98140 sp_on 14,0
98150 goto Result_Business_Aisyou:
98160 else
98170 goto Buka_Input_Born_Day2:
98180 endif
98190 'Okボタン以外を押したとき
98200 else
98210 c=val(buf_buka_Day$)
98220 buf_buka_day = c * 10 + No
98230 buf_buka_Day$ = str$(buf_buka_day)
98240 locate 1,3
98250 print "                "
98260 locate 1,3
98270 print "生まれた日(1日~31日):"+buf_buka_Day$
98280 goto Buka_Input_Born_Day2:
98290 'endif
98300 case 3:
98310 count=4
98320 'c=val(buf_day$)
98330 'buf_day=c*10+No
98340 'buf_day$=str$(buf_day)
98350 'locate 2,3
98360 'print "生まれた日を入れてください:";buf_day$
98370 'year=val(buf_year$)
98380 if (No = -1) then
98390 'goto Buka_Input_Born_Day:
98400 sp_on 14,0:
98410 goto complate_jyoushi:
98420 else
98430 goto Buka_Input_Born_Month2:
98440 endif
98450 'case 4:
98460 'bufyear=buf_year
98470 'if (No=-1) then
98480 'buf_day = val(buf_day$)
98490 'bufday = buf_day
98500 'sp_on 14,0
98510 goto complate_jyoushi:
98520 'else
98530 'goto Buka_Input_Born_Day2:
98540 'endif
98550 end select
98560 endif
98570 if (bg2=2) then
98580 select case count2
98590 case 0:
98600 if (No=-1) then
98610 'buf_day=0:buf_Day$="**"
98620 if (buf_buka_day >= 1 and buf_buka_day <= 31) then
98630 count=0
98640 buf_buka_day=0:buf_buka_Day$="**"
98650 goto rewrite_day3:
98660 else
98670 buf_buka_day=0:buf_buka_Day$="**"
98680 ui_msg"値が範囲外です"
98690 endif
98700 goto rewrite_day3:
98710 else
98720 goto rewrite_day3:
98730 endif
98740 rewrite_day3:
98750 locate 2,3
98760 color rgb(255,255,255)
98770 print "                                      "
98780 locate 1,3
98790 print "生まれた日(1日~31日):"+buf_buka_Day$
98800 goto Buka_Input_Born_Day2:
98810 end select
98820 endif
98830 '3.部下の生まれた日'
98840 '部下'
98850 '--------------------------------------------'
98860 'ビジネの相性　結果表示
98870 Result_Business_Aisyou:
98880 cls 3:init "kb:4"
98890 a=0:b=0:c=0:d=0:e=0:f=0
98900 bg=0:key$=""
98910 '****************************************************************************************************
98920 'WUXG(1920x1200)の時ここから
98930 '****************************************************************************************************
98940 gload Gazo$ + "Screen1.png",0,0,0
98950 gload Gazo$ + "downscreen.png",0,0,800
98960 '****************************************************************************************************
98970 'WUXG(1920x1200)の時ここから
98980 '****************************************************************************************************
98990 sp_on 14,0
99000 d = buf_Buka_Born_Day(0):e = buf_Buka_Born_Day(1):f = buf_Buka_Born_Day(2)
99010 buf_Buka = Kabara_Num(d,e,f)
99020 a_2 = buf_Buka
99030 Result_Aisyou$ = Kabara_Aisyou$(a_1,a_2)
99040 locate 0,1
99050 color rgb(255,0,0)
99060 print "●.相性診断結果１"
99070 locate 0,4:
99080 color rgb(255,255,255)
99090 print "1.上司の名前:";buffer_name$(0)
99100 locate 0,6
99110 print buf_Jyoushi_Born_Day(0) ;"." ;buf_Jyoushi_Born_Day(1);"." ;buf_Jyoushi_Born_Day(2);",数秘:";buf_Jyoushi
99120 locate 0,8
99130 print "2.部下の名前:";buffer_name$(1)
99140 locate 0,10
99150 print buf_Buka_Born_Day(0);".";buf_Buka_Born_Day(1);".";buf_Buka_Born_Day(2); ",";"数秘:";buf_Buka
99160 locate 0,12
99170 print "3.上司と部下の相性:";Result_Aisyou$
99180 locate 1,15
99190 color rgb(0,0,0)
99200 print "丸ボタン右:相性の説明,丸ボタン左:再診断"
99210 while ((bg <> 2) and (key$ <> chr$(13)) and bg2<>2 )
99220 bg = strig(1)
99230 key$ = inkey$
99240 bg2 = strig(0)
99250 pause 5
99260 wend
99270 if ((bg = 2) or (key$ = chr$(13))) then goto Result_Business_Aisyou2:
99280 if (bg2 = 2) then
99290 cls 3:goto Business_Aishou_Input_1_parson:
99300 endif
99310 'ビジネスの相性占い　結果2　説明
99320 Result_Business_Aisyou2:
99330 cls 3:bg=0:bg2=0:key$="":buf$=read_explain$(Result_Aisyou$):init "kb:4"
99340 gload Gazo$ + "Screen1.png",0,0,0
99350 locate 0,1
99360 color rgb(255,0,0)
99370 print "●.相性の説明"
99380 color rgb(255,255,255)
99390 locate 0,4
99400 print "相性:";Result_Aisyou$
99410 locate 0,6:
99420 print "相性の説明:";buf$
99430 locate 0,15
99440 color rgb(0,0,0)
99450 print "右の丸ボタン:トップ,左のボタン:前の画面"
99460 while ((bg <> 2) and (key$ <> chr$(13)) and (bg2<>2))
99470 bg = strig(1)
99480 bg2 = strig(0)
99490 key$ = inkey$
99500 pause 200
99510 wend
99520 if ((bg = 2) or (key$ = chr$(13))) then goto Main_Screen:
99530 if ((bg2 = 2)) then goto Result_Business_Aisyou:
99540 'Birds Eye Menu List
99550 Result_Birtheye_List1:
99560 'dim List$(4) Topに定義
99570 List$(0) = "1.バーズアイグリッドをもう一度診断"
99580 List$(1) = "2.診断結果"
99590 List$(2) = "3.データーを保存"
99600 List$(3) = "4.トップ画面に戻る"
99610 Birds_List1 = ui_select("List$","Menu")
99620 select case (Birds_List1)
99630 case 0: '1.もう一度診断
99640 for i=0 to 8
99650 buffer(i)=0
99660 next i
99670 goto Input_name1_Birdseye:
99680 case 1: '2.次へ行く
99690 gosub BirdsEye_Result2:
99700 case 2: '3.データーを保存
99710 ui_msg "データーを保存します"
99720 goto BirdsEye_Save_data:
99730 case 3: '4.トップに戻る
99740 for i=0 to 8
99750 buffer(i)=0
99760 next i
99770 goto Main_Screen:
99780 end select
99790 'BirdsEye Data Save
99800 BirdsEye_Save_data:
99810 if dir$(Save_data_Birdseye$) = "" then
99820 Mkdir Save_data_Birdseye$
99830 endif
99840 open Save_data_Birdseye$ + "BirdsEyedata_List.dat" for append as #1
99850 print #1,ucase$(name1$) + "," + ucase$(name2$) + "," + str$(buffer(0))+ "," + str$(buffer(1)) + "," + str$(buffer(2))+"," + str$(buffer(3)) + "," + str$(buffer(4)) + "," + str$(buffer(5)) + "," + str$(buffer(6)) + "," + str$(buffer(7)) + "," + str$(buffer(8))
99860 close #1
99870 ui_msg "データーを保存しました"
99880 goto Result_Birtheye_List1:
99890 'return
99900 '自作関数 ここから
99910 BirdsEyeGrid_Entry:
99920 cls 3:init "kb:4":key$="":bg=0:flag=0:bg2=0:play""
99930 '****************************************************************************************************
99940 'WUXG(1920x1200)の時 1280x 800の時共通　ここから
99950 '****************************************************************************************************
99960 gload Gazo$ + "BirdsEyeGrid_Entry_1080x240_20231220.png",0,0,0
99970 '****************************************************************************************************
99980 'WUXG(1920x1200)の時 1280x 800の時共通 ここまで
99990 '****************************************************************************************************
100000 font FONT
100010 if dir$(Save_data_Birdseye$ + "BirdsEyedata_List.dat") = "" then
100020 locate 1,2:print "登録件数は0件です。" + chr$(13):flag=0
100030 locate 1,4:print "右の丸:メイン画面へ行く"
100040 else
100050 flag=1
100060 open Save_data_Birdseye$ + "BirdsEyedata_List.dat" for input as #1
100070 while (eof(1)=0)
100080 line input #1,a$
100090 n = n + 1
100100 wend
100110 close #1
100120 'endif
100130 talk "登録件数は"+str$(n)+"件です。"
100140 if ((size(0)<=1280) and (size(1)<=800)) then
100150 '*****************************************************************************************************
100160 '1280x800の時　ここから
100170 '*****************************************************************************************************
100180 locate 1,3:print "登録件数は";str$(n);"件です"
100190 locate 1,6:print "左の丸：メイン画面へ行く"
100200 '*****************************************************************************************************
100210 '1280x800の時　ここまで
100220 '*****************************************************************************************************
100230 else
100240 '*****************************************************************************************************
100250 'WUXG(1920x1280)の時　ここから
100260 '*****************************************************************************************************
100270 locate 1,2:print "登録件数は";str$(n);"件です"
100280 locate 1,4:print "左の丸：メイン画面へ行く"
100290 '*****************************************************************************************************
100300 'WUXG(1920x1280)の時　ここまで
100310 '*****************************************************************************************************
100320 endif
100330 endif
100340 Entry_Count:
100350 while (bg <> 2 and key$ <> chr$(13) and bg2 <> 2)
100360 key$ = inkey$
100370 bg = strig(1)
100380 bg2 = strig(0)
100390 pause 200
100400 wend
100410 if ((bg = 2) or (key$ = chr$(13))) then
100420 if (n = 0) then
100430 '登録件数　０件のとき　メイン画面に行く
100440 goto Main_Screen:
100450 else
100460 '登録件数1件以上　次へ行く
100470 'ここを変更する
100480 goto Entry_List:
100490 endif
100500 endif
100510 if (bg2 = 2) then
100520 if (n > 0) then
100530 goto Main_Screen:
100540 else
100550 goto Entry_Count:
100560 endif
100570 endif
100580 Entry_List:
100590 cls 3:play"":color rgb(255,255,255):init "kb:4"
100600 if ((size(0)<=1280) and (size(1)<=800)) then
100610 gload Gazo$ + Gazo_WXGA$ + "Result_Birtheye1_907x680_20240222.png",0,0,0
100620 else
100630 gload Gazo$ + "Result_Birtheye1_20230630.png",0,0,0
100640 endif
100650 dim buffer_List$(11,n)
100660 'ファイル読み込み ここから
100670 open Save_data_Birdseye$ + "BirdsEyedata_List.dat" for input as #1
100680 for i=0 to 10
100690 for j=0 to n-1
100700 input #1,a$
100710 buffer_List$(i,j)=a$
100720 next j
100730 next i
100740 close #1
100750 'erase buffer_List$
100760 'color rgb(255,255,255)
100770 i=0:key$="":bg=0:init"kb:4":bg2=0
100780 while (key$ <> chr$(13) and bg <> 2 and bg2 <> 2)
100790 key$ = inkey$
100800 bg = strig(1)
100810 bg2=strig(0)
100820 pause 200
100830 wend
100840 color rgb(0,0,0)
100850 locate 1,15:print "次へ"
100860 'show_ListData:
100870 'j=0
100880 repeat (j=0)
100890 show_ListData:
100900 cls
100910 color rgb(255,255,255)
100920 locate 6,3:print buffer_List$(0,j) + buffer_List$(1,j)
100930 '1の文字データー
100940 locate 4,14:print buffer_List$(2,j)
100950 '2の文字データー
100960 locate 4,9:print buffer_List$(3,j)
100970 '3の文字データー
100980 locate 4,5:print buffer_List$(4,j)
100990 '4の文字データー
101000 locate 11,14:print buffer_List$(5,j)
101010 '5の文字データー
101020 locate 11,9:PRINT buffer_List$(6,j)
101030 '6の文字データー
101040 locate 11,5:print buffer_List$(7,j)
101050 '7の文字データー
101060 locate 16,14:print buffer_List$(8,j)
101070 '8の文字データー
101080 locate 16,9:print buffer_List$(9,j)
101090 '9の文字データー
101100 locate 16,5:print buffer_List$(10,j)
101110 color rgb(0,0,0)
101120 locate 1,15:print "右の丸：次へ"
101130 if (bg=2 or key$=chr$(13)) then
101140 j=j+1
101150 endif
101160 if (bg2=2) then
101170 goto Main_Screen:
101180 endif
101190 until (j=n)
101200 'erase buffer_List$:
101210 goto show_ListData:
101220 'ファイル読み込み　ここまで
101230 func read_explain$(ba$)
101240 d$=""
101250 buf_String$=""
101260 if ba$="A" then
101270 open Business_Aisyou_Explain$ + "Business_Result_Explain_A.dat" for input as #1
101280 line input #1,a$
101290 a1$=mid$(a$,1,12)
101300 a2$=mid$(a$,13,17)
101310 a3$=mid$(a$,30,17)
101320 a4$=mid$(a$,47,18)
101330 a5$ = a1$ + chr$(13) + a2$ + chr$(13) + a3$+chr$(13)+a4$
101340 buf_String$ = a5$
101350 close #1
101360 endif
101370 if ba$="B"  then
101380 open Business_Aisyou_Explain$ + "Business_Result_Explain_B.dat" for input as #1
101390 line input #1,b$
101400 b1$=mid$(b$,1,15)
101410 b2$=mid$(b$,16,21)
101420 'b3$=mid$(b$,33,3)
101430 b4$ = b1$ + chr$(13) + b2$ + chr$(13)
101440 buf_String$ = b4$
101450 close #1
101460 endif
101470 if ba$="C"  then
101480 open Business_Aisyou_Explain$ + "Business_Result_Explain_C.dat" for input as #1
101490 line input #1,c$
101500 c1$ = Mid$(c$,1,15)
101510 c2$ = Mid$(c$,16,33)
101520 c3$ = c1$ + chr$(13) + c2$
101530 buf_String$ = c3$
101540 close #1
101550 endif
101560 if ba$="D" then
101570 open Business_Aisyou_Explain$ + "Business_Result_Explain_D.dat" for input as #1
101580 line input #1,d$
101590 d1$=mid$(d$,1,15)
101600 d2$=mid$(d$,16,22)
101610 d3$=mid$(d$,38,7)
101620 d4$ = d1$ + chr$(13) + d2$ + chr$(13) + d3$
101630 buf_String$ = d4$
101640 close #1
101650 endif
101660 if ba$="E"  then
101670 open Business_Aisyou_Explain$ + "Business_Result_Explain_E.dat" for input as #1
101680 line input #1,e$
101690 e1$=Mid$(e$,1,16)
101700 e2$=Mid$(e$,17,16)
101710 e3$=Mid$(e$,33,12)
101720 e4$=Mid$(e$,45,17)
101730 e5$=Mid$(e$,62,17)
101740 e6$ = e1$ +chr$(13) + e2$ + chr$(13) + e3$ + chr$(13) + e4$ + chr$(13) + e5$
101750 buf_String$ = e6$
101760 close #1
101770 endif
101780 if ba$="F" then
101790 '改行を追加して表示を調整
101800 open Business_Aisyou_Explain$ + "Business_Result_Explain_F.dat" for input as #1
101810 line input #1,f$
101820 f1$=Mid$(f$,1,15)
101830 f2$=Mid$(f$,16,12)
101840 buf_String$ = f1$+chr$(13)+f2$
101850 close #1
101860 endif
101870 if ba$="G" then
101880 open Business_Aisyou_Explain$ + "Business_Result_Explain_G.dat" for input as #1
101890 line input #1,g$
101900 g1$ = mid$(g$,1,16)
101910 g2$ = mid$(g$,17,18)
101920 g3$ = mid$(g$,36,21)
101930 g4$ = mid$(g$,56,6)
101940 g5$ = g1$ + chr$(13) + g2$ + chr$(13) + g3$ + chr$(13) +g4$
101950 buf_String$ = g5$
101960 close #1
101970 endif
101980 if ba$="H" then
101990 open Business_Aisyou_Explain$ + "Business_Result_Explain_H.dat" for input as #1
102000 line input #1,h$
102010 h1$=Mid$(h$,1,17)
102020 h2$=Mid$(h$,18,21)
102030 h3$=Mid$(h$,39,20)
102040 h$ = chr$(13) + h1$ + chr$(13) + h2$ + chr$(13) + h3$
102050 buf_String$ = h$
102060 close #1
102070 endif
102080 if ba$ = "I" then
102090 open Business_Aisyou_Explain$ + "Business_Result_Explain_I.dat" for input as #1
102100 line input #1,i$
102110 i1$=Mid$(i$,1,10)
102120 i2$=Mid$(i$,11,13)
102130 i3$=Mid$(i$,25,16)
102140 i$=i1$+chr$(13)+i2$+chr$(13)+i3$
102150 buf_String$ = i$
102160 close #1
102170 endif
102180 buffer$ = buf_String$
102190 endfunc buffer$
102200 'カバラ数（数秘番号を求める）
102210 func Kabara_Num(buffer_Year,month,day)
102220 '=============================
102230 'a1:4桁のうちの1桁目を求める
102240 '例 a1:1234の4が1桁目
102250 'a2:4桁のうちの2桁目を求める
102260 '例:a2:1234の3が2桁目
102270 'a3:4桁のうちの3桁目を求める
102280 '例 a3:1234の2が3桁目
102290 'a4:4桁のうちの4桁目を求める
102300 '例 a4:1234の1が4桁目
102310 '==============================
102320 a1=0:a2=0:a3=0:a4=0:a_=0:buffer=0
102330 Year = buffer_Year
102340 '処理1　整数部分を取り出す。
102350 a4 = fix(Year / 1000)
102360 a3 = fix(Year / 100) - (a4 * 10)
102370 a2 = fix(Year / 10) - (a4 * 100 + a3 * 10)
102380 a1 = fix(Year - (a4 * 1000 + a3 * 100 + a2 * 10))
102390 '処理　２　取り出した整数部分を足す。
102400 a_ = a1 + a2 + a3 + a4 +month + day
102410 'a1=0:a2=0:a3=0:a4=0
102420 if ((a_ = 11) or (a_ > 1 and a _< 9)) then
102430 buffer = a_
102440 'else
102450 goto recomp2:
102460 'if (a_ = 10) then
102470 '  buffer = 1
102480 endif
102490 recomp2:
102500 a5=0:a6=0
102510 a5 = fix(a_ / 10)
102520 a6 = (a_) - (a5 * 10)
102530 a_ = a5 + a6
102540 if ((a_>0 and a_<10) or (a_=11) or (a_=22)) then
102550 '結果に行く
102560 goto Res2:
102570 '  if ((a_>11) and (a_<99)) then
102580 else
102590 '再度計算
102600 goto recomp2:
102610 endif
102620 '     a1 = fix(a_ / 10)
102630 '     a2 = a_ - (a1 * 10)
102640 '     a_ = a1 + a2
102650 '     buffer = a_
102660 'endif
102670 'else
102680 '    bffer = a_
102690 'endif
102700 'endif
102710 'else
102720 'talk "プログラムを終了します。"
102730 'end
102740 'endif
102750 'kabara = 10
102760 Res2:
102770 kabara = a_
102780 endfunc kabara
102790 func Kabara_Aisyou$(buff1,buff2)
102800 a=0:b=0
102810 '範囲　1~9
102820 if ((buff1 > 0 and buff1 < 10)) then
102830 a = buff1
102840 else
102850 Select case buff1
102860 case 11:
102870 buff1=9:a=buff1
102880 case 22:
102890 buff1=10:a=buff1
102900 end select
102910 endif
102920 '範囲　１~９
102930 if ((buff2 > 0 and buff2 < 10)) then
102940 b = buff2
102950 else
102960 select case buff2
102970 case 11:
102980 buff2=9:b=buff2
102990 case 12:
103000 buff2=10:b=buff2
103010 end select
103020 endif
103030 Aisyou$ = Buffer_Business_Aisyou$(a,b)
103040 endfunc Aisyou$
103050 '**********************************************************
103060 '0-0.Top Screen Recheck: ここから
103070 '**********************************************************
103080 TopScreenRecheck:
103090 color rgb(217,255,212)
103100 locate 1,3:print  "                            "
103110 locate 1,4:print  "                            "
103120 locate 1,5
103130 print "番号を選んでください"
103140 locate 1,6:print  "                            "
103150 locate 1,7:print  " :1.数秘術占い"
103160 locate 1,8:print  "                            "
103170 locate 1,9:print  "                            "
103180 locate 1,10:print  "                            "
103190 locate 1,10:print  " :2.設 定"
103200 locate 1,11:print  "                            "
103210 locate 1,12:print  "                            "
103220 locate 1,13:print  " :3.ヘルプ"
103230 locate 1,14:print  "                            "
103240 locate 1,15:print  "                            "
103250 locate 1,16:print  "                            "
103260 locate 1,16:print  " :4.(プログラムを)終了する"
103270 locate 1,17:print  "                            "
103280 locate 1,18:print  "                            "
103290 return
103300 '**********************************************************
103310 '0-0.Top Screen Recheck:　ここまで
103320 '**********************************************************
103330 '***********************************************************
103340 '1-1.数秘術トップ画面 ここから
103350 '**********************************************************
103360 Kabara_TopScreen_Recheck:
103370 color rgb(255,255,255):font FONT
103380 locate 1,5
103390 print "番号を選んでください" + chr$(13)
103400 locate 1,7
103410 print " :1.数秘術占い" + chr$(13)
103420 locate 1,10
103430 print " :2.バーズアイグリット" + chr$(13)
103440 locate 1,13
103450 print " :3.相性占い" + chr$(13)
103460 locate 1,16
103470 print " :4.トップ画面に戻る" + chr$(13)
103480 return
103490 '***************************************************************
103500 '1-1.数秘術トップ画面　ここまで
103510 '*************************************************************
103520 '**********************************************************
103530 '2-1 Setting Top Screen ここから
103540 '**********************************************************
103550 Setting_Recheck:
103560 cls:color rgb(255,255,255)
103570 locate 1,3:print  "                            "
103580 locate 1,4:print  "                            "
103590 locate 1,5:
103600 print "番号を選んでください"
103610 locate 1,6:print  "                            "
103620 locate 1,7:
103630 print " :1.トップ画面に戻る"
103640 locate 1,8:print  "                            "
103650 locate 1,9:print  "                            "
103660 locate 1,10:
103670 print " :2.バーズアイグリッドデーターリスト"
103680 locate 1,11:print  "                            "
103690 locate 1,12:print  "                            "
103700 locate 1,13:
103710 print " :3.未実装" + chr$(13)
103720 locate 1,14:print  "                            "
103730 locate 1,15:print  "                            "
103740 locate 1,16:
103750 print " :4.未実装" + chr$(13)
103760 locate 1,17:print  "                            "
103770 locate 1,18:print  "                            "
103780 return
103790 '**********************************************************
103800 '2-1 Setting Top Screen ここまで
103810 '**********************************************************
103820 '**********************************************************
103830 '3-1Help Top ReCheck ここから
103840 '**********************************************************
103850 Help_Top_ReCheck:
103860 font FONT
103870 color rgb(217,255,212)
103880 locate 1,3:print  "                       "
103890 locate 1,4:print  "                       "
103900 locate 1,5:print "番号を選んでください"
103910 locate 1,6:print  "                       "
103920 '0
103930 locate 1,7:print " :1.ルールの説明"
103940 '1
103950 locate 1,8:print  "                       "
103960 locate 1,9:print  "                       "
103970 locate 1,10:print " :2.バージョンの表示"
103980 locate 1,11:print  "                      "
103990 locate 1,12:print  "                      "
104000 '2
104010 locate 1,13:print " :3.参考文献"
104020 locate 1,14:print  "                      "
104030 locate 1,15:print  "                      "
104040 '3
104050 locate 1,16:print " :4.トップ画面に戻る"
104060 return
104070 '**********************************************************
104080 '3-1.Help Top ReCheckここまで
104090 '**********************************************************
104100 '***********************************************************
104110 '**********************************************************
104120 Suhi_Rule_Screen_Recheck:
104130 color rgb(255,255,255)
104140 font FONT
104150 locate 1,3:print  "                       "
104160 locate 1,4:print  "                       "
104170 locate 1,5
104180 print "番号を選んでください"
104190 locate 1,6:print  "                       "
104200 locate 1,7:    '〇
104210 print " :1.数秘術のやり方"
104220 locate 1,8:print  "                       "
104230 locate 1,9:print  "                       "
104240 locate 1,10:   '〇
104250 print " :2.バーズアイグリットの説明"
104260 locate 1,11:print  "                       "
104270 locate 1,12:print  "                       "
104280 locate 1,13:    '〇
104290 print " :3.トップ画面に戻る"
104300 locate 1,14:print  "                       "
104310 locate 1,15:print  "                       "
104320 return
104330 '=============================
104340 '自作関数 ここまで
104350 '1.数秘術　トップ画面
104360 '
104370 'Data_erase:を一番最後に持ってくる
104380 '=============================
104390 Data_erase:
104400 'メモリー削除
104410 erase buf_male_year
104420 erase buf_male_month
104430 erase buf_male_Born_Day
104440 erase buf_feMale_Born_Day
104450 erase buf_female_day
104460 erase buf_name1$
104470 erase buf_name2$
104480 erase buffer
104490 erase buf_chart$
104500 erase Buffer_Business_Aisyou$
104510 erase buffer_name$
104520 '上司の誕生日
104530 erase buf_Jyoushi_Born_Day
104540 '部下の誕生日
104550 erase buf_Buka_Born_Day
104560 erase buf_year
104570 erase buf_month
104580 erase buf_day
104590 'フォーカスライン
104600 erase Forcus1_buffer$
104610 erase Forcus2_buffer$
104620 erase Forcus3_buffer$
104630 'erase buffer_List$
104640 'Birds eye List Data 配列
104650 erase List$
104660 buffer$ = ""
104670 buf$ = ""
104680 buf_year$ = ""
104690 buf_Jyoushi_Kabara_Num = 0
104700 buf_Buka_Kabara_Num = 0
104710 count = 0
104720 buf_Month$ = ""
104730 buf_Day$ = ""
104740 b=0
104750 c=0
104760 No=0
104770 count=0
104780 return
